{
  "termes": {
    "IR": {
      "titre": "Impôt sur le Revenu",
      "definition": "Impôt prélevé sur les revenus des personnes physiques. Les bénéfices de l'entreprise sont imposés directement sur votre déclaration personnelle.",
      "exemple": "Pour un entrepreneur individuel déclarant 50 000€ de bénéfices, l'IR sera calculé selon les tranches du barème progressif national."
    },
    "IS": {
      "titre": "Impôt sur les Sociétés",
      "definition": "Impôt prélevé sur les bénéfices des sociétés. Les bénéfices sont d'abord imposés au niveau de l'entreprise, puis une seconde fois lors de la distribution aux associés.",
      "exemple": "Une SARL réalisant 100 000€ de bénéfices paiera environ 25 000€ d'IS (taux standard de 25%)."
    },
    "TNS": {
      "titre": "Travailleur Non Salarié",
      "definition": "Statut social des indépendants. Les cotisations sociales sont calculées sur la base des bénéfices professionnels.",
      "exemple": "Un artisan en entreprise individuelle verra ses cotisations sociales calculées sur son bénéfice, et non sur sa rémunération."
    },
    "Assimilé salarié": {
      "titre": "Assimilé salarié",
      "definition": "Statut social des dirigeants de certaines sociétés. Ils bénéficient du régime général de la sécurité sociale comme les salariés.",
      "exemple": "Le président d'une SAS cotise comme un salarié sur sa rémunération, avec des cotisations patronales et salariales."
    },
    "Responsabilité limitée": {
      "titre": "Responsabilité limitée",
      "definition": "Protection juridique limitant les risques aux apports dans la société. Le patrimoine personnel de l'entrepreneur est généralement protégé des créanciers de l'entreprise.",
      "exemple": "En cas de faillite d'une SARL, les créanciers ne peuvent pas saisir la maison personnelle du gérant (sauf faute de gestion)."
    },
    "Responsabilité indéfinie": {
      "titre": "Responsabilité indéfinie",
      "definition": "Absence de séparation entre patrimoine personnel et professionnel. Les dettes professionnelles peuvent impacter les biens personnels.",
      "exemple": "Dans une SNC, si l'entreprise ne peut pas rembourser un prêt, les créanciers peuvent saisir les biens personnels des associés."
    },
    "Capital social": {
      "titre": "Capital social",
      "definition": "Somme d'argent ou valeur des biens apportés à une société lors de sa création. Représente la valeur financière initiale de l'entreprise.",
      "exemple": "Pour créer une SARL, les associés peuvent apporter 1000€ au total qui constitueront le capital social initial."
    },
    "Dividendes": {
      "titre": "Dividendes",
      "definition": "Part des bénéfices distribués aux associés ou actionnaires d'une société. Ces revenus sont imposés spécifiquement (PFU 30% ou barème progressif).",
      "exemple": "Une SAS ayant réalisé 100 000€ de bénéfices après IS peut distribuer jusqu'à 75 000€ de dividendes à ses actionnaires."
    },
    "PFU": {
      "titre": "Prélèvement Forfaitaire Unique",
      "definition": "Aussi appelé 'flat tax', c'est un taux global de 30% (12,8% d'impôt + 17,2% de prélèvements sociaux) applicable aux revenus du capital.",
      "exemple": "Pour 10 000€ de dividendes perçus, un actionnaire sera imposé à hauteur de 3 000€ avec le PFU."
    },
    "Micro-entreprise": {
      "titre": "Micro-entreprise",
      "definition": "Régime simplifié pour les petites entreprises individuelles, caractérisé par des formalités allégées et une fiscalité forfaitaire.",
      "exemple": "Un consultant indépendant en micro-entreprise déclare ses revenus et paie ses charges par un pourcentage fixe du chiffre d'affaires."
    },
    "EURL": {
      "titre": "Entreprise Unipersonnelle à Responsabilité Limitée",
      "definition": "Forme de SARL avec un seul associé. Combine les avantages de l'entreprise individuelle et de la société.",
      "exemple": "Un plombier qui souhaite protéger son patrimoine personnel peut opter pour l'EURL plutôt que l'entreprise individuelle."
    },
    "SASU": {
      "titre": "Société par Actions Simplifiée Unipersonnelle",
      "definition": "Forme de SAS avec un seul associé. Offre une grande souplesse statutaire et le statut social d'assimilé salarié.",
      "exemple": "Un consultant informatique créant une SASU pourra percevoir un salaire et des dividendes, tout en bénéficiant de la protection sociale du régime général."
    },
    "Levée de fonds": {
      "titre": "Levée de fonds",
      "definition": "Processus par lequel une entreprise obtient des financements auprès d'investisseurs en échange de parts de capital.",
      "exemple": "Une startup en SAS peut céder 20% de son capital à un business angel en échange de 200 000€ d'investissement."
    }
  }
}