{
  "impot_societes": {
    "definition": "Impôt payé par les sociétés sur leurs bénéfices. Le taux standard en 2025 est de 25%, avec un taux réduit de 15% sur les premiers 42 500€ de bénéfices pour les PME.",
    "example": "Une SAS avec 100 000€ de bénéfices paie 25 000€ d'IS.",
    "related_terms": ["IS", "taux réduit", "résultat fiscal"]
  },
  "micro_entreprise": {
    "definition": "Régime simplifié pour entrepreneurs individuels avec des plafonds de chiffre d'affaires (188 700€ pour les ventes et 77 700€ pour les services en 2025).",
    "example": "Un consultant en micro-entreprise bénéficie d'un abattement forfaitaire de 34% sur son CA.",
    "related_terms": ["auto-entrepreneur", "régime micro-fiscal", "franchise en base de TVA"]
  },
  "tva": {
    "definition": "Taxe sur la Valeur Ajoutée, impôt indirect sur la consommation. Les principaux taux en France sont 20% (normal), 10% et 5,5% (réduits).",
    "example": "Une entreprise facture la TVA à ses clients et la reverse à l'État.",
    "related_terms": ["franchise en base", "TVA déductible", "TVA collectée"]
  },
  "sasu": {
    "definition": "Société par Actions Simplifiée Unipersonnelle, forme juridique avec un actionnaire unique et grande flexibilité de gouvernance.",
    "example": "Un entrepreneur a créé une SASU pour son activité de conseil avec 1€ de capital social.",
    "related_terms": ["SAS", "président", "assimilé salarié"]
  },
  "eurl": {
    "definition": "Entreprise Unipersonnelle à Responsabilité Limitée, variante de la SARL avec un seul associé, permettant de choisir entre l'IR et l'IS.",
    "example": "L'EURL lui permet de choisir entre l'IR et l'IS tout en protégeant son patrimoine personnel.",
    "related_terms": ["SARL", "gérance", "parts sociales"]
  },
  "responsabilite_limitee": {
    "definition": "Principe juridique selon lequel la responsabilité financière des associés est limitée à leurs apports dans la société, protégeant ainsi leur patrimoine personnel.",
    "example": "En SARL, les créanciers ne peuvent saisir que les actifs de l'entreprise, pas les biens personnels des associés.",
    "related_terms": ["apports", "protection du patrimoine", "responsabilité des dirigeants"]
  },
  "ci_exploitation": {
    "definition": "Le compte courant d'associé est un prêt d'un associé à sa société, comptabilisé comme une dette de l'entreprise, remboursable et généralement rémunéré par des intérêts.",
    "example": "L'associé a apporté 50 000€ en compte courant pour financer le développement de la société.",
    "related_terms": ["apport en compte courant", "convention de compte courant", "blocage des comptes courants"]
  },
  "acre": {
    "definition": "Aide aux Créateurs et Repreneurs d'Entreprise, dispositif d'exonération partielle de charges sociales durant la première année d'activité.",
    "example": "Grâce à l'ACRE, l'entrepreneur bénéficie d'une réduction de 50% de ses cotisations sociales la première année.",
    "related_terms": ["exonération de charges", "création d'entreprise", "cotisations sociales"]
  },
  "bspce": {
    "definition": "Bons de Souscription de Parts de Créateur d'Entreprise, mécanisme permettant aux startups d'offrir à leurs salariés la possibilité d'acquérir des actions à un prix préférentiel.",
    "example": "La startup a émis des BSPCE pour motiver ses développeurs clés.",
    "related_terms": ["stock-options", "actions gratuites", "incentive"]
  },
  "clause_agrement": {
    "definition": "Disposition statutaire subordonnant la cession de titres sociaux à l'accord préalable des autres associés ou d'un organe social.",
    "example": "La clause d'agrément empêche l'entrée d'un nouveau partenaire sans l'accord des associés existants.",
    "related_terms": ["droit de préemption", "incessibilité", "statuts"]
  },
  "regime_reel": {
    "definition": "Régime fiscal où l'imposition est calculée sur le bénéfice réel de l'entreprise, déterminé par la différence entre les produits et les charges réelles.",
    "example": "Contrairement au régime micro, le régime réel permet de déduire toutes les charges justifiées.",
    "related_terms": ["comptabilité d'engagement", "réel simplifié", "réel normal"]
  },
  "dividendes": {
    "definition": "Part des bénéfices distribués aux actionnaires ou associés d'une société en proportion de leurs participations.",
    "example": "La société a distribué 30% de son bénéfice en dividendes à ses actionnaires.",
    "related_terms": ["PFU", "prélèvement forfaitaire unique", "flat tax"]
  },
  "tns": {
    "definition": "Travailleur Non Salarié, statut social des indépendants (commerçants, artisans, professions libérales) qui ne sont pas salariés.",
    "example": "En tant que TNS, l'entrepreneur paie des cotisations sociales différentes d'un salarié.",
    "related_terms": ["SSI", "indépendant", "cotisations sociales"]
  },
  "assimile_salarie": {
    "definition": "Statut social attribué à certains dirigeants (comme les présidents de SAS) qui, bien que mandataires sociaux, bénéficient du régime général de la sécurité sociale.",
    "example": "Le président de SASU est assimilé salarié et cotise au régime général.",
    "related_terms": ["régime général", "cotisations sociales", "protection sociale"]
  },
  "pfu": {
    "definition": "Prélèvement Forfaitaire Unique (ou 'flat tax'), impôt forfaitaire de 30% (12,8% d'impôt + 17,2% de prélèvements sociaux) sur les revenus du capital.",
    "example": "Les dividendes sont imposés au PFU de 30% sauf option pour le barème progressif.",
    "related_terms": ["dividendes", "plus-values mobilières", "revenus du capital"]
  },
  "sarl": {
    "definition": "Société à Responsabilité Limitée, structure permettant de limiter la responsabilité des associés à leurs apports, avec une gérance souple.",
    "example": "La SARL familiale compte 3 associés dont le gérant majoritaire.",
    "related_terms": ["gérant", "parts sociales", "EURL"]
  },
  "sas": {
    "definition": "Société par Actions Simplifiée, forme juridique offrant une grande liberté statutaire et adaptée aux projets nécessitant des levées de fonds.",
    "example": "La startup a choisi la SAS pour sa flexibilité et sa capacité à attirer des investisseurs.",
    "related_terms": ["président", "actions", "pacte d'actionnaires"]
  },
  "regime_micro": {
    "definition": "Régime fiscal simplifié applicable aux entreprises individuelles dont le chiffre d'affaires est inférieur à certains seuils, avec un abattement forfaitaire pour frais.",
    "example": "Avec le régime micro-BNC, le consultant bénéficie d'un abattement forfaitaire de 34%.",
    "related_terms": ["micro-social", "micro-fiscal", "abattement forfaitaire"]
  },
  "is": {
    "definition": "Impôt sur les Sociétés, prélevé sur les bénéfices réalisés par les sociétés et autres personnes morales.",
    "example": "La SAS est soumise à l'IS au taux de 25% en 2025.",
    "related_terms": ["résultat fiscal", "taux réduit", "acomptes d'IS"]
  },
  "ir": {
    "definition": "Impôt sur le Revenu, appliqué aux revenus des personnes physiques selon un barème progressif par tranches.",
    "example": "Les bénéfices de l'entreprise individuelle sont imposés à l'IR dans la catégorie BIC.",
    "related_terms": ["barème progressif", "quotient familial", "tranche marginale"]
  },
  "capital_social": {
    "definition": "Montant des apports effectués par les associés lors de la création d'une société ou ultérieurement, représentant sa situation nette initiale.",
    "example": "Le capital social de la SARL a été fixé à 5 000€, divisé en 500 parts de 10€.",
    "related_terms": ["apports", "capital minimum", "libération du capital"]
  },
  "pacte_associes": {
    "definition": "Convention extrastatutaire conclue entre tout ou partie des associés d'une société pour organiser leurs relations et compléter les statuts.",
    "example": "Le pacte d'associés prévoit un droit de préemption en cas de cession de parts.",
    "related_terms": ["clause de sortie conjointe", "clause d'inaliénabilité", "confidentialité"]
  },
  "chiffre_affaires": {
    "definition": "Montant total des ventes de biens ou de services réalisées par une entreprise dans le cadre de son activité professionnelle normale.",
    "example": "Le CA annuel de l'entreprise a atteint 250 000€, en hausse de 15% par rapport à l'année précédente.",
    "related_terms": ["revenu", "produits d'exploitation", "volume d'affaires"]
  },
  "resultat_fiscal": {
    "definition": "Bénéfice ou déficit d'une entreprise déterminé selon les règles fiscales, servant de base au calcul de l'impôt sur les sociétés ou sur le revenu.",
    "example": "Après réintégration des charges non déductibles, le résultat fiscal s'élève à 85 000€.",
    "related_terms": ["bénéfice imposable", "résultat comptable", "retraitements fiscaux"]
  }
}