{
    "Agressif": {
        "Commentaire": "📰 **Actualités** — Les marchés sont actuellement influencés par des nouvelles économiques contrastées. Aux États-Unis, bien que l'IPO de Circle ait été jugée négative, l'expansion de Metaplanet dans le Bitcoin est positive. En France, les banques montrent des poches de croissance malgré des défis économiques. 📈 **Marchés** — En Amérique Latine, le NASDAQ Brazil Large Mid Cap Index a progressé de 14,78% YTD, tandis qu'en Asie, la NASDAQ Korea Large Mid Cap Index a vu une augmentation de 5,96%. 🏭 **Secteurs** — Le secteur technologique est dynamique avec le NASDAQ US Tech Large Mid Cap Index à +1,16% sur la journée. En revanche, le secteur immobilier en Europe reste sous pression. 📊 **Choix des actifs** — Le portefeuille agressif inclut des actifs technologiques et des crypto-monnaies performantes, en ligne avec les tendances de marché. Les ETF comme Hang Seng TECH et Solactive China Technology offrent une exposition au secteur technologique en croissance. Les cryptos comme Maker et TRON, qui affichent de bonnes performances sur 7 jours, sont incluses pour leur potentiel de rendement élevé.",
        "Actions": {
            "RADIUS-A": "6%",
            "H&E EQUIPMENT SV": "7%",
            "THALES": "6%"
        },
        "Crypto": {
            "Maker (MKR)": "8%",
            "TRON (TRX)": "7%",
            "Toncoin (TON)": "6%",
            "Zcash (ZEC)": "7%",
            "EOS (EOS)": "7%"
        },
        "ETF": {
            "Hang Seng TECH": "7%",
            "Solactive China Technology": "7%",
            "VanEck Space Innovators ETF A USD Acc": "7%"
        },
        "Obligations": {
            "JP Morgan Emerging Markets Risk-Aware Bond (EUR Hedged)": "6%",
            "Bloomberg US Long Treasury (EUR Hedged)": "8%"
        }
    },
    "Modéré": {
        "Commentaire": "📰 **Actualités** — Les perspectives économiques globales montrent des signes de volatilité, avec des nouvelles mixtes provenant des marchés américains et européens. 📈 **Marchés** — Le marché européen, bien que stable, présente des indices YTD positifs sur le DAX et le CAC 40. En Amérique Latine, le marché montre une solide performance, notamment au Brésil. 🏭 **Secteurs** — Les secteurs de la consommation discrétionnaire et des technologies affichent de la vigueur, avec de bonnes performances des ETF liés à ces secteurs. 📊 **Choix des actifs** — Ce portefeuille modéré diversifie ses sources de rendement avec des ETF comme MSCI Emerging Markets Eastern Europe ex Russia et des obligations telles que le Bloomberg US Government Inflation-Linked Bond. L'accent est mis sur une répartition équilibrée entre actions, obligations, et ETF, pour réduire le risque tout en capturant le potentiel de croissance.",
        "Actions": {
            "GADSDENPROP REIT": "5%",
            "WILLAMETTE VY VI": "6%",
            "SES": "5%"
        },
        "Crypto": {
            "PAX Gold (PAXG)": "6%",
            "Fasttoken (FTN)": "5%"
        },
        "ETF": {
            "MSCI Emerging Markets Eastern Europe ex Russia": "7%",
            "NASDAQ US Tech Large Mid Cap Index": "6%"
        },
        "Obligations": {
            "Bloomberg US Government Inflation-Linked Bond (EUR Hedged)": "7%",
            "iBoxx® USD Treasuries (EUR Hedged)": "5%",
            "JP Morgan USD Emerging Markets Diversified 3% capped 1-5 (EUR Hedged)": "7%"
        }
    },
    "Stable": {
        "Commentaire": "📰 **Actualités** — L'économie mondiale continue de naviguer dans un environnement complexe, marqué par des tensions géopolitiques et des ajustements monétaires. 📈 **Marchés** — Les marchés nord-américains sont relativement stables, avec un S&P 500 légèrement en hausse. En Europe, le CAC 40 et le DAX affichent une croissance modérée YTD. 🏭 **Secteurs** — Le secteur de la santé et de l'énergie montrent une certaine résilience avec des indices positifs comme le Stoxx Europe 600 Health Care. 📊 **Choix des actifs** — Le portefeuille stable se concentre sur des ETF bien établis et des obligations de haute qualité pour assurer la stabilité. Les actions sélectionnées, telles que RHEINMETALL et DASSAULT AVIATION, sont choisies pour leur potentiel de résilience dans un contexte macroéconomique incertain.",
        "Actions": {
            "RHEINMETALL": "5%",
            "DASSAULT AVIATION": "5%"
        },
        "Crypto": {},
        "ETF": {
            "EURO STOXX® Quality Dividend 50": "6%",
            "MSCI Greece IMI + Coca-Cola 20/35": "6%",
            "DAX®": "5%"
        },
        "Obligations": {
            "Bloomberg US Long Treasury (EUR Hedged)": "7%",
            "ICE US Treasury 7-10 Year (EUR Hedged)": "7%",
            "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "7%",
            "Bloomberg Global Aggregate US Treasury Float Adjusted (EUR Hedged)": "7%"
        }
    }
}