{
    "Agressif": {
        "Commentaire": "📰 Actualités — Actuellement, les marchés sont confrontés à des défis tels que les tarifs douaniers et la volatilité, ce qui impacte particulièrement les actions américaines. Toutefois, les secteurs technologiques et financiers montrent des signes de résilience. 📈 Marchés — En Europe, les indices comme le DAX et le CAC 40 affichent des performances positives YTD, tandis que le marché nord-américain, notamment le NASDAQ, est en difficulté. 🏭 Secteurs — Le secteur technologique européen et les services financiers émergent comme des leaders potentiels. 📊 Choix des actifs — Le portefeuille inclut des actions ayant une forte performance YTD, comme RHEINMETALL et THALES, reflétant la dynamique positive du secteur de la défense. L'inclusion de cryptomonnaies comme EOS et PAX Gold capitalise sur leur performance positive sur 7 jours, et les ETF comme Solactive China Technology (EUR Hedged) offrent une exposition stratégique au secteur technologique.",
        "Actions": {
            "RHEINMETALL": "8%",
            "THALES": "8%",
            "DASSAULT AVIATION": "7%",
            "LEONARDO": "7%",
            "SES": "6%"
        },
        "Crypto": {
            "EOS": "8%",
            "PAX Gold (PAXG)": "7%",
            "Compound (COMP)": "6%",
            "Curve DAO Token (CRV)": "6%",
            "Pendle (PENDLE)": "6%"
        },
        "ETF": {
            "Solactive China Technology (EUR Hedged)": "8%",
            "Hang Seng TECH": "8%"
        },
        "Obligations": {}
    },
    "Modéré": {
        "Commentaire": "📰 Actualités — Les perspectives économiques mondiales sont marquées par une incertitude persistante, bien que certains secteurs comme la finance et la consommation en Europe montrent des signes de croissance. 📈 Marchés — Les indices européens comme le DAX et le IBEX 35 continuent de croître, contrairement au marché nord-américain qui reste volatil. 🏭 Secteurs — Le secteur financier européen et les ETF optimisés pour les banques montrent un potentiel de croissance. 📊 Choix des actifs — Le portefeuille inclut des actions telles que SOCIETE GENERALE pour leur potentiel de reprise et des ETF comme STOXX Europe 600 Banks, qui bénéficient de la stabilisation du secteur bancaire. Les obligations telles que Bloomberg Emerging Markets Local Currency Liquid Government Bond (EUR Hedged) sont incluses pour stabiliser le portefeuille.",
        "Actions": {
            "SOCIETE GENERALE": "7%",
            "COMPASS HLDGS-SBI": "6%",
            "RADIUS-A": "6%",
            "ENERGY FOCUS": "5%"
        },
        "Crypto": {
            "EOS": "8%",
            "PAX Gold (PAXG)": "7%"
        },
        "ETF": {
            "STOXX Europe 600 Banks": "8%",
            "Bloomberg Copper (EUR Hedged)": "7%",
            "MSCI Europe Financials 20/35 Capped": "8%"
        },
        "Obligations": {
            "Bloomberg Emerging Markets Local Currency Liquid Government Bond (EUR Hedged)": "8%",
            "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "8%"
        }
    },
    "Stable": {
        "Commentaire": "📰 Actualités — L'économie mondiale montre des signes d'amélioration dans certains secteurs, bien que des défis géopolitiques subsistent. 📈 Marchés — Les marchés européens sont en légère hausse, malgré une performance mitigée des marchés nord-américains. 🏭 Secteurs — Les secteurs de la consommation et de la finance en Europe continuent de bien performer. 📊 Choix des actifs — Le portefeuille inclut des actions comme THALES et DASSAULT AVIATION pour leur stabilité et des ETF comme MSCI Europe Financials 20/35 Capped pour diversifier les risques. Les obligations, telles que Bloomberg US Long Treasury (EUR Hedged), sont utilisées pour garantir une stabilité à long terme.",
        "Actions": {
            "THALES": "7%",
            "DASSAULT AVIATION": "7%",
            "WILLAMETTE VY VI": "6%"
        },
        "Crypto": {
            "PAX Gold (PAXG)": "6%"
        },
        "ETF": {
            "MSCI Europe Financials 20/35 Capped": "7%",
            "EURO STOXX® Quality Dividend 50": "8%"
        },
        "Obligations": {
            "Bloomberg US Long Treasury (EUR Hedged)": "8%",
            "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "8%",
            "Bloomberg US Aggregate Bond (EUR Hedged)": "8%"
        }
    }
}