{
    "Agressif": {
        "Commentaire": "📰 **Actualités** — Le marché des crypto-monnaies montre des mouvements mitigés avec Bitcoin affichant une légère hausse sur 24 heures malgré une performance négative sur 7 jours. Les tensions autour des IPO aux États-Unis et des acquisitions stratégiques influencent le climat d'investissement. 📈 **Marchés** — En Europe, les indices boursiers montrent une performance YTD positive malgré des baisses récentes, notamment en Allemagne et en France. En Amérique latine, les indices affichent de forts gains YTD, notamment au Brésil et au Chili. 🏭 **Secteurs** — Le secteur technologique en Europe affiche une bonne performance, tout comme le secteur automobile américain. La hausse de l'indice VIX souligne une volatilité accrue dans les marchés nord-américains. 📊 **Choix des actifs** — Pour ce portefeuille agressif, nous avons inclus des actifs à forte volatilité et potentiel de rendement. Les crypto-monnaies comme TRON et EOS, qui ont montré des performances positives sur 7 jours, sont bien positionnées pour profiter des tendances haussières. Les ETF sectoriels tels que le Amundi MSCI AC Asia Ex Japan ETF Acc bénéficient d'une reprise économique en Asie. Les actions RHEINMETALL et CLEARDAY ont été sélectionnées pour leur forte performance YTD, soutenue par des actualités positives dans le secteur de la défense.",
        "Actions": {
            "RHEINMETALL": "7%",
            "CLEARDAY": "6%",
            "THALES": "5%",
            "SES": "5%"
        },
        "Crypto": {
            "TRON (TRX)": "5%",
            "EOS (EOS)": "4%",
            "Zcash (ZEC)": "4%"
        },
        "ETF": {
            "Amundi MSCI AC Asia Ex Japan ETF Acc": "9%",
            "Lyxor MSCI Robotics&AI ESG Filtered ETF": "8%",
            "VanEck Crypto&Blckchan Innovtr ETF A USD": "7%"
        },
        "Obligations": {
            "Bloomberg US Long Treasury (EUR Hedged)": "10%",
            "JP Morgan USD Emerging Markets Diversified 3% capped 1-5 (EUR Hedged)": "10%"
        }
    },
    "Modéré": {
        "Commentaire": "📰 **Actualités** — Les nouvelles économiques récentes montrent un intérêt accru pour les actions et les ETF liés aux secteurs en croissance tels que la technologie et l'automobile. 📈 **Marchés** — Les marchés européens montrent une légère baisse quotidienne, mais conservent des gains YTD, reflétant une économie résiliente malgré les défis. 🏭 **Secteurs** — Les secteurs de la santé et de l'énergie en Europe affichent de bons résultats, soutenus par une demande accrue et des innovations continues. 📊 **Choix des actifs** — Ce portefeuille modéré combine stabilité et opportunités de croissance. L'inclusion d'ETF comme le Lyxor Stoxx Europe 600 Tec ETF Acc permet de capturer le potentiel de croissance dans le secteur technologique. Les obligations comme le Bloomberg MSCI US Liquid Investment Grade Corporate SRI PAB (EUR Hedged) ajoutent un niveau de sécurité et de revenu stable.",
        "Actions": {
            "H&E EQUIPMENT SV": "7%",
            "WILLAMETTE VY VI": "6%",
            "DASSAULT AVIATION": "5%"
        },
        "Crypto": {
            "Maker (MKR)": "4%"
        },
        "ETF": {
            "Lyxor Stoxx Europe 600 Tec ETF Acc": "8%",
            "Amundi S&P Glb Comm Svcs ESG ETF DR EURAcc": "6%"
        },
        "Obligations": {
            "Bloomberg MSCI US Liquid Investment Grade Corporate SRI PAB (EUR Hedged)": "10%",
            "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "6%",
            "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "9%"
        }
    },
    "Stable": {
        "Commentaire": "📰 **Actualités** — Les marchés sont influencés par des politiques monétaires prudentes et une inflation maîtrisée, avec un accent sur la stabilité économique. 📈 **Marchés** — Les indices nord-américains montrent une stabilité relative, avec le S&P 500 et le NASDAQ enregistrant de légères variations. 🏭 **Secteurs** — Les secteurs industriels et financiers en Europe montrent une résilience, profitant d'une économie stable et d'une demande constante. 📊 **Choix des actifs** — Ce portefeuille stable se concentre sur des actifs à faible volatilité et des rendements constants. Les ETF comme le Amundi Global Qual Inc ETF Dist assurent une diversification géographique, tandis que les obligations Bloomberg US Aggregate Bond (EUR Hedged) offrent un potentiel de revenu régulier.",
        "Actions": {
            "GADSDENPROP REIT": "5%",
            "LEONARDO": "4%"
        },
        "Crypto": {
            "PAX Gold (PAXG)": "3%"
        },
        "ETF": {
            "Amundi Global Qual Inc ETF Dist": "8%",
            "SPDR S&P 500 Low Volatility ETF": "7%"
        },
        "Obligations": {
            "Bloomberg US Aggregate Bond (EUR Hedged)": "15%",
            "Bloomberg Emerging Markets USD Sovereign & Agency 3% Country Capped (EUR Hedged)": "8%",
            "ICE US Treasury 7-10 Year (EUR Hedged)": "10%"
        }
    }
}