{
    "Agressif": {
        "Commentaire": "📰 Actualités — Les récents développements montrent une pression négative sur les cryptomonnaies avec des chutes significatives du Bitcoin et de l'Ethereum, tandis que certaines technologies sont vues comme prometteuses après la correction du Nasdaq. 📈 Marchés — Les marchés nord-américains sont en baisse, tandis que l'Amérique latine montre des signes positifs, notamment au Brésil et au Chili. 📊 Choix des actifs — Le portefeuille agressif inclut des cryptomonnaies performantes et des actions avec un potentiel de croissance élevé, complété par un ETF pour diversifier le risque.",
        "Actions": {
            "DOMINARI HLDGS": "10%",
            "HALLMARK FINL": "10%",
            "QVC GROUP RG-B": "8%",
            "EXTREME NETWORKS": "8%",
            "THYSSENKRUPP": "8%",
            "RHEINMETALL": "7%",
            "RADIUS-A": "7%"
        },
        "Crypto": {
            "ZetaChain (ZETA)": "7%",
            "Alchemist AI (ALCH)": "7%",
            "Safe (SAFE)": "7%",
            "Four (FORM)": "7%",
            "CARV (CARV)": "7%",
            "Fartcoin (FARTCOIN)": "7%"
        },
        "ETF": {
            "EURO STOXX® Banks 30-15": "7%"
        },
        "Obligations": {}
    },
    "Modéré": {
        "Commentaire": "📰 Actualités — Les nouvelles de la région américaine indiquent une ambiance mitigée avec des corrections boursières et des troubles géopolitiques. 📈 Marchés — Les indices européens et nord-américains montrent des performances mixtes, avec une tendance légèrement négative. 📊 Choix des actifs — Le portefeuille modéré privilégie un équilibre entre actions solides et ETF, avec une inclusion d'obligations pour stabiliser le risque.",
        "Actions": {
            "H&E EQUIPMENT SV": "10%",
            "RHEINMETALL": "10%",
            "EXTREME NETWORKS": "10%",
            "THYSSENKRUPP": "10%",
            "QVC GROUP RG-B": "10%"
        },
        "Crypto": {},
        "ETF": {
            "DAXglobal® Gold Miners": "10%",
            "MSCI Poland": "10%"
        },
        "Obligations": {
            "iShares Euro Government Bond 3-5yr UCITS ETF": "20%",
            "Lyxor Euro Government Bond UCITS ETF": "10%"
        }
    },
    "Stable": {
        "Commentaire": "📰 Actualités — La stabilité est recherchée dans un contexte d'incertitude économique mondiale. 📈 Marchés — Les marchés européens et nord-américains sont en légère baisse, tandis que certains indices latino-américains montrent de la résilience. 📊 Choix des actifs — Le portefeuille stable se concentre sur les obligations et les ETF pour assurer une faible volatilité, complété par des actions de grande capitalisation pour une croissance modérée.",
        "Actions": {
            "RHEINMETALL": "8%",
            "THYSSENKRUPP": "8%",
            "EXTREME NETWORKS": "8%",
            "RADIUS-A": "8%"
        },
        "Crypto": {},
        "ETF": {
            "STOXX® Europe 600 Optimised Banks": "8%",
            "Solactive Global Pure Gold Miners": "8%"
        },
        "Obligations": {
            "iShares Euro Government Bond 3-5yr UCITS ETF": "20%",
            "Xtrackers II Eurozone Government Bond UCITS ETF": "20%",
            "Lyxor Euro Government Bond UCITS ETF": "20%"
        }
    }
}