{
    "tmi": {
        "definition": "Le Taux Marginal d'Imposition (TMI) est le taux d'impôt appliqué à la dernière tranche de vos revenus imposables selon le barème progressif de l'impôt sur le revenu.",
        "example": "Un célibataire avec un revenu net imposable de 32 000 € a un TMI de 30 %, car la tranche 29 316 € – 83 823 € est imposée à ce taux. Un euro supplémentaire sera donc taxé à 30 %.",
        "related_terms": [
            "barème progressif",
            "tranches d'imposition",
            "taux moyen d'imposition",
            "revenu imposable",
            "IR"
        ]
    },
    "appetence_au_risque": {
        "definition": "L'appétence au risque désigne la capacité d'un entrepreneur à accepter l'incertitude financière, stratégique ou personnelle pour créer et développer son entreprise.",
        "example": "Un entrepreneur avec une forte appétence au risque contracte un prêt de 200 000 € pour lancer une startup tech innovante sans garantie de rentabilité à court terme.",
        "related_terms": [
            "prise de risque",
            "création d'entreprise",
            "plan de financement",
            "structure juridique",
            "levée de fonds",
            "caution personnelle"
        ]
    },
    "autres_revenus_salariés": {
        "definition": "Dans le cadre de la création d'entreprise, les 'autres revenus salariés' désignent les revenus d'une activité salariée exercée en parallèle d'une activité entrepreneuriale, permettant de sécuriser le lancement du projet.",
        "example": "Un graphiste salarié lance son activité en freelance en auto-entrepreneur tout en conservant un emploi à mi-temps pour assurer un revenu stable.",
        "related_terms": [
            "auto-entrepreneur",
            "activité mixte",
            "sécurité sociale",
            "prélèvement libératoire",
            "cumul d'activités",
            "clause d'exclusivité"
        ]
    },
    "tns": {
        "definition": "Statut des entrepreneurs individuels, micro-entrepreneurs ou gérants majoritaires, affiliés à la SSI avec moins de charges sociales mais une protection limitée.",
        "example": "Julie lance sa micro-entreprise de bijoux : elle paie 12,8 % de cotisations sur ses ventes et ne paie rien si elle ne vend pas.",
        "related_terms": [
            "indépendant",
            "micro-entreprise",
            "gérant majoritaire",
            "SSI",
            "cotisations sociales"
        ]
    },
    "assimile_salarie": {
        "definition": "Statut du dirigeant de SAS/SASU ou gérant minoritaire de SARL, affilié au régime général avec une bonne protection sociale mais un coût plus élevé.",
        "example": "Marc crée une SASU pour son activité de conseil : il se verse 2 000 € nets par mois, ce qui coûte 3 300 € à la société.",
        "related_terms": [
            "président",
            "mandat social",
            "SAS",
            "URSSAF",
            "protection sociale"
        ]
    },
    "mixte": {
        "definition": "Statut hybride combinant un mandat social et un contrat de travail, rarement avantageux sauf cas très précis, avec deux régimes sociaux distincts à gérer.",
        "example": "Sophie est présidente de sa SAS et développeuse salariée : elle paie des charges des deux côtés, sans économies.",
        "related_terms": [
            "cumul de fonctions",
            "mandat social",
            "contrat de travail",
            "régime mixte"
        ]
    },
    "bic-Vente": {
        "definition": "Activité d'achat-revente de biens ou marchandises, imposée dans la catégorie des BIC (Bénéfices Industriels et Commerciaux).",
        "example": "Un entrepreneur ouvre une boutique de vêtements ou vend des produits sur un site e-commerce.",
        "related_terms": [
            "commerce",
            "achat-revente",
            "boutique",
            "e-commerce",
            "BIC",
            "RCS"
        ]
    },
    "bic-Service": {
        "definition": "Activité de prestation de services à caractère commercial ou artisanal, imposée comme BIC.",
        "example": "Un coiffeur, un chauffeur VTC ou une entreprise de ménage relève du BIC service.",
        "related_terms": [
            "service",
            "artisan",
            "BIC",
            "nettoyage",
            "plombier",
            "coiffeur"
        ]
    },
    "bnc": {
        "definition": "Activité libérale ou intellectuelle imposée dans la catégorie des BNC (Bénéfices Non Commerciaux).",
        "example": "Un consultant, un formateur ou un avocat exerçant en indépendant relève du régime BNC.",
        "related_terms": [
            "profession libérale",
            "consultant",
            "expert",
            "honoraires",
            "déontologie"
        ]
    },
    "artisanat": {
        "definition": "Activité manuelle de fabrication, transformation ou réparation exercée seul ou en petite structure, imposée en BIC.",
        "example": "Un boulanger ou un couturier immatriculé au registre national des entreprises avec un CAP.",
        "related_terms": [
            "artisan",
            "qualification",
            "BIC",
            "registre RNE",
            "activité manuelle"
        ]
    },
    "agricole": {
        "definition": "Activité d'exploitation d'un cycle biologique (animal ou végétal), avec production, transformation ou vente de produits agricoles.",
        "example": "Un viticulteur ou éleveur vendant ses produits en circuit court relève des bénéfices agricoles (BA).",
        "related_terms": [
            "agriculture",
            "BA",
            "PAC",
            "élevage",
            "viticulture",
            "exploitation"
        ]
    },
    "activite_reglementee": {
        "definition": "Une activité réglementée est soumise à des conditions légales strictes (diplômes, autorisations, agréments) pour pouvoir être exercée légalement.",
        "example": "Un coiffeur doit justifier d'un CAP coiffure pour pouvoir ouvrir son salon ; un agent immobilier doit obtenir une carte professionnelle.",
        "related_terms": [
            "diplôme",
            "carte professionnelle",
            "autorisation",
            "agrément",
            "conditions d'accès",
            "registre"
        ]
    },
    "ordre_professionnel": {
        "definition": "Un ordre professionnel est un organisme obligatoire qui encadre certaines professions réglementées, contrôle l'accès à la profession et veille au respect de la déontologie.",
        "example": "Un avocat doit être inscrit à l'Ordre des avocats pour pouvoir exercer ; l'ordre vérifie ses diplômes, encadre sa pratique et peut le sanctionner en cas de faute.",
        "related_terms": [
            "profession libérale",
            "déontologie",
            "inscription obligatoire",
            "sanction disciplinaire",
            "réglementation"
        ]
    },
    "amf": {
        "definition": "L'agrément AMF est obligatoire pour les sociétés qui exercent dans la gestion de fonds ou le conseil en investissement, afin de garantir leur compétence et solidité.",
        "example": "Une société de gestion doit obtenir l'agrément AMF avant de proposer ses produits financiers aux clients.",
        "related_terms": [
            "finance",
            "investissement",
            "fonds",
            "conformité",
            "régulation"
        ]
    },
    "arcep": {
        "definition": "L'agrément ARCEP est requis pour les opérateurs télécoms ou ceux exploitant un réseau de communication, garantissant le respect des normes techniques.",
        "example": "Un nouvel opérateur téléphonique doit obtenir l'autorisation de l'ARCEP avant de proposer ses offres sur le marché.",
        "related_terms": [
            "télécom",
            "réseau",
            "normes",
            "autorisation",
            "régulation"
        ]
    },
    "iobsp": {
        "definition": "L'agrément IOBSP est nécessaire pour exercer une activité d'intermédiaire bancaire, comme le courtage en crédit ou en services de paiement.",
        "example": "Un courtier en crédit immobilier doit obtenir l'agrément IOBSP pour pouvoir présenter des offres de prêt à ses clients.",
        "related_terms": [
            "crédit",
            "banque",
            "intermédiaire",
            "assurance",
            "IOB"
        ]
    },
    "kyc": {
        "definition": "Le KYC est une procédure de vérification de l'identité du client imposée aux établissements financiers pour lutter contre le blanchiment d'argent.",
        "example": "Une fintech doit collecter une pièce d'identité et un justificatif de domicile avant d'ouvrir un compte client.",
        "related_terms": [
            "compliance",
            "lutte anti-blanchiment",
            "AML",
            "client",
            "identité"
        ]
    },
    "risques_professionnels_eleves": {
        "definition": "Les risques professionnels élevés désignent les dommages (physiques, matériels, financiers) que l'entreprise peut causer à des tiers et qui engagent sa responsabilité civile.",
        "example": "Un client se blesse en chutant dans une boutique : l'entreprise peut être tenue de l'indemniser. Une RC Pro permet de couvrir ce type de situation.",
        "related_terms": [
            "responsabilité civile",
            "RC Pro",
            "dommage",
            "tiers",
            "assurance",
            "patrimoine personnel"
        ]
    },
    "franchise_en_base_de_tva": {
        "definition": "Régime de TVA qui permet aux petites entreprises de ne pas facturer ni déclarer la TVA, sous certaines limites de chiffre d'affaires.",
        "example": "Julie débute son activité de graphiste freelance. En franchise en base, elle ne facture pas la TVA à ses clients et n'a pas à la reverser à l'État.",
        "related_terms": [
            "TVA non applicable",
            "article 293 B",
            "petite entreprise",
            "seuil TVA",
            "simplification"
        ]
    },
    "activite_exoneree": {
        "definition": "Certaines activités comme la santé ou l'enseignement sont exonérées de TVA par la loi, quels que soient les revenus.",
        "example": "Un médecin libéral ne facture pas de TVA à ses patients et ne peut pas la récupérer sur ses achats professionnels.",
        "related_terms": [
            "TVA exonérée",
            "activité réglementée",
            "enseignement",
            "médical",
            "non assujetti"
        ]
    },
    "reel_simplifie": {
        "definition": "Régime qui permet de déclarer la TVA une ou deux fois par an avec des acomptes trimestriels, adapté aux entreprises avec un chiffre d'affaires modéré.",
        "example": "Une TPE de vente de produits réalise 300 000 € de chiffre d'affaires par an : elle choisit le régime réel simplifié pour alléger ses déclarations.",
        "related_terms": [
            "TVA",
            "acompte",
            "déclaration annuelle",
            "simplifié",
            "comptabilité"
        ]
    },
    "cnil": {
        "definition": "Autorité française chargée de veiller à la protection des données personnelles et au respect du RGPD dans les entreprises.",
        "example": "Une entreprise qui collecte des données clients doit s'assurer qu'elle respecte les règles fixées par la CNIL, sous peine de sanction.",
        "related_terms": [
            "données personnelles",
            "vie privée",
            "autorité administrative",
            "contrôle",
            "sanction"
        ]
    },
    "rgpd": {
        "definition": "Règlement européen qui encadre la collecte, l'utilisation et la protection des données personnelles dans toutes les entreprises.",
        "example": "Une boutique en ligne doit informer ses clients de l'usage de leurs données et leur permettre d'en demander la suppression, conformément au RGPD.",
        "related_terms": [
            "données personnelles",
            "consentement",
            "dpo",
            "registre de traitement",
            "obligations légales"
        ]
    },
    "cnil_rgpd": {
        "definition": "Ensemble des obligations légales relatives à la protection des données personnelles, encadrées par la CNIL (autorité française) et le RGPD (règlement européen).",
        "example": "Un site e-commerce doit assurer la conformité CNIL/RGPD en disposant d'une politique de confidentialité claire et en sécurisant les données des utilisateurs.",
        "related_terms": [
            "données personnelles",
            "conformité",
            "protection",
            "sécurité",
            "audit"
        ]
    },
    "taux_de_marge_brute": {
        "definition": "Indicateur de rentabilité qui mesure la différence entre le prix de vente HT et le coût d'achat ou de production d'un bien ou service, exprimée en pourcentage.",
        "example": "Si un produit est vendu 120 € HT et coûte 80 € à produire, la marge brute est de 40 €, soit un taux de marge brute de 33,33 %. Cela signifie que l'entreprise garde 33 % de marge avant frais fixes.",
        "related_terms": [
            "rentabilité",
            "coût de revient",
            "prix de vente",
            "business plan",
            "marge commerciale"
        ]
    },
    "salaire": {
        "definition": "Rémunération versée régulièrement à un dirigeant en échange de son travail, ouvrant droit à la protection sociale (maladie, retraite, prévoyance).",
        "example": "Sophie, dirigeante de SAS, se verse un salaire mensuel de 2 000 € pour bénéficier de la sécurité sociale et constituer des droits à la retraite.",
        "related_terms": [
            "protection sociale",
            "fiche de paie",
            "cotisations",
            "sécurité sociale",
            "retraite"
        ]
    },
    "dividendes": {
        "definition": "Somme versée à un associé à partir des bénéfices réalisés par l'entreprise, sans ouvrir de droits à la protection sociale.",
        "example": "Marc, associé unique d'une SASU, touche un dividende en fin d'année après approbation des comptes, soumis à 30 % de prélèvements fiscaux.",
        "related_terms": [
            "bénéfices",
            "assemblée générale",
            "flat tax",
            "prélèvements sociaux",
            "capital"
        ]
    },
    "capital_social": {
        "definition": "Le capital social est la somme des apports effectués par les associés ou actionnaires lors de la création d'une société. Il constitue une base financière pour l'entreprise et figure dans les statuts. Il ne concerne que les sociétés (SARL, SAS, SA, etc.) et non les entreprises individuelles.",
        "example": "Une SARL est créée avec un capital de 10 000 €, composé d'un apport en numéraire de 8 000 € et d'un ordinateur évalué à 2 000 € en nature. Les deux associés détiennent des parts sociales en proportion de leur apport.",
        "related_terms": [
            "apport en numéraire",
            "apport en nature",
            "apport en industrie",
            "statuts",
            "Kbis",
            "créanciers",
            "parts sociales"
        ],
        "details": "Il existe trois types d'apports : en numéraire (argent versé sur un compte bloqué), en nature (matériel, brevets, etc.) et en industrie (savoir-faire, qui ne compose pas le capital). Le capital social sert à financer les débuts de l'entreprise, répartir les droits de vote, rassurer les partenaires et crédibiliser le projet. Le montant est libre pour les SARL et SAS (dès 1 €), mais doit atteindre au moins 37 000 € pour une SA. Une partie peut être versée à la création (ex. : 20 %), le reste dans les 5 ans. Une fois la société immatriculée, le capital est débloqué et utilisable pour les besoins professionnels. Il ne peut pas être transféré vers un compte personnel. Enfin, un capital trop faible peut limiter l'accès au crédit ou réduire la confiance des tiers."
    },
    "pourcentage_libere": {
        "definition": "La libération du capital social correspond au versement effectif des sommes promises par les associés ou actionnaires lors de la constitution d'une société. Elle peut être partielle à la création, avec un complément versé dans un délai légal.",
        "example": "Un associé crée une SAS avec un capital social de 10 000 €. Il verse 5 000 € à la création (50 %), et s'engage à verser les 5 000 € restants dans un délai de 5 ans.",
        "related_terms": [
            "capital souscrit",
            "capital libéré",
            "apport en numéraire",
            "apport en nature",
            "SARL",
            "SAS",
            "EURL",
            "dépôt de capital"
        ],
        "details": "Le pourcentage à libérer dépend de la forme juridique : 20 % minimum pour une SARL ou EURL, 50 % pour une SAS, SASU ou SA. Le reste des apports en numéraire doit être libéré dans un délai de 5 ans maximum. En revanche, les apports en nature doivent être libérés en totalité dès la création. La libération partielle permet de soulager la trésorerie des associés au démarrage, mais retarde la mise à disposition complète des fonds pour la société. Un capital totalement libéré peut offrir des avantages fiscaux (IS à taux réduit), rassurer les partenaires et renforcer la crédibilité de l'entreprise. Il est essentiel de distinguer capital souscrit (promesse) et capital libéré (effectivement versé), notamment lors de la rédaction des statuts et du dépôt de capital auprès de la banque."
    },
    "apports_en_nature": {
        "definition": "Un apport en nature correspond à la mise à disposition par un associé d'un bien autre que de l'argent lors de la création ou de l'augmentation de capital d'une société. Il peut s'agir d'un bien matériel, immobilier ou immatériel. En contrepartie, l'associé reçoit des parts sociales ou actions proportionnelles à la valeur de son apport.",
        "example": "Paul apporte un local commercial qu'il possède à une SAS en échange de 40 % des actions, selon une évaluation faite par un commissaire aux apports.",
        "related_terms": [
            "apport en numéraire",
            "apport en industrie",
            "capital social",
            "commissaire aux apports",
            "statuts"
        ],
        "details": "Les apports en nature peuvent inclure des ordinateurs, véhicules, immeubles, logiciels, marques, brevets ou encore fonds de commerce. Ces biens doivent être précisément identifiés et évalués. Lorsque la valeur dépasse certains seuils ou en présence de plusieurs apports, un commissaire aux apports peut être obligatoire pour en garantir la valeur. Contrairement aux apports en numéraire, les apports en nature doivent être totalement libérés dès la signature des statuts. La société peut recevoir selon les cas la pleine propriété, la jouissance ou l'usufruit du bien. Tous les détails (valeur, nature, contrepartie en parts) doivent figurer dans les statuts. L'apport en nature permet aux associés de contribuer à la société sans mobiliser de trésorerie, tout en mettant à disposition des ressources stratégiques dès le lancement."
    },
    "apports_en_compte_courant": {
        "definition": "L'apport en compte courant d'associé est une avance de fonds, comparable à un prêt, qu'un associé ou un dirigeant fait à sa société pour lui permettre de disposer de trésorerie supplémentaire sans modifier son capital social.",
        "example": "Julie, associée dans une SARL, verse 20 000 € à l'entreprise via un apport en compte courant pour couvrir un besoin de trésorerie urgent. Cette somme ne modifie pas son pourcentage de capital et lui sera remboursée dès que possible.",
        "related_terms": [
            "capital social",
            "apport en numéraire",
            "apport en nature",
            "prêt d'associé",
            "convention de compte courant"
        ],
        "details": "Contrairement à un apport au capital, l'apport en compte courant n'ouvre aucun droit supplémentaire (ni actions, ni parts sociales) et ne modifie pas la répartition du capital. Il est enregistré au passif du bilan comptable sous forme de dette de la société envers l'associé. Ce type d'apport est souvent utilisé pour financer un besoin ponctuel (investissement, démarrage, imprévu) sans passer par une augmentation de capital, ce qui en fait un outil souple et rapide. Il peut être rémunéré par des intérêts si une convention le prévoit, ou laissé gratuitement à disposition. L'associé peut demander son remboursement à tout moment, sauf si une clause ou une convention de blocage temporaire a été signée. C'est une solution temporaire pour renforcer la trésorerie d'une société, souvent utilisée dans les jeunes entreprises ou en cas de besoin de financement immédiat."
    },
    "apport_progressif": {
        "definition": "Un apport progressif désigne un apport réalisé en plusieurs fois, sur une période donnée. Il concerne principalement la libération échelonnée du capital social pour les apports en numéraire, ou les apports en industrie (compétences, savoir-faire) qui se concrétisent dans le temps.",
        "example": "Lors de la création d'une SARL avec un capital de 10 000 €, les associés ne versent que 2 000 € à la création. Le solde de 8 000 € est apporté progressivement dans les années suivantes. Un autre associé apporte son expertise en informatique de manière continue : c'est un apport en industrie, donc progressif par nature.",
        "related_terms": [
            "capital social",
            "apport en numéraire",
            "apport en industrie",
            "libération de capital",
            "transmission d'entreprise"
        ],
        "details": "Dans les sociétés comme les SARL ou SAS, la loi autorise à ne libérer qu'une partie du capital à la création (20 % pour les SARL, 50 % pour les SAS), le reste pouvant être apporté dans un délai maximal de 5 ans. Cela permet aux associés de ne pas mobiliser toute la trésorerie immédiatement. L'apport en industrie est un autre cas typique d'apport progressif : il correspond à la mise à disposition d'un savoir-faire ou d'un travail dans la durée. Ce type d'apport ne figure pas dans le capital social mais donne lieu à l'attribution de parts sociales spécifiques. Il existe aussi des cas plus rares d'apports progressifs dans le cadre de transmissions d'entreprises, notamment lors d'un apport partiel d'actif ou d'un pacte Dutreil aménagé. Dans tous les cas, l'aspect progressif repose sur un engagement contractuel précis et documenté entre l'associé et la société."
    },
    "cession_partielle": {
        "definition": "La cession partielle dans le cadre d'un LBO (Leverage Buy-Out) consiste à vendre une partie du capital d'une entreprise à un investisseur, via une holding qui s'endette pour financer l'acquisition. Le dirigeant reste souvent actionnaire et opérationnel.",
        "example": "Un dirigeant cède 60 % de ses parts à une holding de LBO et conserve 40 %, participant ainsi à la croissance future de l'entreprise tout en sécurisant une partie de son patrimoine.",
        "related_terms": [
            "LBO",
            "cession",
            "holding",
            "effet de levier",
            "investisseur financier",
            "sortie en deux temps"
        ]
    },
    "acre": {
        "definition": "L'ACRE est une exonération partielle ou totale de certaines cotisations sociales pendant la première année d'activité, visant à faciliter la création ou la reprise d'entreprise en France.",
        "example": "Un créateur d'entreprise bénéficie de l'ACRE et voit ses cotisations sociales réduites de 80% pendant sa première année d'activité.",
        "related_terms": [
            "création d'entreprise",
            "cotisations sociales",
            "exonération",
            "URSSAF"
        ],
        "titre": "ACRE : Aide à la Création ou à la Reprise d'Entreprise",
        "objectif": [
            "Réduire les charges sociales au démarrage",
            "Améliorer la trésorerie du créateur ou repreneur",
            "Favoriser l'installation durable de nouvelles entreprises"
        ],
        "nature_de_l_aide": [
            "Exonération partielle de cotisations sociales : maladie, maternité, invalidité, décès, allocations familiales, retraite de base",
            "Exclusion de certaines cotisations : CSG-CRDS, retraite complémentaire, formation professionnelle"
        ],
        "modalites": [
            "Pour les sociétés classiques : attribution automatique si les conditions sont remplies",
            "Pour les micro-entrepreneurs : demande obligatoire à la création, via l'Urssaf"
        ],
        "eligibilite_generale": [
            "Créer ou reprendre une entreprise en France",
            "Exercer le contrôle effectif de l'entreprise",
            "Ne pas avoir bénéficié de l'ACRE au cours des 3 dernières années"
        ],
        "controle_effectif_société": [
            "Détenir plus de 50 % du capital seul ou avec proches (dont 35 % à titre personnel)",
            "Ou être dirigeant avec plus de 33 % du capital (dont 25 % personnel), aucun autre associé ne doit détenir plus de 50 %"
        ],
        "plafond_de_revenus": [
            "Exonération totale si revenu < 75 % du PASS",
            "Exonération dégressive entre 75 % et 100 % du PASS",
            "Pas d'exonération si revenu > 100 % du PASS"
        ],
        "cas_micro_entrepreneurs": [
            "Demandeur d'emploi indemnisé ou non (6 mois sur 18)",
            "Âgé de 18 à 26 ans (ou jusqu'à 30 ans avec handicap)",
            "Bénéficiaire du RSA, ASS ou PreParE",
            "Résident en QPV",
            "Signataire d'un CAPE",
            "Ne pas avoir eu l'ACRE dans les 3 dernières années"
        ],
        "utilite": [
            "Réduction significative des charges sociales au démarrage",
            "Souplesse pour les micro-entrepreneurs en situation précaire",
            "Facilite l'investissement des premiers mois d'activité"
        ],
        "points_cles": [
            "L'exonération est temporaire (1 an en général)",
            "Certaines cotisations restent dues (retraite complémentaire, CSG-CRDS)",
            "Le dispositif ne peut être accordé qu'une fois tous les trois ans",
            "Le non-respect du contrôle effectif entraîne la perte du bénéfice"
        ],
        "resume": "L'ACRE permet au créateur ou repreneur d'entreprise de réduire ses charges sociales durant la première année, sous conditions de contrôle effectif et de plafond de revenus. Pour les micro-entrepreneurs, la demande est à effectuer à la création, avec des critères sociaux spécifiques.",
        "source": "https://www.service-public.fr/particuliers/vosdroits/F11677"
    },
    "jeune_entreprise_innovante": {
        "definition": "Statut fiscal et social pour les entreprises de moins de 8 ans investissant au moins 20 % de leurs charges en R&D.",
        "example": "Une startup technologique bénéficie du statut JEI et obtient une réduction de 50 % des charges patronales sur ses ingénieurs R&D.",
        "related_terms": [
            "innovation",
            "recherche et développement",
            "exonération fiscale",
            "startup"
        ],
        "conditions": {
            "age_max": "8 ans",
            "taille": "Moins de 250 salariés, CA < 50 M€, bilan < 43 M€",
            "capital": "Détenu à 50 % par personnes physiques ou structures qualifiées",
            "r_d": "Au moins 20 % des charges déductibles",
            "autres": "Être indépendante, non cotée, soumise à l'IS, basée dans l'EEE"
        },
        "source": "https://entreprendre.service-public.fr/vosdroits/F31188"
    },
    "jei": {
        "definition": "Statut fiscal et social pour les entreprises de moins de 8 ans investissant au moins 20% de leurs charges en R&D.",
        "example": "Une startup technologique bénéficie du statut JEI et obtient une réduction de 50% des charges patronales sur ses ingénieurs R&D.",
        "related_terms": [
            "innovation",
            "recherche et développement",
            "exonération fiscale",
            "startup",
            "jeune entreprise innovante"
        ]
    },
    "credit_impot_recherche": {
        "definition": "Dispositif fiscal permettant aux entreprises de bénéficier d'un crédit d'impôt proportionnel à leurs dépenses de R&D.",
        "example": "Une entreprise dépense 100 000€ en R&D et obtient un crédit d'impôt de 30 000€ qu'elle déduit de ses impôts.",
        "related_terms": [
            "recherche et développement",
            "innovation",
            "fiscalité",
            "impôt sur les sociétés"
        ],
        "conditions": {
            "entreprise": "Industrielle, commerciale ou agricole, régime réel IS ou IR",
            "taille": "Moins de 250 salariés, CA < 50 M€, bilan < 43 M€",
            "r_d": "Projet visant à lever une incertitude technique, technicité supérieure au savoir-faire commun"
        },
        "depenses_eligibles": [
            "Salaires du personnel de R&D",
            "Amortissements",
            "Frais de brevets",
            "Sous-traitance R&D"
        ],
        "source": "https://entreprendre.service-public.fr/vosdroits/F23533"
    },
    "cir": {
        "definition": "Le Crédit d'Impôt Recherche (CIR) est un dispositif fiscal permettant aux entreprises de bénéficier d'un crédit d'impôt proportionnel à leurs dépenses de R&D.",
        "example": "Une entreprise dépense 100 000€ en R&D et obtient un crédit d'impôt de 30 000€ qu'elle déduit de ses impôts.",
        "related_terms": [
            "recherche et développement",
            "innovation",
            "fiscalité",
            "impôt sur les sociétés",
            "credit_impot_recherche"
        ]
    },
    "credit_impot_innovation": {
        "definition": "Crédit d'impôt complémentaire au CIR pour les PME innovantes développant ou améliorant des produits.",
        "example": "Une PME qui améliore significativement l'un de ses produits peut bénéficier d'un crédit d'impôt de 30% sur ses dépenses d'innovation.",
        "related_terms": [
            "CIR",
            "PME",
            "innovation produit",
            "crédit d'impôt"
        ],
        "conditions": {
            "entreprise": "PME, régime réel",
            "taille": "Moins de 250 salariés, CA < 50 M€, bilan < 43 M€",
            "projet": "Développement ou amélioration significative de produits originaux ou inventifs"
        },
        "depenses_eligibles": [
            "Salaires liés à l'innovation",
            "Sous-traitance",
            "Propriété industrielle"
        ],
        "taux": "30 % des dépenses éligibles engagées à partir de 2023",
        "source": "https://entreprendre.service-public.fr/vosdroits/F35494"
    },
    "cii": {
        "definition": "Le Crédit d'Impôt Innovation (CII) est un dispositif fiscal complémentaire au CIR pour les PME innovantes développant ou améliorant des produits.",
        "example": "Une PME qui améliore significativement l'un de ses produits peut bénéficier d'un crédit d'impôt de 30% sur ses dépenses d'innovation.",
        "related_terms": [
            "CIR",
            "PME",
            "innovation produit",
            "crédit d'impôt",
            "credit_impot_innovation"
        ]
    },
    "revente_entreprise_holding": {
        "definition": "La revente d'une entreprise détenue à 100 % par une holding correspond à une opération dans laquelle la société holding cède les titres de sa filiale. Les fonds issus de cette vente remontent dans la holding, sans passage direct par la personne physique associée.",
        "example": "Vous êtes associé unique d'une holding qui détient une société opérationnelle. La holding revend cette société à un tiers pour 5 millions d'euros. Ces 5 millions sont perçus directement par la holding, sans fiscalité immédiate pour vous.",
        "related_terms": [
            "holding",
            "cession",
            "fiscalité",
            "plus-value",
            "investissement"
        ],
        "etapes": [
            "La holding vend les titres de la société qu'elle détient",
            "La plus-value est calculée et bénéficie d'un régime fiscal réduit si les titres sont détenus depuis plus de deux ans",
            "Les fonds sont conservés dans la holding",
            "Possibilité de réinvestir pour bénéficier du régime de report d'imposition (apport-cession)",
            "Utilisation possible pour investir, rembourser des dettes, ou verser des dividendes"
        ],
        "avantages": [
            "Fiscalité optimisée : seulement 12 % de la plus-value soumise à l'impôt sur les sociétés",
            "Capacité de réinvestissement importante dans d'autres projets",
            "Souplesse dans la gestion du patrimoine professionnel",
            "Possibilité de différer la fiscalité personnelle via le mécanisme d'apport-cession",
            "Protection du patrimoine personnel grâce à la structure juridique de la holding"
        ],
        "conditions_fiscales": {
            "duree_detention": "Titres détenus depuis plus de deux ans pour bénéficier de la quote-part de 12 %",
            "report_imposition": "Réinvestissement d'au moins 60 % du produit de la cession dans les deux ans dans des actifs éligibles",
            "dividendes": "Distribution possible mais fiscalisée au niveau personnel"
        },
        "utilisation_fonds": [
            "Investissement dans d'autres sociétés ou projets",
            "Développement d'activités connexes ou immobilières",
            "Remboursement des dettes éventuelles de la holding",
            "Versement de dividendes (soumis à fiscalité pour les associés)"
        ],
        "impact": "La revente via la holding permet de maîtriser le calendrier fiscal, de sécuriser les gains, et de structurer un patrimoine professionnel de manière flexible. Elle offre également des perspectives de développement pour d'autres activités sans imposition immédiate au niveau personnel."
    },
    "cout_social": {
        "definition": "Le coût social correspond aux charges sociales versées aux organismes sociaux pour couvrir la protection sociale des dirigeants et salariés.",
        "example": "Un dirigeant de SASU verse 45 % de charges sociales sur son salaire pour bénéficier de la couverture maladie, retraite et prévoyance.",
        "related_terms": [
            "charges sociales",
            "URSSAF",
            "cotisations",
            "protection sociale",
            "paie"
        ],
        "application": {
            "entrepreneur_individuel": "Cotisations sociales calculées sur le revenu professionnel.",
            "societe": "Charges patronales sur les salaires + charges salariales déduites du brut."
        }
    },
    "fiscalite": {
        "definition": "La fiscalité désigne l'ensemble des impôts et taxes supportés par l'entreprise selon sa forme juridique et son régime fiscal.",
        "example": "Une SARL paie l'impôt sur les sociétés sur ses bénéfices, collecte et reverse la TVA, et s'acquitte de la taxe sur les véhicules de société.",
        "related_terms": [
            "impôt",
            "taxe",
            "IS",
            "IR",
            "TVA",
            "CFE",
            "droits d'enregistrement"
        ],
        "types_d_impots": {
            "IS": "Impôt sur les sociétés à 25 %, avec taux réduit à 15 % jusqu'à 42 500 € pour certaines PME",
            "IR": "Impôt sur le revenu payé directement par l'entrepreneur ou les associés",
            "TVA": "Collecte et reversement de la TVA, possibilité de déduction",
            "CFE": "Taxe locale basée sur la valeur locative des locaux professionnels",
            "autres": "Taxe sur les véhicules de société, droits d'enregistrement, etc."
        }
    },
    "cout_comptable": {
        "definition": "Le coût comptable regroupe toutes les dépenses liées à la gestion administrative et comptable de l'entreprise.",
        "example": "Une SARL paie 200€ par mois à son expert-comptable pour la tenue de sa comptabilité et ses déclarations fiscales.",
        "related_terms": [
            "expert-comptable",
            "frais de constitution",
            "annonces légales",
            "logiciel comptable",
            "tenue comptable"
        ],
        "composants": {
            "expert_comptable": "Honoraires variables selon la complexité, entre 150€ et 500€ pour la création",
            "formalites": "Frais d'immatriculation, annonces légales, rédaction des statuts (24–226 €)",
            "logiciels": "Coût d'un logiciel de comptabilité si gestion interne",
            "annexes": "Dépôt de nom de domaine, domiciliation, dépôt de marque, etc."
        }
    },
    "micro_vs_reel": {
        "definition": "Le régime micro (micro‑BIC ou micro‑BNC) et le régime réel sont deux modes d'imposition distincts pour les entrepreneurs individuels. Le choix de l'un ou l'autre a un impact direct sur la manière de déclarer les revenus et de calculer les charges fiscales.",
        "example": "Un consultant au régime micro‑BNC déduit automatiquement 34 % de son chiffre d'affaires comme charges, alors qu'au réel il déduirait ses frais réels qui peuvent représenter 45 % de son CA.",
        "related_terms": [
            "micro-entreprise",
            "régime réel",
            "abattement forfaitaire",
            "frais réels",
            "comptabilité"
        ]
    },
    "regime_micro": {
        "description": "Régime simplifié d'imposition destiné aux petites entreprises avec un chiffre d'affaires limité.",
        "seuils_CA_2024": {
            "micro_BIC_vente": "188 700 €",
            "micro_BIC_services": "77 700 €",
            "micro_BNC": "77 700 €"
        },
        "abattement_forfaitaire": {
            "vente": "71 %",
            "services_BIC": "50 %",
            "BNC": "34 %",
            "minimum": "305 € d'abattement minimal"
        }
    },
    "regime_reel": {
        "description": "Régime d'imposition où l'entrepreneur déclare ses revenus réels et peut déduire toutes les charges professionnelles effectivement supportées.",
        "types": [
            "Réel simplifié",
            "Réel normal"
        ],
        "fonctionnement": [
            "Déclaration complète des recettes et dépenses",
            "Déduction des charges réelles engagées",
            "Comptabilité d'engagement (bilan, compte de résultat, annexes)",
            "Récupération possible de la TVA"
        ]
    },
    "frais_reels": {
        "definition": "Dépenses professionnelles réellement engagées et justifiées, déductibles uniquement dans le cadre du régime réel.",
        "exemples": [
            "Frais de déplacement",
            "Frais de repas",
            "Location de bureau",
            "Logiciels et assurances pro"
        ]
    },
    "abattement_forfaitaire": {
        "definition": "Réduction automatique appliquée sur le chiffre d'affaires en régime micro, représentant les charges professionnelles moyennes.",
        "non_personnalise": true,
        "application": "Appliqué directement par l'administration fiscale sans justificatifs."
    },
    "high_professional_risk": {
        "definition": "Les risques professionnels élevés désignent les dommages potentiels (physiques, matériels, financiers) que l'entreprise peut causer à des tiers dans l'exercice de son activité et qui engagent sa responsabilité civile professionnelle.",
        "example": "Un ingénieur consultant dont les conseils techniques erronés entraînent des défauts de construction majeurs, ou un restaurateur dont la négligence provoque une intoxication alimentaire collective.",
        "related_terms": [
            "responsabilité civile professionnelle",
            "RC Pro",
            "dommages",
            "assurance",
            "protection du patrimoine"
        ],
        "mitigation": "La souscription d'une assurance RC Pro adaptée à l'activité est généralement recommandée, voire obligatoire dans certains secteurs."
    },
    "business_angels": {
        "definition": "Investisseurs privés fortunés qui apportent capital et expertise à des startups ou entreprises en développement, généralement en échange de parts dans le capital.",
        "example": "Un ancien entrepreneur à succès investit 150 000€ dans une startup tech en échange de 15% du capital et apporte son réseau de contacts et son expérience.",
        "related_terms": [
            "capital-risque",
            "amorçage",
            "financement",
            "startup",
            "actionnaire"
        ]
    },
    "venture_capital": {
        "definition": "Structure professionnelle gérant des fonds d'investissement destinés à financer des entreprises innovantes à fort potentiel de croissance, en échange de participations minoritaires.",
        "example": "Un fonds de capital-risque investit 2 millions d'euros dans une scale-up en échange de 20% de son capital pour accélérer son développement international.",
        "related_terms": [
            "levée de fonds",
            "série A/B/C",
            "valorisation",
            "due diligence",
            "pacte d'actionnaires"
        ]
    },
    "crowdfunding": {
        "definition": "Méthode de financement permettant à une entreprise de collecter des fonds auprès d'un grand nombre de particuliers via des plateformes en ligne spécialisées.",
        "example": "Une entreprise alimentaire lance une campagne de crowdfunding pour réunir 50 000€ auprès de 400 contributeurs en échange de contreparties et/ou de titres financiers.",
        "related_terms": [
            "financement participatif",
            "plateforme",
            "don",
            "prêt",
            "investissement"
        ]
    },
    "bspce": {
        "definition": "Les Bons de Souscription de Parts de Créateur d'Entreprise (BSPCE) sont des titres permettant aux salariés et dirigeants de jeunes entreprises innovantes d'acquérir des actions à un prix fixé à l'avance.",
        "example": "Une startup tech attribue des BSPCE à ses premiers employés, leur permettant d'acheter des actions à 10€ alors qu'elles valent déjà 30€, comme mécanisme de fidélisation.",
        "related_terms": [
            "actions",
            "startup",
            "incitation",
            "plus-value",
            "stock-options"
        ]
    },
    "aga": {
        "definition": "Les Actions Gratuites d'Attributions (AGA) sont des titres de propriété attribués sans contrepartie financière aux salariés ou dirigeants, avec généralement une période d'acquisition puis de conservation.",
        "example": "Une entreprise attribue 100 actions gratuites à un cadre, qu'il pourra recevoir après 2 ans s'il est toujours dans l'entreprise, et qu'il devra conserver au moins 1 an.",
        "related_terms": [
            "actions",
            "période d'acquisition",
            "période de conservation",
            "avantage en nature",
            "fiscalité des plus-values"
        ]
    },
    "stock_options": {
        "definition": "Options d'achat d'actions permettant à leurs bénéficiaires d'acquérir des titres de leur entreprise à un prix fixé à l'avance pendant une période déterminée.",
        "example": "Un directeur commercial reçoit 1000 stock-options exerçables à 50€ l'action sur 5 ans. Si le cours monte à 100€, il pourra réaliser une plus-value de 50€ par action.",
        "related_terms": [
            "options",
            "prix d'exercice",
            "levée d'option",
            "plus-value d'acquisition",
            "fiscalité des plus-values"
        ]
    },
    "zfu": {
        "definition": "Une Zone Franche Urbaine (ZFU) est un secteur géographique défavorisé où les entreprises qui s'y implantent bénéficient d'exonérations fiscales et sociales pour favoriser le développement économique local.",
        "example": "Une société de services informatiques s'installe dans une ZFU et bénéficie d'une exonération d'impôt sur les bénéfices pendant 5 ans, puis dégressive pendant 3 ans.",
        "related_terms": [
            "quartiers prioritaires",
            "exonération fiscale",
            "cotisations sociales",
            "développement territorial"
        ]
    },
    "qpv": {
        "definition": "Un Quartier Prioritaire de la politique de la Ville (QPV) est un territoire urbain défavorisé bénéficiant de dispositifs spécifiques dont des avantages fiscaux pour les entreprises qui s'y installent.",
        "example": "Un artisan ouvre son atelier dans un QPV et bénéficie d'exonérations de CFE et de cotisations sociales pendant les premières années d'activité.",
        "related_terms": [
            "politique de la ville",
            "exonération",
            "aide à l'implantation",
            "cohésion sociale"
        ]
    },
    "zrr": {
        "definition": "Une Zone de Revitalisation Rurale (ZRR) est un territoire rural en difficulté économique où les entreprises qui s'y implantent bénéficient d'exonérations fiscales et sociales pour favoriser l'activité locale.",
        "example": "Un vétérinaire s'installe en ZRR et bénéficie d'une exonération totale d'impôt sur les bénéfices pendant 5 ans, puis dégressive pendant 3 ans.",
        "related_terms": [
            "ruralité",
            "désertification",
            "exonération fiscale",
            "aménagement du territoire"
        ]
    },
    "bpi": {
        "definition": "Bpifrance (Banque Publique d'Investissement) est un organisme public qui accompagne et finance les entreprises françaises à tous les stades de leur développement.",
        "example": "Une PME industrielle obtient un prêt Bpifrance de 500 000€ sans garantie pour financer son expansion à l'international.",
        "related_terms": [
            "financement public",
            "garantie de prêt",
            "innovation",
            "export",
            "développement économique"
        ]
    },
    "regional": {
        "definition": "Les aides régionales sont des dispositifs de soutien financier proposés par les conseils régionaux pour accompagner les entreprises locales selon les priorités économiques du territoire.",
        "example": "Une entreprise artisanale reçoit une subvention régionale de 30 000€ pour l'achat d'équipements innovants et la création de 3 emplois.",
        "related_terms": [
            "subvention",
            "collectivité territoriale",
            "développement économique",
            "emploi local"
        ]
    },
    "deeptech": {
        "definition": "Le label DeepTech désigne des innovations de rupture issues de la recherche scientifique avancée et présentant des verrous technologiques difficiles, avec des programmes de financement dédiés.",
        "example": "Une startup développant une technologie quantique obtient le label DeepTech et accède à un financement Bpifrance de 2 millions d'euros.",
        "related_terms": [
            "innovation de rupture",
            "recherche fondamentale",
            "transfert technologique",
            "propriété intellectuelle"
        ]
    },
    "lbo": {
        "definition": "Le Leverage Buy-Out (LBO) est une méthode d'acquisition d'entreprise où une partie importante du prix d'achat est financée par de la dette, garantie par les actifs et les flux de trésorerie futurs de l'entreprise cible.",
        "example": "Un dirigeant rachète son entreprise valant 10M€ en apportant 2M€ de fonds propres, le reste étant financé par emprunt bancaire garanti par les actifs de l'entreprise.",
        "related_terms": [
            "effet de levier",
            "dette d'acquisition",
            "holding",
            "transmission d'entreprise",
            "cession partielle"
        ]
    },
    "earn_out": {
        "definition": "Mécanisme de complément de prix dans une cession d'entreprise, où une partie du paiement est différée et conditionnée à l'atteinte de performances futures après la vente.",
        "example": "Un entrepreneur vend sa société pour 1M€ ferme plus un earn-out pouvant atteindre 500 000€ si le chiffre d'affaires dépasse certains seuils sur les 3 prochaines années.",
        "related_terms": [
            "cession d'entreprise",
            "prix différé",
            "objectifs de performance",
            "clause de complément de prix",
            "cession partielle"
        ]
    },
    "simple": {
        "definition": "Mode de comptabilité ultra-simplifié basé uniquement sur les encaissements et décaissements, sans suivi des créances et dettes, adapté aux très petites structures.",
        "example": "Un auto-entrepreneur tient un simple livre de recettes et dépenses sans notion de comptabilité d'engagement.",
        "related_terms": [
            "comptabilité de trésorerie",
            "micro-entreprise",
            "livre des recettes",
            "comptabilite_simple"
        ]
    },
    "moderee": {
        "definition": "Comptabilité de niveau intermédiaire, sans gestion complexe de la TVA, adaptée aux entreprises en franchise de base ou aux structures de taille modeste.",
        "example": "Une petite SARL en franchise de TVA avec un chiffre d'affaires de 50 000€ applique une comptabilité simplifiée sans déclaration mensuelle de TVA.",
        "related_terms": [
            "franchise en base de TVA",
            "régime simplifié",
            "comptabilite_moderee"
        ]
    },
    "complete": {
        "definition": "Comptabilité d'engagement complète respectant l'ensemble des normes comptables, avec suivi détaillé des créances, dettes, stocks et immobilisations.",
        "example": "Une PME avec 2M€ de chiffre d'affaires applique une comptabilité d'engagement complète avec bilan, compte de résultat et annexes détaillées.",
        "related_terms": [
            "comptabilité d'engagement",
            "plan comptable général",
            "clôture annuelle",
            "comptabilite_complete"
        ]
    },
    "externalisee": {
        "definition": "Délégation de la tenue comptable à un expert-comptable externe, qui assure la conformité légale et optimise la gestion financière de l'entreprise.",
        "example": "Une startup tech confie l'intégralité de sa comptabilité à un cabinet d'expertise pour se concentrer sur son développement commercial.",
        "related_terms": [
            "expert-comptable",
            "externalisation",
            "tenue comptable",
            "conseil fiscal",
            "externalite_expert_comptable"
        ]
    },
    "assimilated_employee": {
        "definition": "Statut du dirigeant de SAS/SASU ou gérant minoritaire de SARL, affilié au régime général avec une bonne protection sociale mais un coût plus élevé.",
        "example": "Marc crée une SASU pour son activité de conseil : il se verse 2 000 € nets par mois, ce qui coûte 3 300 € à la société.",
        "related_terms": [
            "président",
            "mandat social",
            "SAS",
            "URSSAF",
            "protection sociale",
            "assimile_salarie"
        ]
    },
    "emancipated_minor": {
        "definition": "Personne de moins de 18 ans ayant obtenu par décision de justice la capacité juridique d'accomplir certains actes réservés aux majeurs, notamment créer une entreprise.",
        "example": "Lisa, 17 ans, est émancipée par le juge des tutelles et peut légalement créer sa micro-entreprise de création de bijoux.",
        "related_terms": [
            "capacité juridique",
            "minorité",
            "émancipation",
            "juge des tutelles"
        ]
    },
    "collaborating_spouse": {
        "definition": "Statut officiel permettant au conjoint qui participe régulièrement à l'activité d'une entreprise familiale de bénéficier d'une protection sociale propre.",
        "example": "Bernard aide son épouse dans son salon de coiffure sans être salarié. En optant pour le statut de conjoint collaborateur, il bénéficie d'une couverture sociale et de droits à la retraite.",
        "related_terms": [
            "entreprise familiale",
            "protection sociale",
            "droits sociaux",
            "retraite",
            "cotisations sociales"
        ]
    },
    "patents": {
        "definition": "Titre de propriété industrielle qui confère à son titulaire un droit exclusif d'exploitation d'une innovation technique pour une durée limitée (généralement 20 ans).",
        "example": "Une startup biotechnologique dépose un brevet sur son procédé innovant de production de protéines, lui garantissant un monopole d'exploitation pendant 20 ans.",
        "related_terms": [
            "propriété industrielle",
            "innovation",
            "INPI",
            "licence",
            "valorisation"
        ]
    },
    "trademarks": {
        "definition": "Signe distinctif qui permet d'identifier et de distinguer les produits ou services d'une entreprise de ceux de ses concurrents, protégé par un dépôt légal.",
        "example": "Une entreprise de cosmétiques dépose sa marque à l'INPI pour protéger son nom, son logo et son slogan contre toute utilisation non autorisée.",
        "related_terms": [
            "INPI",
            "propriété intellectuelle",
            "logo",
            "nom commercial",
            "contrefaçon"
        ]
    },
    "copyright": {
        "definition": "Ensemble des droits dont dispose un auteur ou ses ayants droit sur des œuvres de l'esprit (textes, musiques, logiciels, etc.), protégées dès leur création sans formalité de dépôt.",
        "example": "Un développeur de logiciels indépendant bénéficie automatiquement de la protection par le droit d'auteur sur son code source, sans avoir à le déposer.",
        "related_terms": [
            "droit d'auteur",
            "œuvre de l'esprit",
            "propriété littéraire et artistique",
            "licence",
            "cession de droits"
        ]
    },
    "software": {
        "definition": "Programme informatique bénéficiant d'une double protection juridique par le droit d'auteur pour son code et potentiellement par le brevet pour ses fonctionnalités techniques innovantes.",
        "example": "Une entreprise SaaS protège son logiciel de gestion par le droit d'auteur et dépose un brevet sur son algorithme d'intelligence artificielle spécifique.",
        "related_terms": [
            "propriété intellectuelle",
            "droit d'auteur",
            "brevet logiciel",
            "licence",
            "code source"
        ]
    },
    "integration_fiscale_de_groupe": {
        "definition": "L'intégration fiscale est un dispositif permettant à un groupe de sociétés, constitué d'une société mère (souvent une holding) et de ses filiales, de consolider leurs résultats fiscaux pour ne payer qu'un seul impôt sur les sociétés sur le résultat global du groupe.",
        "example": "Une holding détient à 100 % deux sociétés : l'une est déficitaire, l'autre bénéficiaire. Grâce à l'intégration fiscale, le déficit de l'une compense le bénéfice de l'autre, réduisant ainsi l'impôt global du groupe.",
        "related_terms": [
            "groupe de sociétés",
            "holding",
            "impôt sur les sociétés",
            "optimisation fiscale"
        ],
        "fonctionnement": [
            "Chaque société du groupe calcule son résultat fiscal séparément",
            "La société mère centralise les résultats (bénéfices et pertes)",
            "Un résultat fiscal unique est établi pour le groupe",
            "Un seul paiement d'impôt sur les sociétés est effectué par la société mère"
        ],
        "avantages": [
            "Compensation immédiate des bénéfices et pertes entre filiales",
            "Réduction globale de l'impôt à payer",
            "Neutralisation fiscale des dividendes intragroupe (hors quote-part de frais et charges)",
            "Simplification : une seule déclaration fiscale pour tout le groupe"
        ],
        "conditions": [
            "La société mère doit détenir au moins 95 % du capital de chaque filiale intégrée",
            "Option pour l'intégration fiscale valable pour 5 ans, renouvelable",
            "Accord écrit de toutes les sociétés intégrées",
            "Résidence fiscale en France des sociétés intégrées (sauf cas particuliers)"
        ],
        "inconvenients": [
            "Procédures administratives plus lourdes",
            "Obligations de reporting fiscal plus complexes",
            "Suivi rigoureux exigé chaque année"
        ],
        "mise_en_place": [
            "Analyse préalable de la structure de détention",
            "Signature d'une convention d'intégration entre la mère et les filiales",
            "Dépôt de l'option auprès de l'administration fiscale avec pièces justificatives",
            "Déclaration consolidée de l'impôt sur les sociétés par la holding"
        ],
        "impact": "L'intégration fiscale permet une optimisation fiscale immédiate et stratégique, en centralisant l'imposition au niveau du groupe, tout en sécurisant la trésorerie et facilitant la croissance des filiales sous le pilotage d'une société mère."
    },
    "options_a_l_is": {
        "definition": "L'impôt sur les sociétés (IS) et l'impôt sur le revenu (IR) sont deux régimes fiscaux distincts selon la forme juridique de l'entreprise. L'IS est payé par la société sur ses bénéfices, tandis que l'IR est payé directement par les associés ou l'entrepreneur sur leur part de bénéfice intégrée à leur revenu global.",
        "example": "Une SAS réalisant 100 000 € de bénéfices paiera 15 % sur les premiers 42 500 €, puis 25 % sur le reste. Un entrepreneur individuel intégrera 40 000 € de bénéfice à son revenu personnel pour l'IR.",
        "related_terms": [
            "impôt",
            "fiscalité",
            "bénéfices",
            "dividendes",
            "taux d'imposition",
            "barème fiscal"
        ]
    },
    "caution_bancaire": {
        "definition": "Garantie demandé par la banque : si l’entreprise ne rembourse pas le prêt, la caution (personne ou organisme) paie à sa place.",
        "example": "Pour un prêt pro de 80 000 €, le dirigeant se porte caution solidaire à hauteur de 24 000 € ; le solde est couvert par Bpifrance. En cas de défaut, la banque encaisse d’abord les 24 000 € auprès du dirigeant, puis active la garantie publique.",
        "fonctionnement": [
            "Trois parties : banque (créancier), entreprise (débiteur), caution (garant).",
            "La caution peut être simple (la banque poursuit d’abord l’entreprise) ou solidaire (recours direct contre la caution)."
        ],
        "risque": "Si le dirigeant est caution solidaire, son patrimoine personnel est exposé jusqu’au montant garanti.",
        "obtention": "Dossier solide + éventuelle co‑garantie (Bpifrance, France Active, SCM) pour limiter la caution personnelle.",
        "related_terms": [
            "caution simple",
            "caution solidaire",
            "garantie bancaire",
            "Bpifrance Garantie"
        ]
    },
    "holding_de_tete": {
        "definition": "Société mère dont l’activité principale est de détenir les titres de filiales afin d’en contrôler la gestion, d’optimiser la fiscalité du groupe et de centraliser la trésorerie.",
        "example": "Un entrepreneur place ses sociétés de conseil et de développement dans une SAS holding ; la holding perçoit les dividendes, finance une nouvelle filiale et, grâce au régime mère‑fille, n’est imposée que sur 5 % des dividendes reçus.",
        "atouts": [
            "Contrôle groupe : regrouper plusieurs sociétés sous une même entité sans perdre le pouvoir.",
            "Optimisation fiscale : régime mère‑fille (95 % de dividendes exonérés) et plus‑value sur cession de filiale taxée sur 10 % seulement.",
            "Gestion de trésorerie : faire circuler les excédents pour financer une filiale déficitaire.",
            "Transmission / investissement : outil flexible pour céder ou réinvestir dans de nouveaux projets."
        ],
        "types": {
            "passive": "Détient uniquement les participations (holding pure).",
            "active": "Fournit en plus des services et anime le groupe (holding animatrice)."
        },
        "creation": [
            "Choisir la forme (SAS, SARL, SA…).",
            "Rédiger les statuts (organisation, contrôle des filiales).",
            "Immatriculer au RCS.",
            "Apporter les titres des filiales au capital (évaluation possible par commissaire aux apports)."
        ],
        "risque": "Complexité juridique et fiscale : nécessite une gestion rigoureuse pour conserver les régimes avantageux.",
        "related_terms": [
            "régime mère‑fille",
            "intégration fiscale",
            "apport‑cession",
            "holding animatrice",
            "filiale"
        ]
    },
    "optimisation_fiscale": {
        "definition": "Ensemble de stratégies légales qui permettent à une jeune entreprise de réduire sa charge d’impôt (IS/IR, cotisations, taxes) dès la création, sans sortir du cadre réglementaire.",
        "example": "Une SAS choisit l’IS, déduit ses dépenses de lancement, place un excédent de trésorerie dans un plan d’épargne salariale (PEE) exonéré d’IS, puis réclame le crédit d’impôt recherche sur 40 000 € de R&D : le résultat imposable chute de plus de 50 %.",
        "leviers": [
            "Choix du statut (IS ou IR) et du régime fiscal.",
            "Déduction intégrale des charges professionnelles et amortissements.",
            "Crédits / réductions d’impôt (CIR, CII, dons, formation).",
            "Dispositifs sociaux : ACRE, exonération CFE, épargne salariale.",
            "Gestion des déficits reportables et provisions.",
            "Réinvestissement des bénéfices (trésorerie ou rémunération dirigeant)."
        ]
    }
}
