{
  "micro-entreprise": {
    "definition": "Régime simplifié d'entreprise individuelle, adapté aux petites activités, avec un système fiscal et social forfaitaire et allégé.",
    "example": "Un freelance développeur web avec un CA annuel de 40 000€ peut opter pour le statut micro-entrepreneur et bénéficier d'une déclaration simplifiée.",
    "related_terms": ["auto-entrepreneur", "ACRE", "versement libératoire"]
  },
  "eirl": {
    "definition": "L'Entreprise Individuelle à Responsabilité Limitée permet à un entrepreneur individuel de protéger son patrimoine personnel en affectant un patrimoine professionnel distinct à son activité.",
    "example": "Un artisan peut créer une EIRL en listant précisément les biens affectés à son activité, séparant ainsi son patrimoine professionnel de ses biens personnels.",
    "related_terms": ["patrimoine d'affectation", "entrepreneur individuel", "responsabilité limitée"]
  },
  "ei": {
    "definition": "L'Entreprise Individuelle est une forme juridique où l'entrepreneur et l'entreprise constituent une seule entité juridique, avec des démarches de création simplifiées.",
    "example": "Un consultant indépendant en EI déclare ses revenus professionnels dans sa déclaration d'impôts personnelle sous le régime des BNC.",
    "related_terms": ["TNS", "BIC", "BNC", "affaire personnelle"]
  },
  "eurl": {
    "definition": "L'Entreprise Unipersonnelle à Responsabilité Limitée est une société à responsabilité limitée avec un associé unique, permettant de limiter la responsabilité au montant des apports.",
    "example": "Une personne souhaitant créer une agence web peut opter pour l'EURL avec un capital de 1000€, protégeant ainsi son patrimoine personnel.",
    "related_terms": ["gérant", "associé unique", "SARL", "option IR/IS"]
  },
  "sasu": {
    "definition": "La Société par Actions Simplifiée Unipersonnelle est une SAS avec un seul associé, offrant une grande flexibilité statutaire et le statut d'assimilé-salarié.",
    "example": "Un consultant IT se constitue en SASU pour bénéficier de la protection sociale du régime général tout en conservant la flexibilité de définir librement les règles de gouvernance.",
    "related_terms": ["assimilé-salarié", "président", "SAS", "dividendes"]
  },
  "sarl": {
    "definition": "La Société à Responsabilité Limitée est une forme de société commerciale où la responsabilité des associés est limitée à leurs apports, avec un formalisme moins contraignant que la SA.",
    "example": "Deux associés créent une SARL pour ouvrir un restaurant avec un capital de 5000€ réparti à parts égales.",
    "related_terms": ["gérant majoritaire", "gérant minoritaire", "parts sociales", "IS", "co-gérance"]
  },
  "sas": {
    "definition": "La Société par Actions Simplifiée est une forme de société commerciale offrant une grande liberté statutaire et organisationnelle, adaptée aux projets avec investisseurs.",
    "example": "Une startup tech adopte le statut SAS pour faciliter l'entrée d'investisseurs et mettre en place un pacte d'actionnaires et des actions de préférence.",
    "related_terms": ["président", "actions", "pacte d'actionnaires", "liberté statutaire"]
  },
  "selafa": {
    "definition": "La Société d'Exercice Libéral à Forme Anonyme est une structure dédiée aux professions libérales réglementées, fonctionnant comme une SA.",
    "example": "Un groupe de médecins spécialistes créent une SELAFA pour exercer ensemble, avec un capital minimum de 37 000€ et un conseil d'administration.",
    "related_terms": ["SEL", "SA", "profession libérale", "ordre professionnel"]
  },
  "selarl": {
    "definition": "La Société d'Exercice Libéral à Responsabilité Limitée est une structure dédiée aux professions libérales réglementées, fonctionnant comme une SARL.",
    "example": "Deux avocats s'associent en SELARL pour mutualiser leurs moyens tout en exerçant une profession réglementée par un ordre professionnel.",
    "related_terms": ["SEL", "SARL", "profession libérale", "ordre professionnel"]
  },
  "selas": {
    "definition": "La Société d'Exercice Libéral par Actions Simplifiée permet aux professionnels libéraux réglementés d'exercer en structure sociétaire avec la flexibilité d'une SAS.",
    "example": "Un groupe d'experts-comptables crée une SELAS pour bénéficier de la souplesse statutaire tout en respectant les règles de l'ordre professionnel.",
    "related_terms": ["SEL", "SAS", "profession libérale", "président"]
  },
  "scop": {
    "definition": "La Société Coopérative et Participative est une entreprise dont les salariés sont associés majoritaires et participent aux décisions stratégiques selon le principe \"une personne = une voix\".",
    "example": "Une équipe de développeurs crée une SCOP où chaque membre détient une part égale du capital et participe aux décisions, avec une répartition équitable des bénéfices.",
    "related_terms": ["coopérative", "ESS", "participation", "réserves impartageables"]
  },
  "scic": {
    "definition": "La Société Coopérative d'Intérêt Collectif permet d'associer autour d'un projet économique commun des acteurs multiples: salariés, bénéficiaires, collectivités publiques, entreprises, associations, particuliers...",
    "example": "Un projet d'agriculture locale durable se structure en SCIC pour associer producteurs, consommateurs, collectivités locales et salariés dans la gouvernance.",
    "related_terms": ["ESS", "multi-sociétariat", "utilité sociale", "lucrativité limitée"]
  },
  "is": {
    "definition": "L'Impôt sur les Sociétés est un impôt direct qui frappe les bénéfices réalisés par les sociétés et certaines autres personnes morales.",
    "example": "Une SARL réalisant 100 000€ de bénéfices paiera 25 000€ d'IS au taux normal (ou 15% sur les premiers 42 500€ de bénéfices pour les PME).",
    "related_terms": ["résultat fiscal", "bénéfice imposable", "taux réduit", "acomptes d'IS"]
  },
  "ir": {
    "definition": "L'Impôt sur le Revenu est un impôt direct progressif par tranches qui porte sur le revenu des personnes physiques et de certaines entreprises individuelles.",
    "example": "Un entrepreneur individuel qui génère 60 000€ de bénéfices verra cette somme ajoutée à ses autres revenus et imposée selon le barème progressif de l'IR.",
    "related_terms": ["tranches d'imposition", "quotient familial", "BIC", "BNC", "foyer fiscal"]
  },
  "tns": {
    "definition": "Le Travailleur Non Salarié est un statut social concernant les indépendants non-salariés qui ne cotisent pas au régime général de la sécurité sociale mais à un régime spécifique.",
    "example": "Un artisan en EI ou un gérant majoritaire de SARL sont des TNS qui cotisent à la SSI (ex-RSI) pour leur protection sociale.",
    "related_terms": ["SSI", "indépendant", "cotisations sociales", "gérant majoritaire"]
  },
  "assimile-salarie": {
    "definition": "Statut social accordé à certains dirigeants de sociétés qui bénéficient du régime général de la sécurité sociale, similaire aux salariés, bien que n'étant pas juridiquement subordonnés.",
    "example": "Le président d'une SAS ou SASU est assimilé-salarié et cotise au régime général pour sa retraite, sa santé et le chômage.",
    "related_terms": ["régime général", "sécurité sociale", "president SAS", "gérant minoritaire"]
  },
  "acre": {
    "definition": "L'Aide à la Création ou à la Reprise d'Entreprise offre une exonération partielle de charges sociales pendant la première année d'activité pour les créateurs d'entreprise.",
    "example": "Un demandeur d'emploi créant son entreprise peut bénéficier de l'ACRE, réduisant ses cotisations sociales de 50% la première année.",
    "related_terms": ["exonération", "cotisations sociales", "création d'entreprise", "demandeur d'emploi"]
  },
  "bspce": {
    "definition": "Les Bons de Souscription de Parts de Créateur d'Entreprise permettent aux startups de moins de 15 ans d'attribuer à leurs salariés et dirigeants des bons leur donnant droit d'acquérir des actions à un prix déterminé à l'avance.",
    "example": "Une startup tech attribue des BSPCE à ses premiers employés, leur permettant d'acheter des actions à 10€ alors qu'elles valent 50€ après la levée de fonds.",
    "related_terms": ["startup", "stock-options", "plus-value d'acquisition", "actions"]
  },
  "pfu": {
    "definition": "Le Prélèvement Forfaitaire Unique, aussi appelé \"flat tax\", est un taux d'imposition fixe de 30% (12,8% d'impôt sur le revenu + 17,2% de prélèvements sociaux) sur les revenus du capital.",
    "example": "Un actionnaire reçoit 10 000€ de dividendes et opte pour le PFU: il paiera 3 000€ d'impôt au total (flat tax), au lieu d'utiliser le barème progressif de l'IR.",
    "related_terms": ["dividendes", "plus-values mobilières", "fiscalité du capital", "abattement 40%"]
  },
  "zfu": {
    "definition": "Les Zones Franches Urbaines sont des quartiers prioritaires où les entreprises bénéficient d'exonérations fiscales et sociales pour favoriser le développement économique et l'emploi.",
    "example": "Une agence de communication s'installe en ZFU et bénéficie d'une exonération d'IS pendant 5 ans, puis dégressive pendant 3 ans.",
    "related_terms": ["QPV", "exonération fiscale", "implantation territoriale", "politique de la ville"]
  },
  "jei": {
    "definition": "Le statut Jeune Entreprise Innovante offre des avantages fiscaux et sociaux aux PME réalisant des projets de R&D, notamment une réduction des charges sociales et une exonération d'IS.",
    "example": "Une startup développant une technologie de blockchain obtient le statut JEI, lui permettant d'économiser significativement sur ses charges patronales pour ses ingénieurs R&D.",
    "related_terms": ["R&D", "innovation", "exonérations sociales", "CIR"]
  },
  "cir": {
    "definition": "Le Crédit d'Impôt Recherche est un dispositif fiscal qui permet aux entreprises de déduire une partie de leurs dépenses de recherche et développement de leur impôt.",
    "example": "Une entreprise qui dépense 100 000€ en R&D peut obtenir un CIR de 30 000€, réduisant d'autant son IS ou obtenir un remboursement direct si elle est déficitaire.",
    "related_terms": ["recherche", "innovation", "JEI", "crédit d'impôt"]
  },
  "esus": {
    "definition": "L'agrément Entreprise Solidaire d'Utilité Sociale reconnaît les entreprises de l'ESS poursuivant un objectif d'utilité sociale, leur permettant d'accéder à des financements spécifiques.",
    "example": "Une entreprise d'insertion professionnelle pour personnes handicapées obtient l'agrément ESUS pour lever des fonds auprès d'investisseurs solidaires bénéficiant d'avantages fiscaux.",
    "related_terms": ["ESS", "impact social", "utilité sociale", "finance solidaire", "SCIC"]
  },
  "pacte-d-associes": {
    "definition": "Accord confidentiel entre associés d'une société qui complète les statuts en définissant des règles spécifiques: cession de parts, gouvernance, sortie, etc.",
    "example": "Dans une SAS avec plusieurs associés, un pacte prévoit un droit de préemption, une clause de sortie conjointe et des règles de valorisation en cas de cession.",
    "related_terms": ["gouvernance", "cession de titres", "préemption", "clause de sortie", "valorisation"]
  },
  "ca-previsionnel": {
    "definition": "Projection du chiffre d'affaires qu'une entreprise prévoit de réaliser sur une période future, généralement sur un an ou plus.",
    "example": "Une entreprise en création établit un CA prévisionnel de 70 000€ pour sa première année, 120 000€ pour la deuxième année, et 200 000€ pour la troisième année.",
    "related_terms": ["business plan", "prévisionnel financier", "seuil de rentabilité", "budget"]
  },
  "versement-liberatoire": {
    "definition": "Option fiscale proposée aux micro-entrepreneurs dont le revenu fiscal de référence ne dépasse pas un certain seuil, permettant de payer l'impôt sur le revenu en même temps que les cotisations sociales.",
    "example": "Un micro-entrepreneur avec un RFR faible opte pour le versement libératoire à 1% sur son CA commercial, simplifiant ses démarches et optimisant sa fiscalité.",
    "related_terms": ["micro-entreprise", "impôt sur le revenu", "prélèvement forfaitaire", "abattement forfaitaire"]
  },
  "tmi": {
    "definition": "Le Taux Marginal d'Imposition est le taux d'imposition applicable à la dernière tranche de revenus d'un contribuable dans le cadre de l'impôt progressif.",
    "example": "Un contribuable dont le revenu net imposable est de 100 000€ se trouve dans la tranche à 41% - son TMI est donc de 41%, mais son taux moyen d'imposition sera inférieur.",
    "related_terms": ["tranches d'imposition", "IR", "imposition progressive", "taux moyen"]
  }
}