{
  "us": [
    {
      "title": "Crucial Inflation Metric Was 2.8% In February As Tariffs Loom Over Inflation Stuck Above 2% Target",
      "content": "The Federal Reserve's favored inflation metric matched the central bank's higher than normal forecast in February, according to Commerce Department data released Friday morning, as inflation still struggles to come down to its pre-pandemic norm – and President Donald Trump's tariffs throw a new curveball to policymakers.",
      "source": "forbes.com",
      "date": "28/03/2025",
      "time": "08:32",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.forbes.com/sites/dereksaul/2025/03/28/crucial-inflation-metric-was-28-in-february-as-tariffs-loom-over-inflation-stuck-above-2-target/",
      "score": 18
    },
    {
      "title": "XRP price may drop another 40% as Trump tariffs spook risk traders",
      "content": "The XRP (XRP) market is flashing warning signs as a bearish technical pattern emerges on its weekly chart, coinciding with macroeconomic pressures from anticipated US tariffs in April.XRP descending triangle pattern hints at 40% drop Since its late 2024 rally, the XRP price chart has been forming a potential triangle pattern on its weekly chart, characterized by a flat support level mixed with a downward-sloping resistance line. A descending triangle pattern forming after a strong uptrend is seen as a bearish reversal indicator.",
      "source": "cointelegraph.com",
      "date": "28/03/2025",
      "time": "08:55",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://cointelegraph.com/news/xrp-price-drop-40-trump-tariffs-spook-risk-traders",
      "score": 13
    },
    {
      "title": "Core inflation in February hits 2.8%, hotter than expected; spending increases 0.4%",
      "content": "The PCE price index was expected to increase 0.3% in February while spending was projected to rise 0.5%.",
      "source": "cnbc.com",
      "date": "28/03/2025",
      "time": "08:45",
      "category": "economie",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/28/pce-inflation-february-2025-.html",
      "score": 13
    },
    {
      "title": "Inflation Remained Sticky Ahead of Trump's Escalating Trade War",
      "content": "The Federal Reserve's preferred inflation measure showed underlying price pressures persisting in February.",
      "source": "nytimes.com",
      "date": "28/03/2025",
      "time": "08:41",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.nytimes.com/2025/03/28/business/economy/us-inflation-pce-trump-trade-tariffs.html",
      "score": 13
    },
    {
      "title": "Teeter: Tariffs will extend the process of Fed rate cuts",
      "content": "Robert Teeter, Chief Investment Strategist at Silvercrest Asset Management, discusses market uncertainty, the impact of tariffs on inflation, and the importance of earnings season in shaping investor sentiment.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "08:02",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=23ae6GFBlH4",
      "score": 13
    },
    {
      "title": "UniDoc Completes Purchase of AGNES Connect(R) Software from AMD Telemedicine",
      "content": "VANCOUVER, BC / ACCESS Newswire / March 28, 2025 / UniDoc Health Corp. (CSE:UDOC)(FRA:L7T)(OTCQB:UDOCF) (\"UniDoc\" or the \"Company\"), announces that, further to its news release dated March 19, 2025, it has closed the acquisition of the AGNES Connect software from AMD Telemedicine (\"AMD\"). \"The AGNES Connect software forms the foundation of UniDoc's NEIL Connect software platform, and I am excited to complete this acquisition and bring the ownership and future development of this software in house.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/healthcare-and-pharmaceutical/unidoc-completes-purchase-of-agnes-connectr-software-from-amd-telemed-1006679",
      "score": 10
    },
    {
      "title": "Inflation gauge favored by Fed showed prices ticked higher in February",
      "content": "The Commerce Department released the February personal consumption expenditures (PCE) index which showed that inflation remains above the Federal Reserve's 2% goal.",
      "source": "foxbusiness.com",
      "date": "28/03/2025",
      "time": "08:46",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.foxbusiness.com/economy/february-2025-pce-inflation",
      "score": 10
    },
    {
      "title": "Clark: Tariff impact may not show up in February data yet",
      "content": "Veronica Clark, Citi economist, expects core PCE at 2.7%, with the Fed eyeing 2.8%. Inflation remains sticky, and tariffs may raise prices.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "07:34",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=YrAqy9ZmMB0",
      "score": 10
    },
    {
      "title": "Blaqclouds, Inc. Enters Strategic Partnership Agreement with Nyne Global to Enhance Client Engagement Services",
      "content": "ROBESONIA, Pa., March 28, 2025 (GLOBE NEWSWIRE) -- Blaqclouds, Inc. (OTC: BCDS), a leader in blockchain technology solutions, is pleased to announce a strategic partnership with Nyne Global, a premier marketing, consulting, and management firm.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "crypto",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.globenewswire.com/news-release/2025/03/28/3051394/0/en/Blaqclouds-Inc-Enters-Strategic-Partnership-Agreement-with-Nyne-Global-to-Enhance-Client-Engagement-Services.html",
      "score": 7
    },
    {
      "title": "Shareholders that lost money on ModivCare Inc.(MODV) Urged to Join Class Action - Contact Levi & Korsinsky to Learn More",
      "content": "EW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your ModivCare Inc. (NASDAQ:MODV) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/modivcare-inc-lawsuit-submission-form?prid=139388&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/shareholders-that-lost-money-on-modivcare-incmodv-urged-to-join--1006788",
      "score": 6
    },
    {
      "title": "Shareholders that Lost Money on Monolithic Power Systems Inc. (MPWR) Urged to Join Class Action - Contact Levi & Korsinsky to Learn More",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your Monolithic Power Systems Inc. (NASDAQ:MPWR) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/monolithic-lawsuit-submission-form?prid=139385&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/shareholders-that-lost-money-on-monolithic-power-systems-inc-mpw-1006779",
      "score": 6
    },
    {
      "title": "U.S. Treasury Yields Fall",
      "content": "U.S. Treasury yields fell as investors remained cautious ahead of next week's tariff announcements.",
      "source": "wsj.com",
      "date": "28/03/2025",
      "time": "07:27",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.wsj.com/finance/jgbs-mixed-higher-than-expected-tokyo-cpi-may-weigh-9c9b59c8",
      "score": 5
    },
    {
      "title": "Trump's 25% auto import tariffs: these are the most impacted manufacturers",
      "content": "President Trump followed through with plans to slap the auto industry with a hefty 25% tariff this week. Automakers are going to be impacted disproportionality.",
      "source": "foxbusiness.com",
      "date": "28/03/2025",
      "time": "07:31",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.foxbusiness.com/economy/trumps-25-auto-import-tariffs-most-impacted-manufacturers",
      "score": 4
    },
    {
      "title": "Gates Expands Data Center Cooling Portfolio with Breakthrough Large-Diameter Hose",
      "content": "Data Master™ MegaFlex™ is the first-of-its-kind large-diameter hose that combines ultra-flexibility with coolant compatibility for the demanding high-density digital infrastructure DENVER , March 28, 2025 /PRNewswire/ -- Gates (NYSE: GTES), a global manufacturer of innovative, highly engineered power transmission and fluid power solutions, today announced the launch of Data Master MegaFlex. This groundbreaking large-diameter cooling hose expands the company's data center product portfolio, joining the Data Master™ small-diameter hose, which launched in 2024.",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.prnewswire.com/news-releases/gates-expands-data-center-cooling-portfolio-with-breakthrough-large-diameter-hose-302413980.html",
      "score": 3
    },
    {
      "title": "Levi & Korsinsky Announces the Filing of a Securities Class Action on Behalf of AppLovin Corporation(APP) Shareholders",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your AppLovin Corporation (NASDAQ:APP) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/applovin-corporation-lawsuit-submission-form?prid=139386&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/levi-and-korsinsky-announces-the-filing-of-a-securities-class-ac-1006782",
      "score": 3
    }
  ],
  "france": [
    {
      "title": "Bitcoin Price Outlook – Bitcoin Drops on Friday",
      "content": "The Bitcoin market has fallen a bit in the early part of Friday trading. At this point, it should be completely obvious that we are in a range at the moment, and that we aren't ready to continue higher.",
      "source": "fxempire.com",
      "date": "28/03/2025",
      "time": "08:54",
      "category": "crypto",
      "impact": "negative",
      "country": "france",
      "url": "https://www.fxempire.com/forecasts/article/bitcoin-price-outlook-bitcoin-drops-on-friday-1507840",
      "score": 13
    },
    {
      "title": "General Electric (NYSE:GE) Maintains Strong Position in Aerospace with Bernstein's \"Outperform\" Rating",
      "content": "<ul>\n<li>Bernstein raises the price target for <a href=\"https://site.financialmodelingprep.com/financial-summary/GE\">General Electric (NYSE:GE)</a> Aerospace from $232 to $250, highlighting the division's recent achievements and technological prowess.</li>\n<li>GE Aerospace secures a significant contract with Korean Air for GEnx and GE9X engines, reinforcing its market position and showcasing its engineering excellence.</li>\n<li>Despite a slight decrease in stock price, GE's market presence remains dynamic, with a current trading price of <strong>$205.88</strong> and a market capitalization of around <strong>$220.97 billion</strong>.</li>\n</ul>\n\n<p>General Electric (NYSE:GE) is a multinational conglomerate known for its diverse operations, including aviation, healthcare, and power. GE Aerospace, a key division, focuses on manufacturing jet engines and providing related services. The company competes with other aerospace giants like Rolls-Royce and Pratt & Whitney. Recently, Bernstein maintained an \"Outperform\" rating for GE, with the stock priced at <strong>$205.88</strong>.</p>\n\n<p>Bernstein's decision to raise the price target for GE Aerospace from $232 to $250 is supported by the division's recent achievements. GE Aerospace secured a major contract with Korean Air to supply GEnx and GE9X engines for their Boeing 787-10 and 777-9 aircraft. This deal strengthens GE's position in the aerospace market and highlights its technological prowess.</p>\n\n<p>The GEnx engine family, with over 62 million flight hours, is a testament to GE's engineering excellence. With more than 3,600 engines in service or on backlog, the GEnx engine powers two-thirds of all Boeing 787 aircraft. The GE9X engine, chosen by Korean Air, offers a <strong>10%</strong> improvement in fuel efficiency over its predecessor, enhancing the airline's operational efficiency.</p>\n\n<p>Korean Air's decision to select GE Aerospace engines underscores the strong partnership between the two companies. The order includes a service agreement for maintenance, repair, and overhaul of the GE9X engines, marking a first in South Korea. This collaboration aligns with Korean Air's vision of fleet expansion and excellence, as highlighted by Walter Cho, Chairman and CEO of Korean Air.</p>\n\n<p>Despite the positive developments, GE's stock price has seen a slight decrease of $1.49, or approximately <strong>-0.72%</strong>, currently trading at <strong>$205.88</strong>. The stock has fluctuated between $202.80 and $207.69 today, with a market capitalization of around <strong>$220.97 billion</strong>. Over the past year, GE's stock has ranged from a low of $133.99 to a high of $214.21, reflecting its dynamic market presence.</p>",
      "source": "Financial Modeling Prep",
      "date": "28/03/2025",
      "time": "09:03",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://financialmodelingprep.com/market-news/ge-aerospace-secures-bernstein-outperform-rating",
      "score": 12
    },
    {
      "title": "Top 2 Materials Stocks That May Crash In Q1",
      "content": "As of March 28, 2025, two stocks in the materials sector could be flashing a real warning to investors who value momentum as a key criteria in their trading decisions.",
      "source": "benzinga.com",
      "date": "28/03/2025",
      "time": "08:26",
      "category": "marches",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.benzinga.com/trading-ideas/short-ideas/25/03/44534543/top-2-materials-stocks-that-may-crash-in-q1",
      "score": 12
    },
    {
      "title": "Argo Living Soils Corp. Announces Consulting Agreement with New Orleans Private Wealth Management",
      "content": "Vancouver, British Columbia--(Newsfile Corp. - March 28, 2025) - Argo Living Soils Corp. (CSE: ARGO) (OTC Pink: ARLSF) (\"Argo\" or the \"Company\") announces that it has entered into an arm's length consulting agreement dated March 24, 2025 (the \"Consulting Agreement\") with New Orleans Private Wealth Management (\"NOWM\") pursuant to which NOWM has agreed to provide strategic advisory services to the Company relating to business development, product planning and market development, and introductions to strategic partners, prospective customers and sources of financing for a two year term. Pursuant to the Consulting Agreement, the Company has agreed to issue NOWM non-transferable compensation options (\"Compensation Options\") exercisable into up to 1,500,000 units of the Company (\"Units\") at a price of $0.54 per Unit for two years from the date of issuance, with each Unit consisting of one common share and one common share purchase warrant (\"Warrant\") of the Company.",
      "source": "newsfilecorp.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "marches",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.newsfilecorp.com/release/246435/Argo-Living-Soils-Corp.-Announces-Consulting-Agreement-with-New-Orleans-Private-Wealth-Management",
      "score": 6
    },
    {
      "title": "PTC Therapeutics Provides Regulatory Update on Translarna™ (ataluren) in Europe",
      "content": "WARREN, N.J. , March 28, 2025 /PRNewswire/ -- PTC Therapeutics, Inc. (NASDAQ: PTCT) announced today that the European Commission (EC) has adopted the opinion of the Committee for Medicinal Products for Human Use (CHMP) of the European Medicines Agency (EMA) to not renew the authorization of Translarna™ (ataluren) for the treatment of nonsense mutation Duchenne muscular dystrophy.",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "marches",
      "impact": "negative",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/ptc-therapeutics-provides-regulatory-update-on-translarna-ataluren-in-europe-302414288.html",
      "score": 5
    },
    {
      "title": "Value is returning to alternative chains, with growth for Bera, Sui, Aptos and Sonic",
      "content": "DeFi lending is recovering in March after a series of market capitulations and liquidations. More value is flowing into smaller chains, with the biggest growth for Berachain and Sonic.",
      "source": "cryptopolitan.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://www.cryptopolitan.com/value-is-returning-to-alternative-chains/",
      "score": 5
    },
    {
      "title": "Mortgage Rates Expected to Move Lower in 2025 and 2026",
      "content": "Existing Home Sales Forecast Upgraded Slightly on Lower Rate Outlook WASHINGTON , March 28, 2025 /PRNewswire/ -- Mortgage rates are now expected to end 2025 and 2026 at 6.3 percent and 6.2 percent, respectively, downward revisions of three-tenths for each, according to the March 2025 commentary from the Fannie Mae (OTCQB: FNMA) Economic and Strategic Research (ESR) Group. The lower mortgage rate outlook resulted in a small upward revision to the ESR Group's existing home sales outlook in 2025, though expectations for total home sales remain subdued.",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/mortgage-rates-expected-to-move-lower-in-2025-and-2026-302414009.html",
      "score": 2
    },
    {
      "title": "A ‘Tesla Takedown' is coming this weekend. Will it rock Tesla?",
      "content": "Activists are pushing for more protests against Elon Musk's involvement in politics, as calls for the Tesla Inc. chief executive to refocus on the company continue to grow and the backlash against DOGE has been a major drag on the EV maker's stock.",
      "source": "marketwatch.com",
      "date": "28/03/2025",
      "time": "09:01",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/a-tesla-takedown-is-coming-this-weekend-will-it-rock-tesla-4bb11a9d",
      "score": 0
    },
    {
      "title": "RNA Biotechs: Current State And Outlook",
      "content": "RNA-based therapeutics are gaining traction due to advancements in delivery technologies, despite historical challenges with stability and specificity. Alnylam, Ionis, and Sarepta lead the RNA therapeutics market, with Alnylam showing the most promise due to superior delivery technologies.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771239-rna-biotechs-current-state-and-outlook",
      "score": 0
    },
    {
      "title": "G'DAY, CARNIVAL ADVENTURE AND CARNIVAL ENCOUNTER! TWO SHIPS OFFICIALLY JOIN CARNIVAL FLEET IN AUSTRALIA",
      "content": "Carnival Cruise Line is Now the Leading Cruise Operator in Australia as Global Fleet Grows to Record 29 Ships SYDNEY , March 28, 2025 /PRNewswire/ -- Marking an exciting new chapter for Carnival Cruise Line as Australia's leading cruise operator, Carnival Adventure and Carnival Encounter are preparing to embark on their maiden voyages, delivering more signature Carnival fun to guests departing from Sydney and Brisbane. With the addition of these two ships, Carnival Cruise Line now has the largest fleet of ships in its 53-year history, totaling 29 ships.",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "09:00",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/gday-carnival-adventure-and-carnival-encounter-two-ships-officially-join-carnival-fleet-in-australia-302414253.html",
      "score": 0
    }
  ],
  "events": [
    {
      "title": "Dallas Fed Manufacturing Index (Mar)",
      "date": "31/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q1)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Mar)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index YoY (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Spending MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Income MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Waller Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    }
  ],
  "lastUpdated": "2025-03-28T13:16:04.974336"
}