{
  "lastUpdated": "2025-06-26T08:23:53.755828",
  "us": [
    {
      "title": "Exclusive: Fed should wait on rate cuts with price hikes expected, Bostic says",
      "content": "The Federal Reserve need not cut interest rates with companies planning to raise prices later this year in response to higher import taxes and with the job market still stable, Atlanta Fed President Raphael Bostic told Reuters.",
      "source": "reuters.com",
      "rawDate": "2025-06-24 06:04:45",
      "date": "24/06/2025",
      "time": "06:04",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/fed-should-wait-rate-cuts-with-price-hikes-expected-bostic-says-2025-06-24/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 52.99419191919192
    },
    {
      "title": "Apple supplier Jabil raises annual forecast as data center appetite remains strong",
      "content": "Electronics component maker Jabil raised full-year profit and revenue forecast on Tuesday, betting on strong infrastructure services demand for data centers.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 08:54:03",
      "date": "17/06/2025",
      "time": "08:54",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/technology/apple-supplier-jabil-raises-annual-forecast-data-center-appetite-remains-strong-2025-06-17/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 50.920959595959594
    },
    {
      "title": "Swiss inflation turns negative for first time since COVID pandemic",
      "content": "Swiss inflation turned negative in May, marking the first decline in consumer prices for more than four years and adding pressure on the Swiss National Bank to cut its interest rate steeply later this month.",
      "source": "reuters.com",
      "rawDate": "2025-06-03 03:13:43",
      "date": "03/06/2025",
      "time": "03:13",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/retail-consumer/swiss-inflation-turns-negative-first-time-since-covid-pandemic-2025-06-03/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 50.075
    },
    {
      "title": "Norges Bank expected to cut rates twice more in 2025",
      "content": "Norway's central bank is expected to cut its policy interest rate twice more this year following last week's surprise reduction in the cost of borrowing from a near 17-year high, a Reuters poll of economists showed on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-24 04:11:27",
      "date": "24/06/2025",
      "time": "04:11",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/norges-bank-expected-cut-rates-twice-more-2025-2025-06-24/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 49.70353535353536
    },
    {
      "title": "Fed taps Horowitz as next inspector general",
      "content": "The Federal Reserve announced on Friday that Michael Horowitz had been appointed to serve as the central bank's new inspector general.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 08:51:27",
      "date": "06/06/2025",
      "time": "08:51",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/fed-seen-no-rush-cut-rates-us-job-market-cools-doesnt-crumble-2025-06-06/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 46.675252525252525
    },
    {
      "title": "Tech stocks, including Apple, were safety trade during Covid, but this market is different",
      "content": "A recent decline in the price of Apple is a marked contrast from 2020 when the tech stock served as a safety trade in an uncertain market. Apple's underperformance doesn't mean tech is not attracting investors, as the sector as a whole has bounced back strongly from this year's big, early selloff.",
      "source": "cnbc.com",
      "rawDate": "2025-06-23 11:27:31",
      "date": "23/06/2025",
      "time": "11:27",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/23/tech-stocks-like-apple-were-covid-safety-trade-but-the-market-changed.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 46.0550505050505
    },
    {
      "title": "Apple executives held internal talks about buying Perplexity, Bloomberg News reports",
      "content": "Apple executives have held internal talks about potentially bidding for artificial intelligence startup Perplexity, Bloomberg News reported on Friday, citing people with knowledge of the matter.",
      "source": "reuters.com",
      "rawDate": "2025-06-20 17:31:55",
      "date": "20/06/2025",
      "time": "17:31",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-executives-held-internal-talks-about-buying-perplexity-bloomberg-news-2025-06-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.58434343434344
    },
    {
      "title": "Fed Governor Waller says central bank could cut rates as early as July",
      "content": "Fed Governor Waller says central bank could cut rates as early as July",
      "source": "cnbc.com",
      "rawDate": "2025-06-20 08:51:04",
      "date": "20/06/2025",
      "time": "08:51",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/20/fed-governor-waller-says-central-bank-could-cut-rates-as-early-as-july.html",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.31565656565657
    },
    {
      "title": "WWDC: Apple faces AI, regulatory challenges as it woos software developers",
      "content": "Apple is facing an unprecedented set of technical and regulatory challenges as some of its key executives are set to take the stage on Monday at the company's annual software developer conference.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:06:09",
      "date": "09/06/2025",
      "time": "06:06",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/wwdc-apple-faces-ai-regulatory-challenges-it-woos-software-developers-2025-06-09/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.28686868686869
    },
    {
      "title": "These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines",
      "content": "Key Points A &#8220;more is better&#8221; approach can help you diversify your portfolio while generating passive income. Five fascinating funds will tempt income seekers with potent yields and strong growth prospects. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Stock picking is fine, but exchange traded funds (ETFs) can enable immediate diversification without sacrificing growth and income opportunities. By selecting multiple funds instead of just one, you can achieve an extra measure of safety while also turning your portfolio into a veritable income-generating machine. The idea is to pick out ETFs with notable distribution yields (i.e., annualized cash payment percentages), but also to focus on a wide variety of funds with share-price growth potential. Now, let&#8217;s drill down on five fabulous ETFs so you can start accumulating shares for your income-machine portfolio today. NEOS NASDAQ-100 High Income ETF (QQQI) The name of the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) might lead you to assume that this fund only offers a hefty yield. There&#8217;s more to the story, though, as the QQQI ETF also enables investors to participate in strong technology-focused growth opportunities. Based on the NASDAQ 100 stock index with approximately 100 holdings, the NEOS NASDAQ-100 High Income ETF includes many large-cap tech names you&#8217;ll surely recognize. Some examples are NVIDIA (NASDAQ:NVDA), Apple (NASDAQ:AAPL), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Broadcom (NASDAQ:AVGO). There&#8217;s no denying that technology giants like Apple and NVIDIA are robust revenue generators. Consequently, the NEOS NASDAQ-100 High Income ETF share price could grow substantially over the long term. At the same time, many investors flock to the QQQI ETF for its eye-catching 13.92% distribution yield. Granted, the fund subtracts an annualized management fee (also known as the expense ratio) of 0.68% from the share price. Still, even after the expense ratio is taken out, investors can look forward to outstanding annual income with the QQQI ETF. Along with that, you&#8217;ll get to participate in the growth prospects of terrific tech titans when you hold the NEOS NASDAQ-100 High Income ETF. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) There&#8217;s another passive income machine that&#8217;s similar to QQQI, but it&#8217;s not identical. Brought to you by famous financier JPMorgan Chase (NYSE:JPM), the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) squeezes extra income from a range of high-confidence technology leaders. Much like the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100 and includes around 100 stocks (108, to be exact). From Microsoft to Apple, Amazon, and many more, you&#8217;ll find plenty of high-growth tech names in JEPQ. There&#8217;s a trade-off with the JPMorgan Nasdaq Equity Premium Income ETF when compared to the NEOS NASDAQ-100 High Income ETF. On the negative side, JEPQ has a rolling 12-month dividend yield of 11.01%, which isn’t as impressive as QQQI&#8217;s 13.92% distribution yield. On the positive side, however, the JPMorgan Nasdaq Equity Premium Income ETF has an annualized expense ratio of 0.35%. This is lower than the NEOS NASDAQ-100 High Income ETF&#8217;s 0.68% annual management fee. Perhaps most importantly, you&#8217;ll have the reassurance that comes with well-established fund management by JPMorgan Chase. Thus, for an interesting alternative to the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF is absolutely worth considering. Schwab U.S. Dividend Equity ETF (SCHD) Maybe you&#8217;re seeking a passive income machine that&#8217;s not as technology-heavy as QQQI and JEPQ. In that case, you&#8217;ll want to check out the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This fund includes has 103 stocks in its portfolio, but SCHD doesn&#8217;t track the NASDAQ 100 index. Instead, the Schwab U.S. Dividend Equity ETF tracks the Dow Jones U.S. Dividend 100 Index. Take a look at the fund’s top 10 holdings and you’ll find some technology firms, such as Cisco Systems (NASDAQ:CSCO) and Texas Instruments (NASDAQ:TXN). Yet, you&#8217;ll also see names from other sectors, including Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), Lockheed Martin (NYSE:LMT), and Conoco Phillips (NYSE:COP). Moreover, the Schwab U.S. Dividend Equity ETF offers a trailing 12-month distribution yield of 3.72% with an annual expense ratio of just 0.06%. The ultra-low management fees allow investors to grow their accounts steadily with the SCHD ETF. Two More Picks for Low Volatility To cap off this list of passive income machine picks, I&#8217;ve got two relatively low-risk funds to show you. First, there&#8217;s an ETF that concentrates on dividend-growing businesses instead of gigantic yield. The Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO) features a 4.81% annual distribution rate but also a 0.56% expense ratio, so the income opportunities are good but not jaw-dropping. On the other hand, DIVO tends to be low-volatility as it holds a diverse array of safe names, such as Home Depot, Visa (NYSE:V), Caterpillar (NYSE:CAT), Microsoft, and Goldman Sachs (NYSE:GS). The Amplify CWP Enhanced Dividend Income ETF emphasizes &#8220;high-quality large cap companies with a history of dividend and earnings growth.&#8221; This approach will typically reduce share-price volatility, so investors can sleep well at night while collecting passive income with DIVO. In a similar vein, the NEOS S&amp;P 500 High Income ETF (BATS:SPYI) is de-risked because it holds well-known large-cap stocks in multiple sectors. Indeed, SPYI might be the least risky fund on this list as it includes approximately 500 stocks in its holdings. Because the NEOS S&amp;P 500 High Income ETF generates income from the S&amp;P 500 index, it is a widely diversified fund. So, there&#8217;s a safety factor built into the SPYI ETF. In addition, the NEOS S&amp;P 500 High Income ETF is an enticing passive income machine with a 12.11% annual distribution rate. The fund&#8217;s 0.68% annual expense ratio isn&#8217;t super-low, but the fees may be justified as SPYI brings high yield and instant diversification to the table. All in all, I like DIVO and SPYI for reduced volatility, SCHD for low management fees, and QQQI and JEPQ for technology-sector exposure.The post These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 13:30:07",
      "date": "03/06/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/03/these-5-etfs-qqqi-jepq-schd-divo-spyi-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.151515151515156
    },
    {
      "title": "These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines",
      "content": "Key Points QQQI, JEPQ, SPYI, and MSTY offer eye-catching yields for ambitious passive income investors. You can try all four of these high-yield ETFs for diversified exposure to a wide range of stocks. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) In recent years, ultra-high-yield exchange traded funds (ETFs) have opened the door to new possibilities for aggressive income harvesters. If you pick your ETFs carefully, you can practically turn your portfolio into a passive income machine. Using high-yield ETFs to generate steady income is a smart strategy, but it takes time and research to build a reliable income machine. So, to save you some of the trouble, I&#8217;ve hand-picked these four fantastic funds with big yields. Furthermore, if you give these four ETFs a try, you can cover different market sectors to diversify your portfolio. NEOS NASDAQ-100 High Income ETF (QQQI) If you&#8217;re on the hunt for tech-sector exposure, big yield, and frequent payouts, look no further. Truly, the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) is an ambitious income investor&#8217;s dream fund. First and foremost, the QQQI ETF offers a huge distribution yield (i.e., the annualized cash payout to your portfolio) of 13.92%. This positions the NEOS NASDAQ-100 High Income ETF among the most generous high-yield funds available today. Plus, there&#8217;s another reason why the QQQI ETF is a dividend achiever. Specifically, the NEOS NASDAQ-100 High Income ETF pays its cash distributions on a monthly basis instead of making you wait three months for the next payout. Granted, you&#8217;ll have to pay an expense ratio, which is the annualized management fee that&#8217;s automatically deducted from the fund&#8217;s share price. When it comes to the NEOS NASDAQ-100 High Income ETF, the expense ratio is 0.68%, which is slightly high but not outrageous. Just as importantly, the NEOS NASDAQ-100 High Income ETF invests in components of the technology-heavy NASDAQ 100 index. With roughly 100 holdings, the QQQI ETF includes well-established tech winners like Apple (NASDAQ:AAPL), NVIDIA (NASDAQ:NVDA), Broadcom (NASDAQ:AVGO), Amazon (NASDAQ:AMZN), and Meta Platforms (NASDAQ:META). In other words, the NEOS NASDAQ-100 High Income ETF isn&#8217;t only a passive income powerhouse with a sizable yield. It&#8217;s also an easy way to diversify your portfolio across dozens of tech-market standouts, and this can add an extra layer of safety. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) In some ways, the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) is similar to the NEOS NASDAQ-100 High Income ETF. Yet, with the JEPQ ETF you&#8217;ll get the peace of mind that comes with prestigious management from financial giant JPMorgan Chase (NYSE:JPM). Like the NEOS NASDAQ-100 High Income ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100. JEPQ has 108 stocks in its holdings, and the fund is strongly weighted toward large-cap technology stocks (Apple, Amazon, Microsoft, and so on). Also, just like the QQQI ETF, the JEPQ ETF pays out its distributions on a monthly basis. However, the JPMorgan Nasdaq Equity Premium Income ETF has a rolling 12-month dividend yield of 11.01%, which isn&#8217;t quite as high as the NEOS NASDAQ-100 High Income ETF&#8217;s gigantic 13.92% distribution yield. On the other hand, the JPMorgan Nasdaq Equity Premium Income ETF brings you active management from the one and only JPMorgan Chase. That&#8217;s a safety feature to consider, and the fund&#8217;s expense ratio is only 0.35%. Therefore, you might consider leveraging the expertise of a legendary asset manager with the comparatively low-fee JEPQ ETF. NEOS S&amp;P 500 High Income ETF (SPYI) Mind you, I didn&#8217;t turn my portfolio into a passive income machine by only investing in NASDAQ 100 based funds. Indeed, I diversified my holdings even further with a very broad-based fund known as the NEOS S&amp;P 500 High Income ETF (BATS:SPYI). Like QQQI and JEPQ, SPYI pays out its distributions each and every month. Yet, unlike those other two funds, the NEOS S&amp;P 500 High Income ETF is based on the S&amp;P 500 rather than the NASDAQ 100. With around 500 stocks in its holdings, the NEOS S&amp;P 500 High Income ETF is more diversified than QQQI and JEPQ. You&#8217;ll get exposure to tech names like Apple and NVIDIA with the SPYI ETF, but you&#8217;ll also participate in the growth of non-technology-sector businesses like Coca-Cola (NYSE:KO), Bank of America (NYSE:BAC), Home Depot (NYSE:HD), and Occidental Petroleum (NYSE:OXY). For active management and the enhanced safety that comes with wide portfolio breadth, the NEOS S&amp;P 500 High Income ETF charges an expense ratio of 0.68%. However, the fund&#8217;s hefty 12.11% annual distribution rate more than makes up for the management fees, so SPYI is a great choice for monthly income seekers. YieldMax MSTR Option Income Strategy ETF (MSTY) Finally, after focusing on safety and diversification with the first three ETFs, now we can ramp up the risk-and-reward profile with a fourth fund. I&#8217;m referring to an aggressive but fascinating fund known as the YieldMax MSTR Option Income Strategy ETF (NYSEARCA:MSTY). You won&#8217;t get much diversification with the YieldMax MSTR Option Income Strategy ETF. Instead, you&#8217;ll get an annual expense ratio of 0.99% and an eye-watering distribution rate of 143.11%. The fund achieves this through actively trading U.S. Treasury bonds and options on Microstrategy (NASDAQ:MSTR) stock. As you may be aware, Microstrategy stock is volatile and involves a great deal of risk. You&#8217;ll get sizable monthly distributions with MSTY, but a downturn in MSTR stock could be problematic for your portfolio. Because this fund is very risky, my passive income machine only includes a few shares of the YieldMax MSTR Option Income Strategy ETF. For a more favorable safety-and-yield mix, consider taking a larger position in SPYI, a smaller stake in QQQI and JEPQ, and a tiny position in MSTY.The post These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 10:04:43",
      "date": "03/06/2025",
      "time": "10:04",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/02/these-4-dividend-etfs-qqqi-jepq-spyi-msty-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.74242424242424
    },
    {
      "title": "My Top 3 ETF’s I Would Put $10,000 In Today",
      "content": "Key Points Looking for high-yield ETFs? These three popular ETFs will never disappoint you. Each ETF is highly diversified, low-cost, low risk and pays steady dividends. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Market volatility in 2025 has driven investors towards safer assets like exchange-traded funds (ETFs). By investing in ETFs, you not only build a highly diversified portfolio but also generate steady income and hold some of the top companies. You do not have to pick individual stocks to make money. ETFs are a low-cost option of investing in stocks and they reduce company-specific risks. If you’re looking for the best ETFs to invest in this year, I’ve identified 3 where I’d put my $10,000 today. Since no two funds are equal, you need to weigh each based on your personal financial goals and risk appetite. JP Morgan Equity Premium ETF The J.P. Morgan Equity Premium Income ETF (NYSEARCA:JEPI) is a covered call ETF that invests in the top S&amp;P 500 stocks. These stocks are known for little risk and steady returns. It offers a monthly payout and invests in the top U.S. blue-chip companies. The ETF enjoys an attractive 30-day SEC yield of 11.38% and holds 126 stocks. Since it is a covered call ETF, the fund buys stocks and then sells call options on them, this gives the buyers a chance to make a profit. While investors get a share in some profits, most are drawn to the high dividend yield. JEPI has an expense ratio of 0.35% and its NAV is $56.04. The ETF has remained flat in the year but the dividend yield makes it worth a consideration. Since it owns elite names and holds dividend-paying companies, it ensures a steady income for investors. Its holdings include: Information Technology: 15.8% Financials: 13% Industrials: 12.8% Healthcare: 11.3% The ETF also owns some of the Magnificent Seven, namely, Nvidia, Microsoft, and Tesla. None of the stocks have a weightage higher than 2%. Despite investing the majority of the funds in the tech sector, JEPI reduces the sector-specific risks with its highly diversified portfolio. Even if the ETF moves sideways in the short term, investors can benefit from the steady passive income. Schwab U.S. Dividend Equity ETF If you are looking for a fund that is not tech-heavy, the Schwab U.S. Dividend ETF (NYSEARCA:SCHD) is a smart choice. The fund offers the potential for income and growth. It holds 103 stocks and tracks the Dow Jones U.S. Dividend 100 index. It has an expense ratio of 0.06% and a 30-day SEC yield of 3.81%. While the ETF has a slightly lower dividend yield, it offers capital appreciation. The NAV of the fund is $26.90 and it is up 4.38% in 12 months and over 50% in five years. The fund holdings include: Energy: 21.08% Consumer staples: 19.06% Healthcare: 15.68% Industrials: 12.45% None of the stocks in the ETF have a weightage higher than 5% and the top holdings include popular names like Cisco, ConocoPhillips, Texas Instruments, Coca-Cola, and Chevron Corporation. These are some of the dividend-paying companies. If you’re a passive income investor looking for a low-risk investment option, SCHD is a great choice. The ETF offers a wide range of top-quality dividend stocks to help build your passive income portfolio. SCHD isn’t tech-heavy, meaning you do not have to worry about your returns during volatility. The highly diversified portfolio owns elite names and pay quarterly dividends. JP Morgan Nasdaq Equity Premium Income ETF The JP Morgan Nasdaq Equity Premium Income ETF (NASDAQ: JEPQ) invests in the Nasdaq 100 and holds stocks that have little volatility. It holds 108 stocks and has a 30-day SEC yield of 14.47%. JEPQ has an expense ratio of 0.35% and focuses heavily on tech. The fund holdings include: Information technology: 42.4% Other: 16.5% Communication services: 12.9% Consumer discretionary: 12.1% I believe that the future is tech and by investing in JEPQ, it is possible to reduce the company-specific risks while holding the top tech giants like Nvidia, Apple, Tesla, and Microsoft. The top 10 stocks in the fund form 44.34% of the portfolio and these are tech companies except for Costco. The tech sector has rallied in the past and once the economy improves, we could see it pick pace again. JEPQ has an NAV of $52.59 and is down 4.87% in 12 months. Since the fund focuses on high yield, the capital appreciation could be limited. However, I believe the fund has the potential to keep rewarding investors with a solid yield. JEPI and JEPQ both have a solid dividend yield and the fund is handled by the experts at JP Morgan, making it low-risk and highly reliable. JEPQ pays monthly dividends and offers a balanced portfolio of elite heavyweights. The low-stress ETF is one of the best placess to invest $10,000 today. The post My Top 3 ETF&#8217;s I Would Put $10,000 In Today appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/16/my-top-3-etfs-i-would-put-10000-in-today/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.303030303030305
    },
    {
      "title": "Why Wall Street downgrades of Apple stock are about to pile up",
      "content": "Most company analysts play it safe rather than risk their reputation — and possibly their career.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-29 07:45:00",
      "date": "29/05/2025",
      "time": "07:45",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/why-wall-street-downgrades-of-apple-stock-are-about-to-pile-up-241a2978",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.14823232323232
    },
    {
      "title": "HEDGE FLOW Hedge fund leverage reaches five-year high, buying bank stocks, Goldman Sachs says",
      "content": "Hedge fund leverage hit a five-year high last week, with speculators buying banks, trading companies and insurance firms, Goldman Sachs data showed, after U.S. interest rates held steady and just before U.S. attacks on Iran's nuclear sites.",
      "source": "reuters.com",
      "rawDate": "2025-06-23 04:52:44",
      "date": "23/06/2025",
      "time": "04:52",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-fund-leverage-reaches-five-year-high-buying-bank-stocks-goldman-2025-06-23/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.484848484848484
    },
    {
      "title": "Explainer: What are bitcoin treasury strategies, the latest trend in the public markets?",
      "content": "Certain public companies, including one founded by President Donald Trump, have been going on a cryptocurrency buying spree, capitalizing on higher token prices and a softening regulatory environment to load up on the attention-grabbing investment.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 06:04:33",
      "date": "16/06/2025",
      "time": "06:04",
      "category": "crypto",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/what-are-bitcoin-treasury-strategies-latest-trend-public-markets-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "finance",
          "crypto"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.355555555555554
    },
    {
      "title": "Tariffs Likely to ‘Weigh on Economic Activity' Fed Chair Says",
      "content": "The Federal Reserve wants more time to study the impact of tariffs before cutting rates. [contact-form-7] That's according to Jerome Powell, the central bank's chair, testifying Tuesday (June 24) that the Fed needs to see if tariffs push inflation higher before deciding on the interest rate cuts that President Donald Trump has demanded.",
      "source": "pymnts.com",
      "rawDate": "2025-06-24 16:56:39",
      "date": "24/06/2025",
      "time": "16:56",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.pymnts.com/economy/2025/tariffs-likely-to-weigh-on-economic-activity-fed-chair-says/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.78737373737374
    },
    {
      "title": "Goldman Sachs pares risk after tariff move, braces for more uncertainty",
      "content": "Goldman Sachs has moderated its risk-taking since U.S. President Donald Trump's April tariff announcement, and the Wall Street bank is braced for more uncertainty, a top executive said.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 09:24:52",
      "date": "05/06/2025",
      "time": "09:24",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/goldman-sachs-pares-risk-after-tariff-move-braces-more-uncertainty-2025-06-05/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.66540404040404
    },
    {
      "title": "Apple's WWDC is a chance to change investors' minds. Can the company deliver?",
      "content": "Apple's stock has been dogged by concerns that the company is behind the curve on AI.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-07 08:00:00",
      "date": "07/06/2025",
      "time": "08:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-wwdc-is-a-chance-to-change-investors-minds-can-the-company-deliver-fead8681",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.56944444444444
    },
    {
      "title": "Wall Street's potential winners and losers from Trump's tax bill",
      "content": "As President Donald Trump's sweeping tax-cut and spending bill heads to the Senate, analysts examine how his broad-ranging policies could turn the fortunes of U.S. companies if the package is enacted as law.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 09:18:12",
      "date": "05/06/2025",
      "time": "09:18",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/autos-transportation/wall-streets-potential-winners-losers-trumps-tax-bill-2025-06-05/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.51439393939394
    },
    {
      "title": "Dutch government supports NATO spending target of 5% of GDP",
      "content": "The Dutch caretaker government is in favour of increasing the country's defence spending to a total of 5% of gross domestic product, in line with a target set by NATO, Defence Minister Ruben Brekelmans said on Friday.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 09:39:31",
      "date": "13/06/2025",
      "time": "09:39",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/aerospace-defense/dutch-government-supports-nato-spending-target-5-gdp-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "defense",
          "consumer",
          "transport"
        ],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.39065656565656
    },
    {
      "title": "Materials Down as Fed Warns on Inflation -- Materials Roundup",
      "content": "Producers of metals and other raw materials fell after the Federal Reserve left interest rates unchanged and indicated that rate cuts in the coming year would be modest in scale.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-18 17:28:00",
      "date": "18/06/2025",
      "time": "17:28",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/materials-down-as-fed-warns-on-inflation-materials-roundup-33266de0",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.34292929292929
    },
    {
      "title": "Fed's Waller Suggests Support for a July Cut",
      "content": "Federal Reserve governor Christopher Waller said the central bank could be positioned to cut interest rates at its next meeting in July, notwithstanding potential inflation pressures caused by new tariffs.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-20 09:34:00",
      "date": "20/06/2025",
      "time": "09:34",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/fed-s-waller-suggests-support-for-a-july-cut-9931a156",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 36.90277777777777
    },
    {
      "title": "Apple: Much, Much Cheaper Than It Looks (Rating Upgrade)",
      "content": "With more than $100 billion in annual sales and gross margins around the 75% mark, Apple's services segment is being categorically undercounted by the market. If this segment can produce ~5% revenue growth in each of the next three years, then estimates appear too low. This makes the stock appear much cheaper than previously thought. Trading at roughly 19x 2028 earnings, we think shares of AAPL appear highly attractive, and deserve an upgrade to 'Buy'.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-28 13:28:44",
      "date": "28/05/2025",
      "time": "13:28",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4790550-apple-much-much-cheaper-than-it-looks-rating-upgrade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.96363636363636
    },
    {
      "title": "Wall Street fears foreign tax in budget bill may reduce allure of US assets",
      "content": "Wall Street analysts are cautioning that a tax targeting foreign investors in the U.S. budget bill progressing through Congress could end up weighing on demand for U.S. Treasuries and the dollar.",
      "source": "reuters.com",
      "rawDate": "2025-05-29 17:51:56",
      "date": "29/05/2025",
      "time": "17:51",
      "category": "companies",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/wall-street-fears-foreign-tax-budget-bill-may-reduce-allure-us-assets-2025-05-29/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.31439393939394
    },
    {
      "title": "Apple sued by shareholders over AI disclosures",
      "content": "Apple was sued by shareholders in a proposed class action on Friday, accusing it of downplaying the time needed to integrate advanced artificial intelligence-based features into its Siri assistant, hurting iPhone sales and its stock price.",
      "source": "reuters.com",
      "rawDate": "2025-06-20 14:28:57",
      "date": "20/06/2025",
      "time": "14:28",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-sued-by-shareholders-over-ai-disclosures-2025-06-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.55782828282828
    },
    {
      "title": "US declares Biden fuel economy rules exceeded legal authority",
      "content": "The U.S. Transportation Department on Friday declared that fuel economy rules issued under then President Joe Biden exceeded the government's legal authority by including electric vehicles in setting the rules, automaker officials said Monday.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 08:17:27",
      "date": "06/06/2025",
      "time": "08:17",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/energy/us-declares-biden-fuel-economy-rules-exceeded-legal-authority-2025-06-06/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.52348484848485
    },
    {
      "title": "US job growth cools in May amid tariff-related headwinds",
      "content": "Economists say President Donald Trump's flip-flopping on import tariffs has hampered businesses' ability to plan ahead and hire more workers.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 08:34:35",
      "date": "06/06/2025",
      "time": "08:34",
      "category": "companies",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/us/us-job-growth-slows-may-unemployment-rate-steady-42-2025-06-06/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.08863636363636
    },
    {
      "title": "The Fed's hand will be held 'for quite a while' before contemplating rate cuts: Roger Ferguson",
      "content": "Former Federal Reserve Vice Chairman Roger Ferguson joins 'Squawk Box' to discuss the state of the economy, the Fed's interest rate decision, what it'll take for the central bank to cut rates, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 07:33:43",
      "date": "20/06/2025",
      "time": "07:33",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=i2cLnXAC4XI",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 33.40959595959596
    },
    {
      "title": "Israel-Iran conflict poses three challenges for stocks that could slam market by up to 20%, warns RBC",
      "content": "Spiking oil prices may muddle the Federal Reserve's inflation forecasts",
      "source": "marketwatch.com",
      "rawDate": "2025-06-16 06:26:00",
      "date": "16/06/2025",
      "time": "06:26",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.marketwatch.com/story/israel-iran-conflict-poses-three-challenges-for-stocks-that-could-slam-market-by-up-to-20-warns-rbc-5a98425d",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.19722222222222
    }
  ],
  "france": [
    {
      "title": "OECD Slashes Global Economic Forecasts Amid Tariffs, Trade Uncertainty",
      "content": "OECD Chief Economist Alvaro Santos Pereira discusses the Paris-based organization's decision to slash its global economic growth forecast to 2.9% this year, down from 3.3% in 2024. \"There's been a huge increase in trade and economic policy uncertainty,\" he tells Bloomberg Television.",
      "source": "youtube.com",
      "rawDate": "2025-06-03 05:40:39",
      "date": "03/06/2025",
      "time": "05:40",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=E-sUVQdcV3A",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.91010101010101
    },
    {
      "title": "Best Stock to Buy Right Now: Apple vs. Chipotle",
      "content": "It might seem like a strange comparison to pit Apple (AAPL 0.76%) and Chipotle Mexican Grill (CMG 0.91%) against each other, but these are two companies that are very popular among investors. While both face certain headwinds from things like tariffs and a bit of consumer uncertainty, I'm going to throw a real zinger out there, and call Chipotle the better investment at this time.",
      "source": "fool.com",
      "rawDate": "2025-05-31 10:00:00",
      "date": "31/05/2025",
      "time": "10:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.fool.com/investing/2025/05/31/best-stock-to-buy-right-now-apple-vs-chipotle/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.988131313131312
    },
    {
      "title": "Stock Markets Plagued by Uncertainty Amid Iran, Israel, Fed Fears. One Thing Is Inevitable.",
      "content": "Oil markets on edge, Trump heads to G-7 summit, the Paris Air Show, and more news to start your day.",
      "source": "barrons.com",
      "rawDate": "2025-06-16 06:43:00",
      "date": "16/06/2025",
      "time": "06:43",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.barrons.com/articles/stock-market-uncertainty-oil-things-to-know-today-6892222c",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 13.035353535353536
    },
    {
      "title": "OECD chops U.S. growth forecasts, cites risks to the downside as tariffs bite",
      "content": "The Paris-based global policy forum now sees U.S. growth at just 1.6% this year, and global growth at 2.9%.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-03 05:02:00",
      "date": "03/06/2025",
      "time": "05:02",
      "category": "economy",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/oecd-chops-u-s-growth-forecasts-cites-risks-to-the-downside-as-tariffs-bite-42be736c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 10.130555555555556
    }
  ],
  "uk": [
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Broader Market Recaptures 6000 Level in Mixed Session",
      "content": "Live Updates Live Coverage Has Ended Corporate America Turns Positive on Economy 12:52 pm by Gerelyn Terzo In Chief Executive Group&#8217;s latest poll, taken a week ago, under 30% of CEOs anticipate a mild or severe recession in H2 2025. This is a significant shift from April, when over 60% held that view, a time when tariffs had businesses more concerned. The SPY is now up 0.23%. Cooling Inflation 11:12 am by Gerelyn Terzo The New York Fed Survey of Consumer Expectations index indicated cooling inflation in May, dropping 0.4 percentage points from April to settle at 3.2%. This decline comes as the Trump administration made strides with U.S. trade partners. The SPY ETF is up 0.11% at last check. Bearish on MCD 10:30 am by Gerelyn Terzo Morgan Stanley has turned cautious on fast-food giant McDonald’s (NYSE: MCD), downgrading the stock to an “equal weight” rating from “overweight,&#8221; saying the company is vulnerable to “structural pressures on fast food.” The analyst lowered the price target on MCD to $324 per share, which still reflects upside potential. MCD stock is down 2% today to trade at $301 per share. This article will be updated throughout the day, so check back often for more daily updates. The S&amp;P 500 is trading back above the psychologically sensitive 6,000 level once again as the markets keep it together. U.S. and Chinese officials are expected to restart trade discussions in Europe today. Big Tech&#8217;s Apple (Nasdaq: AAPL) is gearing up for its developer conference, WWDC, today, featuring a keynote speech from CEO Tim Cook. The markets are awaiting any advancements on AI innovation. After starting the trading session higher out of the gate, the three major stock market averages have turned mixed. While the S&amp;P 500 and Nasdaq Composite are holding onto slight gains, the Dow Jones Industrial Average has turned modestly lower. The SPDR S&amp;P 500 ETF (SPY) is up 0.15%). Chip stocks are higher, including a 3.4% gain in Advanced Micro Devices (Nasdaq: AMD). Magnificent 7 stock Tesla (Nasdaq: TSLA) is under pressure, falling 3.9%. Analysts turned skeptical on the EV stock, citing distractions stemming from tensions between CEO Elon Musk and President Trump. On the economic front, key inflation data is anticipated mid-week with the release of the Consumer Price Index and Producer Price Index results for May. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 117.74 (-0.28%) Nasdaq Composite: Up 86.85 (+0.42%) S&amp;P 500: Up 5.19 (+0.09%) Market Movers Meta Platforms (Nasdaq: META) is reportedly in talks to invest over $10 billion in AI startup Scale AI, per Bloomberg. Archer Aviation (NYSE: ACHR) is climbing 5% higher today as its piloted flight program picks up speed in both the U.S. and UAE. Quantum computing stock IonQ (NYSE: IONQ) advanced 3% after revealing a billion-dollar deal to acquire London-based Oxford Ionics. The post S&#038;P 500 (NYSEARCA: SPY) Live: Broader Market Recaptures 6000 Level in Mixed Session appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-10 11:04:10",
      "date": "10/06/2025",
      "time": "11:04",
      "category": "crypto",
      "impact": "negative",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/09/sp-500-nysearca-spy-live-sp-500-recaptures-6000-level-in-mixed-session/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 41.015151515151516
    },
    {
      "title": "Trump’s Fellow College Alumni is Quite The List",
      "content": "The 45th and 47th President of the United States, Donald Trump, is famously known for attending the University of Pennsylvania. Having started his college career at Fordham University, the president left Fordham after two years and went on to earn a degree from the University of Pennsylvania, a prestigious Ivy League institution. Key Points The President of the United States attended one of the nation’s most prestigious universities. The president isn’t the only famous graduate to have attended this school. Titans of industry and even a famous game maker are all graduates of the same school that the president attended. 4 million Americans are set to retire this year. If you want to join them, click here now to see if you’re behind, or ahead. It only takes a minute. (Sponsor) If you’re already familiar with the University of Pennsylvania, you know that the Wharton School, where the president graduated, is famously difficult to get into. This is considered one of the nation&#8217;s best business schools, and the president is far from being the only notable graduate. 20. Ivanka Trump Ivanka Trump, an American businesswoman, is the second-oldest child of President Donald Trump. A senior advisor in her father’s first administration, Ivanka also served as a boardroom judge on her father’s show, The Apprentice. She now serves as an executive vice president of the Trump Organization. 19. Donald Trump Jr. The firstborn son of the president, Donald Trump Jr., currently serves as an executive vice president of the Trump Organization. Running the company alongside his brother, Eric, Trump graduated from the Wharton School in 2000 with a Bachelor of Science in Economics. 18. Ron Perelman Investor, banker, businessman, and philanthropist are just a few of the words to describe Ron Perelman. Graduating from the University of Pennsylvania with an MBA, Perelman has held or currently holds positions in companies such as Revlon, RetailMeNot, Valassis, Scientific Games Corporation, and others. 17. Alex Gorsky Serving as the CEO of Johnson &amp; Johnson since 2012, Alex Gorsky graduated from Wharton in 1996. In addition to his role at J&amp;J, Gorsky serves as a board director at Apple and JP Morgan Chase, and spoke at the school’s 2022 MBA graduation ceremony. 16. Mark Pincus Mark Pincus, the man responsible for the Farmville craze during Facebook&#8217;s early days, is the founder of Zynga. One of the world’s best-known mobile social gaming companies, Pincus left his role in 2016. Pincus would later go on to co-found an investment firm with investments in companies such as Lyft, SpaceX, and Oscar Health. 15. Laurene Powell Jobs Billionaire and philanthropist Laurene Powell Jobs is the widow of Steve Jobs, former co-founder and CEO of Apple. Managing the Steve Jobs Trust, Jobs graduated from the University of Pennsylvania in 1985 and later founded the Emerson Collective, which she uses to support organizations like The Atlantic and Axios. Powell also owns a 20% stake in Monumental Sports &amp; Entertainment, which owns multiple sports teams. 14. Brian L. Roberts Brian L. Roberts, the chairman and CEO of Comcast, is an American businessman and billionaire. Attending school at the University of Pennsylvania, not too far away from where he was born, Roberts took over Comcast from his father. He was named the president of Comcast in 1990 and became CEO in 2002. Julian A. Brodsky, Robert’s father’s partner in founding Comcast, also attended the Wharton School. 13. Mort Zuckerman Mort (Moritmer) Zuckerman, the owner of Boston Properties, one of the world&#8217;s largest real estate investment trusts, is another MBA graduate of the University of Pennsylvania. He currently owns the U.S. News &amp; World Report, having previously owned The Atlantic and Fast Company. 12. Josh Harris Josh Harris, the founder of private equity firm Apollo Global Management, is one of the world’s wealthiest individuals. He currently has ownership stakes in the Philadelphia 76ers basketball team, the New Jersey Devils hockey team, and the NFL’s Washington Commanders. Harris holds an economics degree from the Wharton School, which he earned in 1986. 11. Steve Cohen Graduating with an economics degree from the Wharton School, Steve Cohen is a billionaire businessman. The owner of the New York Mets baseball team, Cohen, is the founder of S.A.C. Capital Advisors. Cohen famously played a role in supporting Ken Griffin’s Citadel short squeeze of GameStop with Gabe Plotkin. According to Forbes, Cohen has a current net worth of $21.3 billion. 10. Robert Crandall Widely regarded as the creator of the frequent flyer program, Robert Crandall was the former president and chairman of American Airlines. Considered a titan of the industry, Crandall created the AAdvantage program, which was the first major mileage-reward frequent flyer program in the airline industry. 9. Edmund T. Pratt Jr. Edmund T. Pratt Jr., the former Chairman and CEO of Pfizer Inc., served as CEO from 1972 to 1991 and as Chairman until 1992. An MBA graduate of the University of Pennsylvania, Pratt played a pivotal role in transforming Pfizer into a global pharmaceutical giant. Under his leadership, annual revenue increased from $1 billion to nearly $7 billion. 8. Elon Musk The current world’s wealthiest person, Elon Musk, is everywhere and seemingly has his hand in everything. As of June 2025, Elon Musk has an estimated net worth of approximately $409 billion, making him one of the wealthiest individuals in recorded history. The CEO of Tesla, SpaceX, and xAI, Musk, was an initial big player in the President’s current administration, overseeing the DOGE office before stepping away. 7. William Wrigley Jr. II The former chairman and CEO of William Wrigley Jr. Company, William Wrigley Jr. II, is the great-grandson of the company founder. Receiving his undergraduate degree from Duke, Wrigley received his MBA from the University of Pennsylvania. The company secured Altoids and Life Savers during his tenure, before selling them to Mars Candy for $23 billion, earning himself an estimated $3 billion. 6. Sundar Pichai An MBA graduate in 2002, the current CEO of Alphabet, Sundar Pichai, received his degree from the University of Pennsylvania. Joining Google in 2004, he was appointed as the company&#8217;s CEO after Eric Schmidt stepped down in 2015. Among his notable contributions, Pichai has played a key role in the development of Gmail, Google Maps, Google Drive, Chrome OS, and Google Chrome. 5. Anil Ambani An Indian billionaire, Anil Ambani, is the chairman and managing director of the Reliance Group, one of India’s most notable corporations. His net worth as of early June 2025 is estimated to be around $3 billion. At one point, Ambani was ranked as the sixth wealthiest person in the world, having received his MBA from the University of Pennsylvania. 4. Peter Lynch One of the most prolific investors of the modern day, Peter Lynch, a Wharton School MBA graduate, previously managed the Magellan Fund. A fund held by Fidelity Investments, Lynch famously averaged a 29.2% annual return between 1977 and 1990. During this time at the company, Lynch increased assets under management from $18 million to $14 billion. 3. John Sculley The man best known for firing Steve Jobs from Apple, John Sculley, attended the University of Pennsylvania. Famously leaving his role as the President of PepsiCo to take on the CEO role at Apple in 1983, Sculley stayed with the company for 10 years. For a time, Sculley was Silicon Valley’s highest-paid executive, earning $10.2 million annually. 2. JD Power James David Power III, another famous graduate of the University of Pennsylvania, also attended the Wharton School, earning an MBA in Finance. After joining Ford Motor Company, J.D. Power would go on to launch J.D. Power and Associates in 1968. Today, J.D. Power is a leading analytics firm that tracks trends across various industries, including automobiles, financial services, telecommunications, and many others. 1. President Donald Trump Starting at Fordham University in 1964, the president stayed at the school for two years before transferring to the University of Pennsylvania in 1966. After graduation, Trump famously went on to extend his father’s real estate empire, open up numerous businesses, host a popular TV show, and, of course, ascend to the highest office in the land. The post Trump&#8217;s Fellow College Alumni is Quite The List appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-23 10:00:07",
      "date": "23/06/2025",
      "time": "10:00",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/education/2025/06/22/the-college-where-trump-graduated-and-its-other-famous-graduates/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 36.92424242424242
    },
    {
      "title": "U.S.-China agree on framework to implement Geneva trade consensus after second day of London talks",
      "content": "The U.S. and China have reached consensus on trade, representatives from both sides said after high-level talks in London, according to an NBC transcript.",
      "source": "cnbc.com",
      "rawDate": "2025-06-10 20:01:32",
      "date": "10/06/2025",
      "time": "20:01",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.cnbc.com/2025/06/11/us-china-agree-on-framework-to-implement-geneva-trade-consensus-.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.897474747474746
    },
    {
      "title": "'Trade wars have only losers,' former Fed vice chair says",
      "content": "Trade tensions are back in focus as US officials meet with Chinese counterparts in London. Princeton University professor of economics and public affairs and former Federal Reserve vice chair Alan Blinder joins Market Domination Overtime with Josh Lipton and Julie Hyman to explain why he believes \"everybody's losing\" in a trade war and share what he makes of Trump's tariff threats.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 18:57:18",
      "date": "09/06/2025",
      "time": "18:57",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=6Mx_A0c654I",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 25.293939393939393
    },
    {
      "title": "US stocks open in the red: Dow Jones slips 240 points, Nasdaq slips 0.3%",
      "content": "US stocks fell Thursday after President Donald Trump warned he could impose unilateral tariffs on trading partners within two weeks, rattling investor sentiment. The Dow Jones Industrial Average dropped 246 points, or nearly 0.6%, weighed down by a sharp decline in Boeing shares.",
      "source": "invezz.com",
      "rawDate": "2025-06-12 09:53:55",
      "date": "12/06/2025",
      "time": "09:53",
      "category": "markets",
      "impact": "negative",
      "country": "uk",
      "url": "https://invezz.com/news/2025/06/12/us-stocks-open-in-the-red-dow-jones-slips-240-points-nasdap-slips-0-3/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.95959595959596
    }
  ],
  "germany": [
    {
      "title": "ECB's Schnabel sees no lasting decoupling from Fed",
      "content": "Ongoing trade tensions between the United States and the rest of the world are a shock to the entire global economy, meaning the Federal Reserve's and the European Central Bank's monetary policies are unlikely to diverge for long, ECB board member Isabel Schnabel said on Saturday.",
      "source": "reuters.com",
      "rawDate": "2025-06-07 06:35:36",
      "date": "07/06/2025",
      "time": "06:35",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ecbs-schnabel-sees-no-lasting-decoupling-fed-2025-06-07/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 54.795707070707074
    },
    {
      "title": "ECB should watch out for price hikes from U.S. tariffs, Schnabel says",
      "content": "The European Central Bank has made \"great progress\" in taming inflation but it should watch out for fresh price hikes caused by U.S. tariffs, ECB policymaker Isabel Schnabel said on Saturday.",
      "source": "reuters.com",
      "rawDate": "2025-06-07 10:41:35",
      "date": "07/06/2025",
      "time": "10:41",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ecb-should-watch-out-price-hikes-us-tariffs-schnabel-says-2025-06-07/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 50.12146464646465
    },
    {
      "title": "ECB should not 'overreact' if inflation edges below 2%, Vujcic says",
      "content": "The European Central Bank should not \"overreact\" to euro-zone inflation edging below its 2% target as there are good reasons to believe it will come back up, ECB policymaker Boris Vujcic told Reuters.",
      "source": "reuters.com",
      "rawDate": "2025-06-08 02:09:26",
      "date": "08/06/2025",
      "time": "02:09",
      "category": "economy",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ecb-should-not-overreact-if-inflation-edges-below-2-vujcic-says-2025-06-08/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 50.08585858585859
    },
    {
      "title": "Euro zone inflation falls to cooler-than-expected 1.9% in May, below ECB target",
      "content": "Economists polled by Reuters had been expecting the May reading to come in at 2%, which is the European Central Bank's target.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 05:04:56",
      "date": "03/06/2025",
      "time": "05:04",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/03/euro-zone-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.74393939393939
    },
    {
      "title": "Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Bonds on Sale 1:19 pm The Treasury&#8217;s auction of 5-year notes has concluded. Paying 4% interest, the $70 billion in notes sold at an average yield of 4.07%, indicating a small 1.7% discount to face value. At the Right Price, Investors Still Love T-Bills 11:52 am $70 billion worth of 5-year Treasury notes are about to go on auction, and demand looks healthy even as yields rise. (Which makes sense. Higher yields imply lower prices, and everybody likes a bargain, even when we&#8217;re talking about U.S. government debt). 2-year Treasuries went on sale yesterday, and demand was described similarly as &#8220;solid.&#8221; The Dow is still down 0.3%. Apple and iPhones in Focus 11:17 am Dow component company Apple (Nasdaq: APPL) is in focus today as Loop Capital analyst Ananda Baruah reiterates a hold rating and $215 price target on the tech stock. &#8220;Tariff actions&#8221; are pulling demand for iPhones forward into the March and June quarters as investors hedge against the risk President Trump is serious about imposing 25% tariffs on imported iPhones. Further out, the analyst is looking ahead to the expected iPhone 17 launch. Apple has raised its estimates for iPhone 17 shipments in Q4, and iPhone average selling prices are also moving higher. Apple stock is up about 0.5% today. But the Dow Jones Industrial Average has turned red, now down 0.3%. This article will be updated throughout the day, so check back often for more daily updates. President Trump alarmed investors last week when he threatened to impose a 50% tariff on imports from the European Union as early as June 1. On Monday, the President backtracked, saying the tariffs won&#8217;t actually go into effect until July 9. Even more optimistically, he confirmed efforts are afoot to &#8220;quickly establish meeting dates&#8221; with EU negotiators to lower tariff barriers and &#8220;open up the European Nations for Trade with the United States of America.&#8221; In more troubling news, there&#8217;s trouble brewing at the White House today as Elon Musk, who spearheaded President Trump&#8217;s Department of Government Efficiency (DOGE) efforts, says he&#8217;s &#8220;disappointed&#8221; with &#8220;the massive spending bill&#8221; that the President sent to Congress last week, and that the House of Representatives has now passed. The bill, says Musk, &#8220;increases the budget deficit&#8221; and &#8220;undermines the work that the Doge team is doing.&#8221; Not good. Nevertheless, after soaring 700 points yesterday, the Dow Jones Industrial Average (DJINDICES: ^DJI) is up another 65 points today for a nearly 0.2 % gain. Earnings Abercrombie &amp; Fitch (NYSE: ANF) reported an earnings beat today, $1.59 per share earned in Q1, which was $0.20 better than expected. The retail clothing chain stock is up nearly 27% currently. Macy&#8217;s (NYSE: M) &#8220;beat earnings by a penny,&#8221; reporting $0.16 per share in Q1 profit. Macy&#8217;s stock is down almost 4%. Both companies cut guidance after reporting their beats. Abercrombie predicts it will earn between $9.50 and $10.50 this year. Macy&#8217;s says full year earnings will range from $1.60 to $2. Both earnings ranges are broadly below analyst forecasts, implying no more earnings beats this year. Dick&#8217;s Sporting Goods (NYSE: DKS) meanwhile reported $3.37 per share this morning. The number beat analyst forecasts. Even better, guidance at Dick&#8217;s calls for $13.80 to $14.40 per share earned this year. At the midpoint, that&#8217;s less than Wall Street&#8217;s forecast $14.34, but the &#8220;$14.40&#8221; number at least implies there&#8217;s a chance Dick&#8217;s will beat estimates this year. The post Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-28 14:06:21",
      "date": "28/05/2025",
      "time": "14:06",
      "category": "crypto",
      "impact": "positive",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/05/28/dow-jones-live-update-may-28-dow-jones-industrial-average-dji-opens-higher/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.333333333333336
    },
    {
      "title": "Ireland sells final AIB shares 15 years after banking crisis",
      "content": "The Irish government said on Tuesday that it had sold its remaining shares in AIB Group , one of the country's two dominant lenders it effectively nationalised 15 years ago as part of the euro zone's biggest state rescue.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 02:22:07",
      "date": "17/06/2025",
      "time": "02:22",
      "category": "crypto",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ireland-sells-final-aib-shares-15-years-after-banking-crisis-2025-06-17/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.43207070707071
    },
    {
      "title": "Polish stocks fall as eurosceptic Nawrocki elected president",
      "content": "Polish equities slipped on Monday after nationalist opposition candidate Karol Nawrocki won the second round of the country's presidential election.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 03:21:38",
      "date": "02/06/2025",
      "time": "03:21",
      "category": "companies",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/polish-stocks-fall-eurosceptic-nawrocki-elected-president-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.229292929292924
    },
    {
      "title": "China, Mexico, EU, Japan, Canada urge Trump not to impose new airplane tariffs",
      "content": "China, Mexico, the European Union, Japan, Canada and many airlines and aerospace companies worldwide urged the Trump administration not to impose new national security tariffs on imported commercial planes and parts, according to documents released Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-10 22:51:19",
      "date": "10/06/2025",
      "time": "22:51",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/business/aerospace-defense/china-mexico-eu-japan-canada-urge-trump-not-impose-new-airplane-tariffs-2025-06-11/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe",
          "asia",
          "latam",
          "canada"
        ]
      },
      "source_type": "general_news",
      "importance_score": 33.07752525252525
    },
    {
      "title": "Nasdaq gains as investors weigh ECB cut and weak data",
      "content": "9:50am: Cautious tone Markets opened Thursday with a cautious tone as Wall Street balanced fresh economic data, mounting geopolitical noise, and anticipation over central bank policy moves. The Dow slipped 63 points, or 0.2%, to 42,365, weighed down by weakness in consumer and industrial names.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-05 10:09:50",
      "date": "05/06/2025",
      "time": "10:09",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.proactiveinvestors.com/companies/news/1072478",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.42550505050505
    },
    {
      "title": "Dax Index News: Inflation, PMI, and Fed Outlook to Guide DAX Forecast This Week",
      "content": "DAX steadies as investors weigh ECB rate cut bets, PMI outlook, and renewed US-China trade tensions after Trump's rare earth minerals accusation.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 01:00:12",
      "date": "02/06/2025",
      "time": "01:00",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-inflation-pmi-and-fed-outlook-to-guide-dax-forecast-this-week-1523083",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.296717171717173
    },
    {
      "title": "ECB Shouldn't Rush Into Further Rate Cuts, Bundesbank's Nagel Says",
      "content": "The Bundesbank president said he supports a cautious approach given that inflation in the eurozone has reached its target level.",
      "source": "wsj.com",
      "rawDate": "2025-06-16 03:58:00",
      "date": "16/06/2025",
      "time": "03:58",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.wsj.com/articles/ecb-shouldnt-rush-into-further-rate-cuts-bundesbanks-nagel-says-02ed4d4e",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.355555555555554
    },
    {
      "title": "Analyzing Multiple Assets Through Scenario Analysis",
      "content": "Scenario 1 is most likely: tariffs slow the U.S. economy but avoid recession; rate cuts and fiscal support make me bullish on stocks short-term. If tariffs cause a global recession (Scenario 2), I favor short-term U.S. and European government bonds due to significant rate cuts and safe haven demand.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-24 01:54:59",
      "date": "24/06/2025",
      "time": "01:54",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://seekingalpha.com/article/4796735-analysing-multiple-assets-through-scenario-analysis",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.37878787878788
    },
    {
      "title": "T-Mobile US, Inc. (NASDAQ:TMUS) Recognized for Best Network, Aiming for Stock Boost",
      "content": "<ul>\n<li><strong>T-Mobile US, Inc. (NASDAQ:TMUS)</strong> has been officially recognized as having the best network in America, potentially boosting its stock performance.</li>\n<li>Despite recent share sales by DEUTSCHE TELEKOM AG, the company still holds a substantial number of shares, indicating confidence in T-Mobile's long-term prospects.</li>\n<li>The stock's current price is <strong>$231.26</strong>, with a trading volume indicating active investor interest, possibly due to recent recognitions and share transactions.</li>\n</ul>\n\n<p><a href=\"https://site.financialmodelingprep.com/financial-summary/TMUS\">T-Mobile US, Inc. (NASDAQ:TMUS)</a> is a major player in the telecommunications industry, known for its extensive network coverage and competitive pricing. Recently, T-Mobile has been officially recognized as having the best network in America. This recognition is expected to enhance T-Mobile's competitive edge, potentially boosting its stock performance by increasing customer trust and subscriber numbers.</p>\n\n<p>The recent sale of T-Mobile shares by DEUTSCHE TELEKOM AG, a significant shareholder, involved <strong>47,074 shares</strong> at approximately <strong>$221.54</strong> each, and <strong>22,366 shares</strong> at <strong>$222.33</strong> each. Despite these sales, DEUTSCHE TELEKOM AG still holds a substantial <strong>648.36 million shares</strong>, indicating continued confidence in T-Mobile's long-term prospects.</p>\n\n<p>T-Mobile's current stock price is <strong>$231.26</strong>, reflecting a <strong>0.63%</strong> increase. The stock has traded between <strong>$228.90</strong> and <strong>$231.29</strong> today, showing stability. Over the past year, TMUS has seen a high of <strong>$276.49</strong> and a low of <strong>$173.74</strong>, highlighting its volatility. The company's market capitalization is approximately <strong>$262.58 billion</strong>, underscoring its significant market presence.</p>\n\n<p>The trading volume for T-Mobile today is <strong>2,429,449 shares</strong>, indicating active investor interest. This activity could be influenced by the recent network recognition and DEUTSCHE TELEKOM AG's share transactions. As T-Mobile continues to strengthen its market position, investor confidence may grow, potentially driving further stock price increases.</p>",
      "source": "Financial Modeling Prep",
      "rawDate": "2025-06-25 18:00:03",
      "date": "25/06/2025",
      "time": "18:00",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://financialmodelingprep.com/market-news/t-mobile-recognized-best-network-boost-tmus-stock",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "fmp_articles",
      "importance_score": 15.956818181818182
    }
  ],
  "china": [
    {
      "title": "Warren Buffett’s Best Investment Quote",
      "content": "A recent list of Warren Buffett’s best quotes includes his primary view of investing. It represents sound advice that is as good as that provided by any seasoned investor: &#8220;The first rule of an investment is don&#8217;t lose (money). And the second rule of an investment is don&#8217;t forget the first rule. And that&#8217;s all the rules there are.&#8221; 24/7 Wall St. Key Points: One of Warren Buffett’s best pieces of investment advice is not to lose money. He may have lost money on some investments, but not enough to offset his overall spectacular returns. Take this quiz to see if you’re on track to retire. (sponsored) A $100 investment in his flagship company, Berkshire Hathaway Inc. (NYSE: BRK-B), which he took over in 1965, was worth $5.5 million at the end of last year. Some of this growth is due to financial companies that he favors and has acquired. This includes insurance company GEICO and several reinsurance companies. However, the largest private corporation he owns is the massive railroad Burlington Northern Santa Fe Company. Two investments demonstrate the diversification of Buffett’s holdings. One is Apple Inc. (NASDAQ: AAPL) (some of which he sold off recently), and the other is the Chinese EV company BYD. He purchased many of his BYD shares in 2008 when the company was still an obscure carmaker. That investment of $230 million is worth $2.4 billion. BYD sells more EVs than Tesla does. Some of his investments are in America’s oldest companies. These are also some of America’s valuable and visible brands. Coca-Cola Co. (NYSE: KO) was launched in 1886. Berkshire Hathaway was a significant company before Buffett took over in 1965. Kroger Inc. (NYSE: KR) was founded in 1883. American Express Co. (NYSE: AXP) got its start in 1850. All were part of Buffett’s holdings in the first quarter of 2025. He has held some of these for most of this century. These represent part of his investment rules and philosophies. Often among the best investments are companies that have been industry giants and successful since before Buffett was born in 1930. He and his staff can examine earnings, business models, and both good and bad decisions. He can look at CEOs, both present and past, and he can sift through balance sheets. Buffett has observed the strategies of their competitors and has seen how these companies navigate business cycles, both good and bad. To be clear, Buffett likes to invest in companies that are relatively new and have been the winners in the new world of tech. This includes, among others, Amazon and Apple. As he watched Apple stock tumble, he sold off some of those holdings. Buffett has lost money on some investments, but not enough to dent his overall spectacular returns. Warren Buffett May Be Stepping Down, but Berkshire Hathaway Will Always Own These Four Dividend Giants The post Warren Buffett&#8217;s Best Investment Quote appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "crypto",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/06/16/warren-buffetts-best-investment-quote/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 41.151515151515156
    },
    {
      "title": "Apple's iPhone sales capture top spot in Chinese market in May, Counterpoint Research says",
      "content": "Apple's iPhone sales rose to the top spot in China in May, with global sales growing 15% year-on-year during April and May in the tech giant's strongest performance for the two-month period since the COVID-19 pandemic, data from Counterpoint Research showed.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 02:29:18",
      "date": "13/06/2025",
      "time": "02:29",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apples-iphone-sales-capture-top-spot-chinese-market-may-counterpoint-research-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.443939393939395
    },
    {
      "title": "Here's how tariffs could affect the price of goods like shoes and sweaters",
      "content": "The true \"cost\" of tariffs is difficult to determine, but models from consultancy group AlixPartners show common imported items could cost a lot more under President Donald Trump's trade policies. Estimates from the firm show sweaters and footwear from China and Vietnam would cost significantly more under both current tariff policy and suspended \"reciprocal\" duties, if retailers pass the full cost onto consumers.",
      "source": "cnbc.com",
      "rawDate": "2025-06-05 08:39:39",
      "date": "05/06/2025",
      "time": "08:39",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/05/trump-tariffs-news-how-prices-could-change.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.3979797979798
    },
    {
      "title": "U.S. money market fund inflows surge on caution over tariffs",
      "content": "U.S. money market funds witnessed huge inflows in the week ended June 4 as investor caution over a rise in U.S. tariffs on steel imports, uncertainties over President Donald Trump's trade disputes with China and a crucial employment report on Friday, boosted demand for safer investment avenues.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 09:06:02",
      "date": "06/06/2025",
      "time": "09:06",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.reuters.com/business/us-money-market-fund-inflows-surge-caution-over-tariffs-2025-06-06/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.137626262626256
    },
    {
      "title": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture",
      "content": "China's tech giant Alibaba has launched new Qwen3 artificial intelligence models for Apple's MLX architecture, Alibaba said in a statement on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 10:36:35",
      "date": "16/06/2025",
      "time": "10:36",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/alibaba-launches-new-qwen3-ai-models-apples-mlx-architecture-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.88358585858586
    },
    {
      "title": "Exclusive: Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
      "content": "Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 23:01:58",
      "date": "12/06/2025",
      "time": "23:01",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/foxconn-sends-97-india-iphone-exports-us-apple-tackles-trumps-tariffs-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.42146464646464
    },
    {
      "title": "Most retail executives expect Trump to walk back 'reciprocal' tariffs, survey finds",
      "content": "Most retail executives expect President Donald Trump to walk back \"reciprocal\" tariffs on the EU, Vietnam, India and the rest of the world, new survey results from AlixPartners shows. Executives could be feeling more optimistic after recent court challenges and efforts between the U.S. and China to negotiate.",
      "source": "cnbc.com",
      "rawDate": "2025-06-12 11:28:15",
      "date": "12/06/2025",
      "time": "11:28",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/12/trump-trade-news-retail-executives-expect-trump-to-drop-tariffs.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 30.876262626262626
    },
    {
      "title": "Recent iPhone Sales Soar",
      "content": "Preliminary findings in tech research firm Counterpoint’s Market Pulse Global Monthly Smartphone Sales Report are that iPhone sales were extremely strong. According to the report, “iPhone sales grew a healthy 15% YoY in April and May, first two months of Q2 2025. This is Apple’s highest market share for these two months combined post pandemic.” 24/7 Wall St. Key Points: Apple Inc. (NASDAQ: AAPL) iPhone sales have been strong in recent months. Expected price increases due to tariffs are one reason for the increased demand. Take this quiz to see if you’re on track to retire. (sponsored) Apple Inc. (NASDAQ: AAPL) has posted sales declines in this period for three years. The reversal of the trend was largely due to the United States and China. “Both US and China returned to positive YoY growth after three years of declines in this less seasonal period,” the authors wrote. There are probably two reasons for the jump. One is that U.S. consumers want to buy an iPhone before tariffs as high as 25% raise prices. The other is that Apple has offered “attractive” prices in China. Counterpoint also noted that iPhone sales in Japan had risen. Demand for the new iPhone 16e, a compact version of the product, triggered the increase. Sales in India have also risen. That market has changed, according to the report: “The iPhone is the most aspirational tech product for tech-savvy consumers here.” The news is particularly good because Samsung, Apple’s greatest global smartphone competition, has introduced new foldable phones. Moreover, Apple has had some success in China, where local companies such as Huawei, Oppo, and Vivo have strong footholds. Apple’s iPhone sales remain constrained because it has not launched the advanced artificial intelligence (AI) product it said would be part of its new iOS. The company says this will not be released until next year. This has disappointed some consumers and affected demand. While consumers worldwide cannot evaluate Apple’s new AI today, it has not undermined sales as much as some experts who follow the company thought it would. Why Is No One Talking About Apple’s Long-Term Artificial Intelligence Plans? The post Recent iPhone Sales Soar appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-20 11:37:11",
      "date": "20/06/2025",
      "time": "11:37",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/technology-3/2025/06/20/iphone-sales-soar-in-march-and-april/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 23.916161616161617
    },
    {
      "title": "My Dividend Stock Portfolio: New May Dividend Record - 100 Holdings With 15 Buys",
      "content": "Markets remained volatile in May 2025 amid ongoing trade tensions and mixed signals from Washington and Wall Street. While U.S.-China talks quietly resumed, tariffs persisted and business sentiment stayed cautious, contributing to investor uncertainty. May's investments added $111 in annual dividends, keeping me on track with my goal of $100+ monthly income growth and a 7.4% yield on cost.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 08:10:00",
      "date": "25/06/2025",
      "time": "08:10",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://seekingalpha.com/article/4797120-my-dividend-stock-portfolio-new-may-dividend-record-100-holdings-with-15-buys",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.51313131313131
    },
    {
      "title": "PCE Posts Highest Monthly Percentage Move in Four Years",
      "content": "The Fed's preferred measure of inflation, Personal Consumption Expenditures (PCE), are out for the month of April. Results were positive across the board — eyebrow-raisingly so, in some cases. In fact, these figures have been strong enough to cut in half the pre-market plummet on the major indexes once President Trump posted “No more Mr Nice Guy” in his trade negotiations with China.",
      "source": "zacks.com",
      "rawDate": "2025-05-30 12:01:04",
      "date": "30/05/2025",
      "time": "12:01",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.zacks.com/stock/news/2479624/pce-posts-highest-monthly-percentage-move-in-four-years?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2479624",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.238888888888887
    },
    {
      "title": "When Are Tariffs Going To Bite?",
      "content": "Markets rallied on news of a Trump-Xi call, but the lack of details and conflicting reports raise questions about the true progress. China's dominance in rare earth processing gives it leverage, and U.S. industries are warning of supply shortages due to export limits.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-06 08:52:18",
      "date": "06/06/2025",
      "time": "08:52",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://seekingalpha.com/article/4792942-when-are-tariffs-going-to-bite",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 21.683838383838385
    },
    {
      "title": "The Day Ahead: What Markets Face Today as Powell, PMI Data, and Trade Risks Take Focus",
      "content": "Markets today face pressure as U.S.-China tensions escalate, with key PMI data and Fed commentary set to shape the session's tone.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 04:35:51",
      "date": "02/06/2025",
      "time": "04:35",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.fxempire.com/forecasts/article/the-day-ahead-what-markets-face-today-as-powell-pmi-data-and-trade-risks-take-focus-1523162",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.467171717171716
    }
  ],
  "japan": [
    {
      "title": "Foreigners turn net sellers of Japan stocks for first week in 12",
      "content": "Foreigners divested Japanese stock for the first time in 12 weeks in the week through June 21 on caution over the Israel-Iran conflict and its impact on Japanese oil imports and inflation.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 00:52:14",
      "date": "26/06/2025",
      "time": "00:52",
      "category": "economy",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/business/finance/foreigners-turn-net-sellers-japan-stocks-first-week-12-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.46161616161616
    },
    {
      "title": "Apple challenges 'unreasonable' EU order to open up to rivals",
      "content": "Apple has submitted a legal challenge to an EU order to open up its closed ecosystem to rivals such as Meta and Alphabet's Google, saying the demands are unreasonable and hamper innovation.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 11:19:24",
      "date": "02/06/2025",
      "time": "11:19",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-challenges-unreasonable-eu-order-open-up-rivals-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.37348484848485
    },
    {
      "title": "Apple's potential deal with Perplexity AI seen as strategic AI boost – BofA",
      "content": "Apple Inc (NASDAQ:AAPL, ETR:APC) is reportedly exploring a potential acquisition or partnership with artificial intelligence startup Perplexity AI, in a move that could enhance its AI capabilities and reduce reliance on Alphabet's Google, according to Bank of America analysts. The investment bank, which maintains a \"Buy\" rating on Apple with a $235 price objective, said the iPhone maker stands to benefit significantly from integrating Perplexity's technology into its ecosystem, particularly to improve Siri and enter the search advertising market.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-24 14:17:57",
      "date": "24/06/2025",
      "time": "14:17",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.proactiveinvestors.com/companies/news/1073541",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.806060606060605
    },
    {
      "title": "Mag 7 check-in: Are the days of tech sector leadership over?",
      "content": "The tech sector, specifically the \"Magnificent Seven,\" made up of Nvidia, Alphabet, Tesla, Microsoft, Amazon, Meta, and Apple, was a significant driver of market gains in 2023 and 2024. However, 2025 has been a different story so far.",
      "source": "youtube.com",
      "rawDate": "2025-06-12 12:31:27",
      "date": "12/06/2025",
      "time": "12:31",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.youtube.com/watch?v=Hujst_g5y7Q",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.468181818181819
    },
    {
      "title": "Why It Makes Sense To Overweight Alphabet Over Apple",
      "content": "I'm rotating part of my Apple position into Alphabet, as Apple's growth has plateaued and its valuation remains high despite AI shortcomings. Alphabet offers superior risk-adjusted returns, driven by AI leadership, expanding search/advertising opportunities, and strong growth in YouTube, Cloud, and Waymo. Google's valuation is attractive, with discounted earnings and free cash flow yields, and its diversified business lines provide significant upside potential.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-03 10:25:57",
      "date": "03/06/2025",
      "time": "10:25",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://seekingalpha.com/article/4791991-why-it-makes-sense-to-overweight-alphabet-over-apple",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.367424242424242
    }
  ],
  "emerging_markets": [
    {
      "title": "Russia fines Apple for violating 'LGBT propaganda' law, TASS reports",
      "content": "A Russian court on Tuesday fined U.S. tech giant Apple six million roubles ($76,510) for violating Russian rules on what Moscow calls \"LGBT propaganda,\" the state TASS news agency reported.",
      "source": "reuters.com",
      "rawDate": "2025-06-10 11:25:03",
      "date": "10/06/2025",
      "time": "11:25",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/sustainability/society-equity/russia-fines-apple-violating-lgbt-propaganda-law-tass-reports-2025-06-10/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.58560606060606
    },
    {
      "title": "Turkey Inflation Keeps Falling in Boost to Central Bank",
      "content": "Consumer prices were 35.4% higher on year in May, easing from 37.9% in April, after the central bank lifted its key interest rate in response to recent political turmoil and market jitters.",
      "source": "wsj.com",
      "rawDate": "2025-06-03 03:18:00",
      "date": "03/06/2025",
      "time": "03:18",
      "category": "economy",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/economy/turkey-inflation-keeps-falling-in-boost-to-central-bank-9db96e43",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 24.691666666666666
    },
    {
      "title": "Thai Central Bank Holds Rate Amid Political Turmoil, Global Uncertainty",
      "content": "Thailand's central bank held rates steady, pausing amid renewed political tensions at home and uncertainty abroad.",
      "source": "wsj.com",
      "rawDate": "2025-06-25 03:10:00",
      "date": "25/06/2025",
      "time": "03:10",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/articles/thai-central-bank-holds-rate-amid-political-turmoil-global-uncertainty-401893ff",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "energy"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 12.468181818181819
    },
    {
      "title": "Momentum Funds Are Beating the Market. How They Do It.",
      "content": "Momentum wasn't only the best-performing domestic market factor in 2024, but also in non-U.S. developed markets and emerging markets.",
      "source": "barrons.com",
      "rawDate": "2025-06-25 02:30:00",
      "date": "25/06/2025",
      "time": "02:30",
      "category": "markets",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.barrons.com/articles/momentum-funds-beating-stock-market-865f309b",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 9.00580808080808
    },
    {
      "title": "Weekly Market Pulse: The Turkey Leg",
      "content": "Israel and Iran are going at it every day, and all the dollar could manage was a measly 0.5% gain on the week. Stocks were down last week, but diversified investors benefitted from a rise in commodity prices and a small gain in bonds.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-23 04:09:00",
      "date": "23/06/2025",
      "time": "04:09",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://seekingalpha.com/article/4796464-weekly-market-pulse-the-turkey-leg",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 8.710606060606061
    }
  ],
  "global": [
    {
      "title": "The World’s Richest Don’t Have to Be Tech Founders, Look at Steve Ballmer",
      "content": "The sixth richest person in the world is former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer. He has a net worth of $164 billion, below that of his former boss Bill Gates, the founder of Microsoft, at $177 billion. Ballmer left the CEO’s job at Microsoft in 2013. He wisely did not sell most of his shares when he left the company. He owns 4% of the massive tech company, which makes him Microsoft&#8217;s largest private owner. His dividends alone make him $1 billion a year. 24/7 Wall St. Key Points: Former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer is the sixth richest person in the world. Those on the list above him all founded huge tech companies. Take this quiz to see if you’re on track to retire. (sponsored) The people on the list above Ballmer all started huge tech companies. These include Tesla&#8217;s Elon Musk at $368 billion, Meta’s Mark Zuckerberg at $241 billion, Oracle’s Larry Ellison at $234 billion, and Amazon’s Jeff Bezos at $233 billion. Ballmer joined Microsoft in 1980 and became chief executive in 2000. During his 14-year tenure, Microsoft’s revenue tripled. As Ballmer left, Eric Jackson at the hedge fund Ironfire Capital told Reuters, “I don’t see anybody else on the management team at Microsoft that I think would be much better than Ballmer.” However, he received criticism for not launching popular products like the rival Steve Jobs did at Apple. Ballmer kept 333 million shares despite leaving, about triple the number Gates has kept. Ballmer has become a major philanthropist. While not as visible as Gates and the Bill &amp; Melinda Gates Foundation, according to Forbes, “He has ramped up his philanthropy since 2014; to date the Ballmers have given away more than $4 billion.” Microsoft Stock Price Prediction and Forecast 2025-2030 The post The World&#8217;s Richest Don&#8217;t Have to Be Tech Founders, Look at Steve Ballmer appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://247wallst.com/investing/2025/06/16/the-worlds-richest-dont-have-to-be-tech-founders-look-at-steve-ballmer/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 50.031565656565654
    },
    {
      "title": "Big central banks' forecasting lens gets fogged by US tariffs",
      "content": "Unpredictable White House tariff rhetoric and its impact on currency markets, oil prices and the inflation outlook have put central banks across the world in a tight spot.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 09:24:14",
      "date": "05/06/2025",
      "time": "09:24",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-central-banks-graphic-2025-06-05/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.32348484848485
    },
    {
      "title": "DoubleLine's Gundlach says to buy international stocks on the dollar's 'secular decline'",
      "content": "The widely-followed investor noted that foreigners invested in the United States could be holding back on committing more capital due to geopolitical concern.",
      "source": "cnbc.com",
      "rawDate": "2025-06-10 18:46:49",
      "date": "10/06/2025",
      "time": "18:46",
      "category": "companies",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/10/gundlach-says-to-buy-international-stocks-on-dollars-secular-decline.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.105555555555554
    },
    {
      "title": "Here are the three reasons why tariffs have yet to drive inflation higher",
      "content": "Separate readings this week on consumer and producer prices were downright benign, as indexes from the Bureau of Labor Statistics reported both rose just 0.1% in May. The months ahead are still expected to show price increases driven by President Donald Trump's desire to ensure the U.S. gets a fair shake with its global trading partners.",
      "source": "cnbc.com",
      "rawDate": "2025-06-12 11:18:42",
      "date": "12/06/2025",
      "time": "11:18",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/12/here-are-the-three-reasons-why-tariffs-have-yet-to-drive-inflation-higher.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.65378787878788
    },
    {
      "title": "HEDGE FLOW Hedge funds buy stocks at quickest pace since Nov 2024, Goldman Sachs says",
      "content": "Hedge funds bought global equities last week at the quickest pace since November 2024, Goldman Sachs said in a note, just as stock markets ended the month with their most positive May performance in decades.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:54:07",
      "date": "02/06/2025",
      "time": "06:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-funds-buy-stocks-quickest-pace-since-nov-2024-goldman-sachs-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.150757575757574
    },
    {
      "title": "Morning Bid: Dollar slides on trade and tax fears",
      "content": "A look at what matters in U.S. and global markets today from Mike Dolan, Editor-At-Large, Finance and Markets",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:39:47",
      "date": "02/06/2025",
      "time": "06:39",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.28762626262626
    },
    {
      "title": "Jim Cramer says Trump is making it hard for the market to value stocks accurately",
      "content": "CNBC's Jim Cramer said President Donald Trump's actions bring out short sellers and lead investors to make misguided market moves. \"When you examine the market's mistakes, they share a common theme: the president's distorting pretty much everything, especially with his tariffs and his jingoistic approach to the rest of the world, and it's continually confounding traders and investors alike,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 18:59:31",
      "date": "03/06/2025",
      "time": "18:59",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/jim-cramer-trump-market-stocks-correctly-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.073989898989897
    },
    {
      "title": "Why global markets are brushing off U.S. strikes on Iran",
      "content": "Market reactions after the U.S. strikes have been less aggressive, especially relative to just over a week ago when Israel launched airstrikes against Iran. \"The markets view the attack on Iran as a relief with the nuclear threat now gone for the region,\" said Dan Ives, managing director at Wedbush.",
      "source": "cnbc.com",
      "rawDate": "2025-06-23 01:10:32",
      "date": "23/06/2025",
      "time": "01:10",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/23/why-global-markets-are-brushing-off-us-strikes-on-iran.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 29.530303030303028
    },
    {
      "title": "Rosen Law Firm Urges Apple Inc. (NASDAQ: AAPL) Stockholders with Large Losses to Contact the Firm for Information About Their Rights",
      "content": "NEW YORK--(BUSINESS WIRE)--Rosen Law Firm, a global investor rights law firm, announces that a shareholder filed a class action lawsuit on behalf of purchasers and acquirers of Apple Inc. (NASDAQ: AAPL) securities between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). Apple is a technology company. For more information, submit a form, email attorney Phillip Kim, or give us a call at 866-767-3653. The Allegations: Rosen Law Firm is Investigating the Allegations that A.",
      "source": "businesswire.com",
      "rawDate": "2025-06-24 15:00:00",
      "date": "24/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.businesswire.com/news/home/20250624333844/en/Rosen-Law-Firm-Urges-Apple-Inc.-NASDAQ-AAPL-Stockholders-with-Large-Losses-to-Contact-the-Firm-for-Information-About-Their-Rights/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 28.38888888888889
    },
    {
      "title": "Fordham: Markets are failing to appreciate the gravity of the moment",
      "content": "Tina Fordham, founder of Fordham Global Foresight, warns markets are underestimating the risk of U.S. involvement in Iran and says this conflict marks a major shift in geopolitical stakes.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 07:39:09",
      "date": "16/06/2025",
      "time": "07:39",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=xXhWR-2bAvs",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 27.582828282828284
    },
    {
      "title": "The Stock Market Doesn't Care About The Israel-Iran War (Unless This One Thing Happens)",
      "content": "Geopolitical turmoil typically causes short-term volatility, but rarely derails the stock market unless it escalates into a global conflict. There is one black swan event lurking in the shadows that we should be aware of.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-18 18:07:52",
      "date": "18/06/2025",
      "time": "18:07",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795807-stock-market-doesnt-care-about-israel-iran-war-unless-this-one-thing-happens",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 23.250252525252527
    },
    {
      "title": "War Interrupts Irrational Exuberance And There's More Bad News Coming",
      "content": "The Iran and Israel conflict is threatening to expand and cause an energy shock that is inflationary and can disrupt global credit. President Trump's tariff wildcard could further disrupt supply chains and add to a potential \"mini-stagflation\" scenario.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-16 05:28:42",
      "date": "16/06/2025",
      "time": "05:28",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795086-war-interrupts-irrational-exuberance-more-bad-news-coming",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.79368686868687
    },
    {
      "title": "Does Consumer Spending Drive Earnings Growth?",
      "content": "S&P Global's current estimates show earnings are growing far above the long-term exponential growth trend from 1936. With regularity, earnings tend to repeatedly revert to the long-term trend due to economic recessions, financial crises, or other events that crimp economic activity. Given the correlation between PCE and forward earnings, and PCE and consumer sentiment, it should be unsurprising that there is a decent correlation between consumer sentiment and forward earnings.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-06 07:58:00",
      "date": "06/06/2025",
      "time": "07:58",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4792945-does-consumer-spending-drive-earnings-growth",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.199747474747475
    },
    {
      "title": "Apple finally got good news about the iPhone this week",
      "content": "The iPhone 16 was the best-selling smartphone globally in Q1 2025, Counterpoint Research reported. Despite topping sales, Apple's iPhone revenue missed fiscal Q1 targets, an analyst said.",
      "source": "businessinsider.com",
      "rawDate": "2025-05-29 17:48:03",
      "date": "29/05/2025",
      "time": "17:48",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.businessinsider.com/apple-dominates-the-global-best-selling-smartphones-list-2025-5",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 21.15580808080808
    },
    {
      "title": "Stock Market This Week: AAPL WWDC 2025, META Scale AI Investment, ORCL Rallies",
      "content": "Markets closed in the red after geopolitical tensions between Iran and Israel swelled on Friday. Apple (AAPL) struggled in the Mag 7 after its Worldwide Developers Conference largely disappointed investors.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 17:00:29",
      "date": "13/06/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Txu28F-sL0M",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.435858585858586
    },
    {
      "title": "If I Could Only Buy 2 Dividend Stocks: June's Top Picks For Global Diversification",
      "content": "I added Allianz and LVMH to The Dividend Income Accelerator Portfolio for their blend of dividend yield, growth, and financial strength. Both companies offer strong dividend growth potential—Allianz with a Dividend Yield [FWD] of 4.31%, and LVMH with a Dividend Yield [FWD] of 3.19%—plus robust long-term growth prospects. These additions improve our portfolio's potential risk-adjusted returns, valuation, and global diversification, aligning with our strategy of balancing income and growth.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-20 14:00:00",
      "date": "20/06/2025",
      "time": "14:00",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4796006-if-i-could-only-buy-2-dividend-stocks-junes-top-picks-for-global-diversification",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 20.354292929292928
    },
    {
      "title": "An inside look at the Fed's policy decisions based on tariffs",
      "content": "Council of Economic Advisers Chair Stephen Miran discusses claims that tariffs cause inflation on 'Kudlow.' #foxbusiness #federalreserve #rates #inflation #economy #worldnews",
      "source": "youtube.com",
      "rawDate": "2025-06-24 21:00:56",
      "date": "24/06/2025",
      "time": "21:00",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=waBOvj99Ayo",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.83181818181818
    },
    {
      "title": "The Biggest Bully in Town: The Bond Market!",
      "content": "A warning sign we have been observing at 3EDGE is the rise in global long bond yields – the interest rates investors demand to buy bonds with a maturity of 20 years or more. In this video, Fritz Folts, 3EDGE Chief Investment Strategist, and Steve Cucchiaro, CEO/CIO, discuss: The sharp increase in U.S.",
      "source": "etftrends.com",
      "rawDate": "2025-06-17 18:32:30",
      "date": "17/06/2025",
      "time": "18:32",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.etftrends.com/etf-strategist-channel/biggest-bully-town-bond-market/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.141919191919193
    },
    {
      "title": "Energy Intelligence: Conflict escalation could pressure global energy markets",
      "content": "Alex Schindelar, President of Energy Intelligence, discusses what to watch out for in the midst of Israel-Iran conflict, and he says the closure of the Straits of Hormuz would be the biggest disruption to the world.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 03:16:42",
      "date": "16/06/2025",
      "time": "03:16",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Dgc8sUL3Vb0",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.930555555555557
    },
    {
      "title": "Warren Buffett's AI Bets: 22% of Berkshire Hathaway's $282 Billion Stock Portfolio Is in These 2 Artificial Intelligence Stocks",
      "content": "At the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway's CEO. Buffett has built an incredible track record of success since taking over the business in 1965 and using it as the foundation for an investment conglomerate that would go on to become one of the world's largest and most successful companies.",
      "source": "fool.com",
      "rawDate": "2025-06-08 07:30:00",
      "date": "08/06/2025",
      "time": "07:30",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/08/warren-buffetts-ai-bets-22-of-berkshire-hathaways/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.922222222222224
    },
    {
      "title": "How To Build A $1,000,000 Dividend Portfolio That Could Yield 11%+ In 15 Years",
      "content": "The Dividend Income Accelerator Portfolio balances income, growth, and capital appreciation, now enhanced by the global diversification from Allianz and LVMH. We focus on financially healthy companies with sustainable dividends and strong competitive advantages, optimizing risk-reward through sector and geographic diversification. The portfolio's Weighted Average Dividend Yield [FWD] of 4.05% and 5-Year Weighted Average Dividend Growth Rate [CAGR] of 7.06% project a Yield on Cost above 11% in 15 years.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-24 11:00:00",
      "date": "24/06/2025",
      "time": "11:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4796732-building-global-1000000-dividend-portfolio-to-yield-11-percent-15-years",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.7719696969697
    },
    {
      "title": "Fed facing triple threat of unknowns - tariffs, growth and consumer sentiment: UBS",
      "content": "UBS Global Wealth Management Chief Economist Paul Donovan tells CNBC's Carolin Roth there are so many unknowns in the economy that there can be no real conviction in forecasts.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 08:53:40",
      "date": "20/06/2025",
      "time": "08:53",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=D-RsA1d3LTE",
      "themes": {
        "macroeconomics": [
          "recession",
          "monetary_policy"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.47373737373737
    },
    {
      "title": "Asia credit remains resilient with limited direct exposure to tariffs: JP Morgan",
      "content": "Soo Chong Lim of JP Morgan joins Squawk Box Asia to discuss the recovery in Asia's credit market amid the global trade war, the outlook for U.S. Treasuries, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-02 00:36:01",
      "date": "02/06/2025",
      "time": "00:36",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=HsiImww_Tt0",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.385353535353534
    },
    {
      "title": "Dow sinks on Middle East tensions; Brent crude tops $90",
      "content": "9:51am: Geopolitical shock Stocks opened sharply lower Friday as fears of a broader Middle East war rattled global markets. The Dow Jones fell 512 points, or 1.2%, to 42,456.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-13 09:57:07",
      "date": "13/06/2025",
      "time": "09:57",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.proactiveinvestors.com/companies/news/1072942",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.15
    },
    {
      "title": "ROSEN, A GLOBAL AND LEADING LAW FIRM, Encourages Apple Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action – AAPL",
      "content": "NEW YORK, June 25, 2025 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 19, 2025.",
      "source": "globenewswire.com",
      "rawDate": "2025-06-25 17:18:00",
      "date": "25/06/2025",
      "time": "17:18",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.globenewswire.com/news-release/2025/06/25/3105483/673/en/ROSEN-A-GLOBAL-AND-LEADING-LAW-FIRM-Encourages-Apple-Inc-Investors-to-Secure-Counsel-Before-Important-Deadline-in-Securities-Class-Action-AAPL.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 16.21666666666667
    },
    {
      "title": "Unpacked 2025: Samsung's AI Ecosystem Is Coming For Apple, Google, And Other Rivals",
      "content": "Samsung's July 9 Unpacked event is more than a product launch—it's a strategic statement about AI and ecosystem leadership. Samsung is uniquely positioned, building not just devices but also the critical chips and infrastructure powering global tech, with strong financials and a fortress balance sheet. The company is aggressively integrating AI across all product categories, outpacing Apple and Google in ecosystem cohesion and innovation.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 10:54:11",
      "date": "25/06/2025",
      "time": "10:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4797199-unpacked-2025-samsung-ai-ecosystem-coming-for-apple-google-other-rivals",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.742929292929293
    },
    {
      "title": "Federal appeals court stays sweeping order that blocked most of Trump tariffs",
      "content": "A federal appeals court put the brakes Thursday on a lower court order that overturned most of President Trump's sweeping tariffs. A full 11-judge panel on the US Court of Appeals for the federal circuit stayed the order by the Manhattan-based Court of International Trade while the White House appeal is heard.",
      "source": "nypost.com",
      "rawDate": "2025-05-29 15:25:33",
      "date": "29/05/2025",
      "time": "15:25",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://nypost.com/2025/05/29/us-news/federal-appeals-court-stays-sweeping-order-that-blocked-most-of-trump-tariffs/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.697222222222223
    },
    {
      "title": "Apple sued by shareholdrs, accues of lying about AI progress — causing iPhone sales, stock to slump",
      "content": "Shareholders said the truth began to emerge on March 7 when Apple delayed some Siri upgrades to 2026, and continued through this year's Worldwide Developers Conference when Apple's assessment of its AI progress disappointed analysts.",
      "source": "nypost.com",
      "rawDate": "2025-06-20 18:36:39",
      "date": "20/06/2025",
      "time": "18:36",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://nypost.com/2025/06/20/business/apple-sued-by-shareholders-for-allegedly-overstating-ai-progress/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.647222222222222
    },
    {
      "title": "Apple iPhone Shipment Could Decline In 2025 As Tariff, Competition Play Spoil Sport: IDC",
      "content": "International Data Corporation (IDC) Worldwide Quarterly Mobile Phone Tracker expects global smartphone shipments to grow 0.6% year over year to 1.24 billion in 2025.",
      "source": "benzinga.com",
      "rawDate": "2025-05-29 14:49:55",
      "date": "29/05/2025",
      "time": "14:49",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.benzinga.com/media/25/05/45679204/apple-iphone-shipment-could-decline-in-2025-as-tariff-competition-play-spoil-sport-idc",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "energy",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.627777777777776
    },
    {
      "title": "Apple treads lightly on AI at WWDC as investors await bolder signals",
      "content": "Apple Inc (NASDAQ:AAPL, ETR:APC) unveiled a redesign of its iPhone, iPad and Mac operating systems at its annual Worldwide Developers Conference, but barely touched on its artificial intelligence strategy. A new operating system, rebranded as iOS 26, introduces a translucent interface called Liquid Glass and a more unified visual design across the company's product line.",
      "source": "proactiveinvestors.co.uk",
      "rawDate": "2025-06-10 04:30:35",
      "date": "10/06/2025",
      "time": "04:30",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.proactiveinvestors.co.uk/companies/news/1072678",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.596717171717172
    },
    {
      "title": "AAPL Investors Have Opportunity to Lead Apple Inc. Securities Fraud Lawsuit",
      "content": "NEW YORK , June 24, 2025 /PRNewswire/ -- Why: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the \"Class Period\"). A class action lawsuit has already been filed.",
      "source": "prnewswire.com",
      "rawDate": "2025-06-24 18:15:00",
      "date": "24/06/2025",
      "time": "18:15",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.prnewswire.com/news-releases/aapl-investors-have-opportunity-to-lead-apple-inc-securities-fraud-lawsuit-302490142.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.217171717171718
    },
    {
      "title": "\"Long-Term\" Normal: Takeaways from Grocery Inflation Survey",
      "content": "Duncan Angove (@BlueYonderAI) breaks down the takeaways from Blue Yonder's 2025 Global Consumer Sentiment on Grocery Inflation survey. He notes that consumers are pulling back “entirely” from some categories and says that they are very deal-driven.",
      "source": "youtube.com",
      "rawDate": "2025-06-24 17:30:03",
      "date": "24/06/2025",
      "time": "17:30",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=6Vn0cpq1Cv0",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.976767676767675
    },
    {
      "title": "Apple's Big Developers Event Kicks Off Monday—What You Need To Know",
      "content": "Apple's (AAPL) annual Worldwide Developers Conference kicks off Monday, when CEO Tim Cook will get a chance to shift the narrative for the iPhone maker as worries about tariffs and AI feature delays have weighed on the company's stock this year.",
      "source": "investopedia.com",
      "rawDate": "2025-06-06 15:00:54",
      "date": "06/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.investopedia.com/apple-big-developers-event-kicks-off-monday-what-you-need-to-know-11747463",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.710858585858587
    },
    {
      "title": "Is It Time to Buy 2 of the Worst-Performing Dow Jones Stocks This Year?",
      "content": "The Dow Jones Industrial Average tracks the performance of 30 blue chip stocks. These are some of the world's strongest companies.",
      "source": "fool.com",
      "rawDate": "2025-06-24 09:45:00",
      "date": "24/06/2025",
      "time": "09:45",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/24/time-to-buy-2-of-the-worst-performing-dow-jones/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 14.512626262626263
    },
    {
      "title": "Tariffs And Free Trade By Wade",
      "content": "Tariffs and trade have dominated the media headlines since the beginning of the year, creating a volatile rollercoaster ride in the financial markets and the broader economy. Just this week, a federal court ruled that the president's tariff policies were illegal, citing misuse of emergency powers under the International Emergency Economic Powers Act of 1977.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-03 03:15:00",
      "date": "03/06/2025",
      "time": "03:15",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4791874-tariffs-free-trade-by-wade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.409090909090908
    }
  ],
  "events": [
    {
      "title": "Fed Goolsbee Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Dallas Fed Manufacturing Index (Jun)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bank Stress Test Results",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q2)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Jun)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Hammack Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Income MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Spending MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index YoY (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Williams Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Kashkari Speech",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Jun/25)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Hit Co Ltd (378A.T)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: CapsoVision, Inc (CV)",
      "date": "01/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "5.00 - 5.50",
      "marketCap": 28900000,
      "status": "Priced"
    },
    {
      "title": "IPO: First Trust Exchange-Traded Fund VIII (FBDC)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Globe Civil Projects Ltd (GLOV.BO)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "BSE",
      "priceRange": "67.00 - 71.00",
      "marketCap": 1200000000,
      "status": "Priced"
    },
    {
      "title": "IPO: Rent Corp (372A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Lipps Co Ltd (373A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Vendome Acquisition Corporation I Unit (VNMEU)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: T. Rowe Price Exchange-Traded F (TGLB)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Blue Gold Limited Class A Ordinary Shares (BGL)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Grindrod Shipping Holdings Ltd. (GRIN)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Julong Holding Limited Class A Ordinary Shares (JLHL)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: ProShares Nasdaq-100 Dynamic Buffer ETF (QB)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: BlackRock ETF Trust II (GGOV)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Cantor Equity Partners III, Inc. Class A Ordinary Shares (CAEP)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: VERSES AI Inc. Common Stock (VSAI)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: ARS Focused Opportunity Strategy ETF (AFOS)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: VictoryShares Pioneer Asset-Based Income ETF (ABI)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: FT Vest Growth Strength & Target Income ETF (FGSI)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: VictoryShares International Free Cash Flow ETF (IFLO)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Jefferson Capital, Inc. Common Stock (JCAP)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": 195500000,
      "status": "Expected"
    },
    {
      "title": "IPO: Blue Gold Limited Warrant (BGLWW)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Goldman Sachs ETF Trust (GBND)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Capital Group Equity ETF Trust  (CGVV)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Capital Group Fixed Income ETF  (CGHY)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Capital Group Equity ETF Trust  (CGGG)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Goldman Sachs ETF Trust (GIGL)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: T. Rowe Price Exchange-Traded F (TIER)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "M&A: DICK'S SPORTING GOODS, INC. acquires Foot Locker, Inc.",
      "date": "23/06/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1089063/000114036125023387/ny20050218x1_s4.htm",
      "symbol": "DKS",
      "targetedSymbol": "FL"
    },
    {
      "title": "M&A: MetroCity Bankshares, Inc. acquires First IC Corporation",
      "date": "23/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1747068/000110465925052461/tm2515540-2_s4.htm",
      "symbol": "MCBS",
      "targetedSymbol": "FIEB"
    },
    {
      "title": "M&A: RadNet, Inc. acquires iCAD, Inc.",
      "date": "06/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790526/000168316825003180/radnet_s4.htm",
      "symbol": "RDNT",
      "targetedSymbol": "ICAD"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Mr. Cooper Group Inc.",
      "date": "29/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925041422/tm2513302-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "COOP"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKPF",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKKQ",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNK",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "21/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925036921/alms-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO-PA",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APOS",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Redfin Corporation",
      "date": "07/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925032694/tm2511408-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "RDFN"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: FLYEXCLUSIVE INC. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZW",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZ",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    }
  ]
}