{
  "lastUpdated": "2025-06-27T08:18:37.174360",
  "us": [
    {
      "title": "Exclusive: Fed should wait on rate cuts with price hikes expected, Bostic says",
      "content": "The Federal Reserve need not cut interest rates with companies planning to raise prices later this year in response to higher import taxes and with the job market still stable, Atlanta Fed President Raphael Bostic told Reuters.",
      "source": "reuters.com",
      "rawDate": "2025-06-24 06:04:45",
      "date": "24/06/2025",
      "time": "06:04",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/fed-should-wait-rate-cuts-with-price-hikes-expected-bostic-says-2025-06-24/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 52.99419191919192
    },
    {
      "title": "Apple supplier Jabil raises annual forecast as data center appetite remains strong",
      "content": "Electronics component maker Jabil raised full-year profit and revenue forecast on Tuesday, betting on strong infrastructure services demand for data centers.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 08:54:03",
      "date": "17/06/2025",
      "time": "08:54",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/technology/apple-supplier-jabil-raises-annual-forecast-data-center-appetite-remains-strong-2025-06-17/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 50.920959595959594
    },
    {
      "title": "Norges Bank expected to cut rates twice more in 2025",
      "content": "Norway's central bank is expected to cut its policy interest rate twice more this year following last week's surprise reduction in the cost of borrowing from a near 17-year high, a Reuters poll of economists showed on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-24 04:11:27",
      "date": "24/06/2025",
      "time": "04:11",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/norges-bank-expected-cut-rates-twice-more-2025-2025-06-24/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 49.70353535353536
    },
    {
      "title": "Fed's Bowman confirmed by Senate to central bank's top regulatory post",
      "content": "Federal Reserve Governor Michelle Bowman was confirmed to the central bank's top regulatory post by the U.S. Senate on Wednesday, where she is expected to push an agenda aimed at easing rules for banks.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 18:53:54",
      "date": "04/06/2025",
      "time": "18:53",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/feds-bowman-confirmed-by-senate-central-banks-top-regulatory-post-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.682323232323235
    },
    {
      "title": "Tech stocks, including Apple, were safety trade during Covid, but this market is different",
      "content": "A recent decline in the price of Apple is a marked contrast from 2020 when the tech stock served as a safety trade in an uncertain market. Apple's underperformance doesn't mean tech is not attracting investors, as the sector as a whole has bounced back strongly from this year's big, early selloff.",
      "source": "cnbc.com",
      "rawDate": "2025-06-23 11:27:31",
      "date": "23/06/2025",
      "time": "11:27",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/23/tech-stocks-like-apple-were-covid-safety-trade-but-the-market-changed.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 46.0550505050505
    },
    {
      "title": "Investors see stagflation ahead but slow interest rate cuts, CNBC Fed survey finds",
      "content": "The June CNBC Fed Survey continued to indicate weaker growth and higher inflation than at the beginning of the year and most say uncertainty over tariff policy remains high. The Fed is expected to stand pat at the June meeting and not cut rates until September.",
      "source": "cnbc.com",
      "rawDate": "2025-06-17 11:56:43",
      "date": "17/06/2025",
      "time": "11:56",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/17/investor-see-stagflation-ahead-but-slow-interest-rate-cuts-cnbc-fed-survey-finds.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 45.709848484848486
    },
    {
      "title": "Wall Street, Main Street push for foreign tax rethink in US budget bill",
      "content": "Industry groups representing sectors including real estate, finance and multinational companies are pushing for the reduction or exclusion of a retaliatory tax targeting foreign investors in the U.S. in the Republican tax bill, as they see it as a threat to their businesses and to the broader markets and economy.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:29:38",
      "date": "09/06/2025",
      "time": "06:29",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/wall-street-main-street-push-foreign-tax-rethink-us-budget-bill-2025-06-09/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "crypto"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 43.02373737373737
    },
    {
      "title": "Ireland to sell final AIB shares 15 years after banking crisis",
      "content": "The Irish government on Monday launched the sale of its remaining shares in AIB Group , one of the country's two dominant lenders it effectively nationalised 15 years ago, Finance Minister Paschal Donohoe said.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 13:41:55",
      "date": "16/06/2025",
      "time": "13:41",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/ireland-sell-final-aib-shares-15-years-after-banking-crisis-2025-06-16/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.46212121212121
    },
    {
      "title": "Fed Governor Waller says central bank could cut rates as early as July",
      "content": "Fed Governor Waller says central bank could cut rates as early as July",
      "source": "cnbc.com",
      "rawDate": "2025-06-20 08:51:04",
      "date": "20/06/2025",
      "time": "08:51",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/20/fed-governor-waller-says-central-bank-could-cut-rates-as-early-as-july.html",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.31565656565657
    },
    {
      "title": "WWDC: Apple faces AI, regulatory challenges as it woos software developers",
      "content": "Apple is facing an unprecedented set of technical and regulatory challenges as some of its key executives are set to take the stage on Monday at the company's annual software developer conference.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:06:09",
      "date": "09/06/2025",
      "time": "06:06",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/wwdc-apple-faces-ai-regulatory-challenges-it-woos-software-developers-2025-06-09/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.28686868686869
    },
    {
      "title": "These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines",
      "content": "Key Points A &#8220;more is better&#8221; approach can help you diversify your portfolio while generating passive income. Five fascinating funds will tempt income seekers with potent yields and strong growth prospects. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Stock picking is fine, but exchange traded funds (ETFs) can enable immediate diversification without sacrificing growth and income opportunities. By selecting multiple funds instead of just one, you can achieve an extra measure of safety while also turning your portfolio into a veritable income-generating machine. The idea is to pick out ETFs with notable distribution yields (i.e., annualized cash payment percentages), but also to focus on a wide variety of funds with share-price growth potential. Now, let&#8217;s drill down on five fabulous ETFs so you can start accumulating shares for your income-machine portfolio today. NEOS NASDAQ-100 High Income ETF (QQQI) The name of the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) might lead you to assume that this fund only offers a hefty yield. There&#8217;s more to the story, though, as the QQQI ETF also enables investors to participate in strong technology-focused growth opportunities. Based on the NASDAQ 100 stock index with approximately 100 holdings, the NEOS NASDAQ-100 High Income ETF includes many large-cap tech names you&#8217;ll surely recognize. Some examples are NVIDIA (NASDAQ:NVDA), Apple (NASDAQ:AAPL), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Broadcom (NASDAQ:AVGO). There&#8217;s no denying that technology giants like Apple and NVIDIA are robust revenue generators. Consequently, the NEOS NASDAQ-100 High Income ETF share price could grow substantially over the long term. At the same time, many investors flock to the QQQI ETF for its eye-catching 13.92% distribution yield. Granted, the fund subtracts an annualized management fee (also known as the expense ratio) of 0.68% from the share price. Still, even after the expense ratio is taken out, investors can look forward to outstanding annual income with the QQQI ETF. Along with that, you&#8217;ll get to participate in the growth prospects of terrific tech titans when you hold the NEOS NASDAQ-100 High Income ETF. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) There&#8217;s another passive income machine that&#8217;s similar to QQQI, but it&#8217;s not identical. Brought to you by famous financier JPMorgan Chase (NYSE:JPM), the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) squeezes extra income from a range of high-confidence technology leaders. Much like the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100 and includes around 100 stocks (108, to be exact). From Microsoft to Apple, Amazon, and many more, you&#8217;ll find plenty of high-growth tech names in JEPQ. There&#8217;s a trade-off with the JPMorgan Nasdaq Equity Premium Income ETF when compared to the NEOS NASDAQ-100 High Income ETF. On the negative side, JEPQ has a rolling 12-month dividend yield of 11.01%, which isn’t as impressive as QQQI&#8217;s 13.92% distribution yield. On the positive side, however, the JPMorgan Nasdaq Equity Premium Income ETF has an annualized expense ratio of 0.35%. This is lower than the NEOS NASDAQ-100 High Income ETF&#8217;s 0.68% annual management fee. Perhaps most importantly, you&#8217;ll have the reassurance that comes with well-established fund management by JPMorgan Chase. Thus, for an interesting alternative to the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF is absolutely worth considering. Schwab U.S. Dividend Equity ETF (SCHD) Maybe you&#8217;re seeking a passive income machine that&#8217;s not as technology-heavy as QQQI and JEPQ. In that case, you&#8217;ll want to check out the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This fund includes has 103 stocks in its portfolio, but SCHD doesn&#8217;t track the NASDAQ 100 index. Instead, the Schwab U.S. Dividend Equity ETF tracks the Dow Jones U.S. Dividend 100 Index. Take a look at the fund’s top 10 holdings and you’ll find some technology firms, such as Cisco Systems (NASDAQ:CSCO) and Texas Instruments (NASDAQ:TXN). Yet, you&#8217;ll also see names from other sectors, including Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), Lockheed Martin (NYSE:LMT), and Conoco Phillips (NYSE:COP). Moreover, the Schwab U.S. Dividend Equity ETF offers a trailing 12-month distribution yield of 3.72% with an annual expense ratio of just 0.06%. The ultra-low management fees allow investors to grow their accounts steadily with the SCHD ETF. Two More Picks for Low Volatility To cap off this list of passive income machine picks, I&#8217;ve got two relatively low-risk funds to show you. First, there&#8217;s an ETF that concentrates on dividend-growing businesses instead of gigantic yield. The Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO) features a 4.81% annual distribution rate but also a 0.56% expense ratio, so the income opportunities are good but not jaw-dropping. On the other hand, DIVO tends to be low-volatility as it holds a diverse array of safe names, such as Home Depot, Visa (NYSE:V), Caterpillar (NYSE:CAT), Microsoft, and Goldman Sachs (NYSE:GS). The Amplify CWP Enhanced Dividend Income ETF emphasizes &#8220;high-quality large cap companies with a history of dividend and earnings growth.&#8221; This approach will typically reduce share-price volatility, so investors can sleep well at night while collecting passive income with DIVO. In a similar vein, the NEOS S&amp;P 500 High Income ETF (BATS:SPYI) is de-risked because it holds well-known large-cap stocks in multiple sectors. Indeed, SPYI might be the least risky fund on this list as it includes approximately 500 stocks in its holdings. Because the NEOS S&amp;P 500 High Income ETF generates income from the S&amp;P 500 index, it is a widely diversified fund. So, there&#8217;s a safety factor built into the SPYI ETF. In addition, the NEOS S&amp;P 500 High Income ETF is an enticing passive income machine with a 12.11% annual distribution rate. The fund&#8217;s 0.68% annual expense ratio isn&#8217;t super-low, but the fees may be justified as SPYI brings high yield and instant diversification to the table. All in all, I like DIVO and SPYI for reduced volatility, SCHD for low management fees, and QQQI and JEPQ for technology-sector exposure.The post These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 13:30:07",
      "date": "03/06/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/03/these-5-etfs-qqqi-jepq-schd-divo-spyi-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.151515151515156
    },
    {
      "title": "Apple eyes using AI to design its chips, technology executive says",
      "content": "Apple is interested in tapping generative artificial intelligence to help speed up the design of the custom chips at the heart of its devices, its top hardware technology executive said in private remarks last month.",
      "source": "reuters.com",
      "rawDate": "2025-06-18 19:16:41",
      "date": "18/06/2025",
      "time": "19:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-eyes-using-ai-design-its-chips-technology-executive-says-2025-06-18/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.1
    },
    {
      "title": "US consumer prices rise moderately; tariffs seen fanning inflation",
      "content": "Inflation is expected to accelerate in the coming months on the back of the Trump administration's import tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-06-11 08:38:04",
      "date": "11/06/2025",
      "time": "08:38",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/us/us-consumer-prices-rise-moderately-may-2025-06-11/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 41.81666666666667
    },
    {
      "title": "This outlook shows why investors should maintain exposure to the ‘Magnificent Seven'",
      "content": "Big Tech is expected to see double the earnings growth of the S&P 500, as long as the group can maintain momentum in a key area.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-26 09:20:00",
      "date": "26/06/2025",
      "time": "09:20",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.marketwatch.com/story/this-outlook-shows-why-investors-should-maintain-exposure-to-the-magnificent-seven-d9939fc3",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 41.4010101010101
    },
    {
      "title": "These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines",
      "content": "Key Points QQQI, JEPQ, SPYI, and MSTY offer eye-catching yields for ambitious passive income investors. You can try all four of these high-yield ETFs for diversified exposure to a wide range of stocks. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) In recent years, ultra-high-yield exchange traded funds (ETFs) have opened the door to new possibilities for aggressive income harvesters. If you pick your ETFs carefully, you can practically turn your portfolio into a passive income machine. Using high-yield ETFs to generate steady income is a smart strategy, but it takes time and research to build a reliable income machine. So, to save you some of the trouble, I&#8217;ve hand-picked these four fantastic funds with big yields. Furthermore, if you give these four ETFs a try, you can cover different market sectors to diversify your portfolio. NEOS NASDAQ-100 High Income ETF (QQQI) If you&#8217;re on the hunt for tech-sector exposure, big yield, and frequent payouts, look no further. Truly, the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) is an ambitious income investor&#8217;s dream fund. First and foremost, the QQQI ETF offers a huge distribution yield (i.e., the annualized cash payout to your portfolio) of 13.92%. This positions the NEOS NASDAQ-100 High Income ETF among the most generous high-yield funds available today. Plus, there&#8217;s another reason why the QQQI ETF is a dividend achiever. Specifically, the NEOS NASDAQ-100 High Income ETF pays its cash distributions on a monthly basis instead of making you wait three months for the next payout. Granted, you&#8217;ll have to pay an expense ratio, which is the annualized management fee that&#8217;s automatically deducted from the fund&#8217;s share price. When it comes to the NEOS NASDAQ-100 High Income ETF, the expense ratio is 0.68%, which is slightly high but not outrageous. Just as importantly, the NEOS NASDAQ-100 High Income ETF invests in components of the technology-heavy NASDAQ 100 index. With roughly 100 holdings, the QQQI ETF includes well-established tech winners like Apple (NASDAQ:AAPL), NVIDIA (NASDAQ:NVDA), Broadcom (NASDAQ:AVGO), Amazon (NASDAQ:AMZN), and Meta Platforms (NASDAQ:META). In other words, the NEOS NASDAQ-100 High Income ETF isn&#8217;t only a passive income powerhouse with a sizable yield. It&#8217;s also an easy way to diversify your portfolio across dozens of tech-market standouts, and this can add an extra layer of safety. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) In some ways, the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) is similar to the NEOS NASDAQ-100 High Income ETF. Yet, with the JEPQ ETF you&#8217;ll get the peace of mind that comes with prestigious management from financial giant JPMorgan Chase (NYSE:JPM). Like the NEOS NASDAQ-100 High Income ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100. JEPQ has 108 stocks in its holdings, and the fund is strongly weighted toward large-cap technology stocks (Apple, Amazon, Microsoft, and so on). Also, just like the QQQI ETF, the JEPQ ETF pays out its distributions on a monthly basis. However, the JPMorgan Nasdaq Equity Premium Income ETF has a rolling 12-month dividend yield of 11.01%, which isn&#8217;t quite as high as the NEOS NASDAQ-100 High Income ETF&#8217;s gigantic 13.92% distribution yield. On the other hand, the JPMorgan Nasdaq Equity Premium Income ETF brings you active management from the one and only JPMorgan Chase. That&#8217;s a safety feature to consider, and the fund&#8217;s expense ratio is only 0.35%. Therefore, you might consider leveraging the expertise of a legendary asset manager with the comparatively low-fee JEPQ ETF. NEOS S&amp;P 500 High Income ETF (SPYI) Mind you, I didn&#8217;t turn my portfolio into a passive income machine by only investing in NASDAQ 100 based funds. Indeed, I diversified my holdings even further with a very broad-based fund known as the NEOS S&amp;P 500 High Income ETF (BATS:SPYI). Like QQQI and JEPQ, SPYI pays out its distributions each and every month. Yet, unlike those other two funds, the NEOS S&amp;P 500 High Income ETF is based on the S&amp;P 500 rather than the NASDAQ 100. With around 500 stocks in its holdings, the NEOS S&amp;P 500 High Income ETF is more diversified than QQQI and JEPQ. You&#8217;ll get exposure to tech names like Apple and NVIDIA with the SPYI ETF, but you&#8217;ll also participate in the growth of non-technology-sector businesses like Coca-Cola (NYSE:KO), Bank of America (NYSE:BAC), Home Depot (NYSE:HD), and Occidental Petroleum (NYSE:OXY). For active management and the enhanced safety that comes with wide portfolio breadth, the NEOS S&amp;P 500 High Income ETF charges an expense ratio of 0.68%. However, the fund&#8217;s hefty 12.11% annual distribution rate more than makes up for the management fees, so SPYI is a great choice for monthly income seekers. YieldMax MSTR Option Income Strategy ETF (MSTY) Finally, after focusing on safety and diversification with the first three ETFs, now we can ramp up the risk-and-reward profile with a fourth fund. I&#8217;m referring to an aggressive but fascinating fund known as the YieldMax MSTR Option Income Strategy ETF (NYSEARCA:MSTY). You won&#8217;t get much diversification with the YieldMax MSTR Option Income Strategy ETF. Instead, you&#8217;ll get an annual expense ratio of 0.99% and an eye-watering distribution rate of 143.11%. The fund achieves this through actively trading U.S. Treasury bonds and options on Microstrategy (NASDAQ:MSTR) stock. As you may be aware, Microstrategy stock is volatile and involves a great deal of risk. You&#8217;ll get sizable monthly distributions with MSTY, but a downturn in MSTR stock could be problematic for your portfolio. Because this fund is very risky, my passive income machine only includes a few shares of the YieldMax MSTR Option Income Strategy ETF. For a more favorable safety-and-yield mix, consider taking a larger position in SPYI, a smaller stake in QQQI and JEPQ, and a tiny position in MSTY.The post These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 10:04:43",
      "date": "03/06/2025",
      "time": "10:04",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/02/these-4-dividend-etfs-qqqi-jepq-spyi-msty-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.74242424242424
    },
    {
      "title": "HEDGE FLOW Hedge fund leverage reaches five-year high, buying bank stocks, Goldman Sachs says",
      "content": "Hedge fund leverage hit a five-year high last week, with speculators buying banks, trading companies and insurance firms, Goldman Sachs data showed, after U.S. interest rates held steady and just before U.S. attacks on Iran's nuclear sites.",
      "source": "reuters.com",
      "rawDate": "2025-06-23 04:52:44",
      "date": "23/06/2025",
      "time": "04:52",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-fund-leverage-reaches-five-year-high-buying-bank-stocks-goldman-2025-06-23/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.484848484848484
    },
    {
      "title": "Tariffs Likely to ‘Weigh on Economic Activity' Fed Chair Says",
      "content": "The Federal Reserve wants more time to study the impact of tariffs before cutting rates. [contact-form-7] That's according to Jerome Powell, the central bank's chair, testifying Tuesday (June 24) that the Fed needs to see if tariffs push inflation higher before deciding on the interest rate cuts that President Donald Trump has demanded.",
      "source": "pymnts.com",
      "rawDate": "2025-06-24 16:56:39",
      "date": "24/06/2025",
      "time": "16:56",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.pymnts.com/economy/2025/tariffs-likely-to-weigh-on-economic-activity-fed-chair-says/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.78737373737374
    },
    {
      "title": "Court denies Apple appeal in Epic Games case, keeping App Store changes in place",
      "content": "A panel of judges denied Apple's emergency application to halt changes to its App Store that resulted from the company's legal battle with Epic Games. The ruling in the case means Apple can no longer charge a commission on payment links inside its apps nor tell developers how the links should look.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 17:40:52",
      "date": "04/06/2025",
      "time": "17:40",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/apple-appeal-epic-games-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.754797979797985
    },
    {
      "title": "This is why Jamie Dimon is so gloomy on the economy",
      "content": "JPMorgan Chase CEO Jamie Dimon has regularly warned that the U.S. economy faces perils, but even as he sounds the alarm, his bank is doing better than ever. A review of 20 years of Dimon's annual investor letters and his public statements show a distinct evolution: His warnings about economic calamities became more frequent even as his bank's performance began lapping rivals.",
      "source": "cnbc.com",
      "rawDate": "2025-05-30 13:05:05",
      "date": "30/05/2025",
      "time": "13:05",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/05/30/jpmorgan-chase-jamie-dimon-economy.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.595454545454544
    },
    {
      "title": "Apple's WWDC is a chance to change investors' minds. Can the company deliver?",
      "content": "Apple's stock has been dogged by concerns that the company is behind the curve on AI.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-07 08:00:00",
      "date": "07/06/2025",
      "time": "08:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-wwdc-is-a-chance-to-change-investors-minds-can-the-company-deliver-fead8681",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.56944444444444
    },
    {
      "title": "Materials Down as Fed Warns on Inflation -- Materials Roundup",
      "content": "Producers of metals and other raw materials fell after the Federal Reserve left interest rates unchanged and indicated that rate cuts in the coming year would be modest in scale.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-18 17:28:00",
      "date": "18/06/2025",
      "time": "17:28",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/materials-down-as-fed-warns-on-inflation-materials-roundup-33266de0",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.34292929292929
    },
    {
      "title": "Fed's Waller Suggests Support for a July Cut",
      "content": "Federal Reserve governor Christopher Waller said the central bank could be positioned to cut interest rates at its next meeting in July, notwithstanding potential inflation pressures caused by new tariffs.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-20 09:34:00",
      "date": "20/06/2025",
      "time": "09:34",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/fed-s-waller-suggests-support-for-a-july-cut-9931a156",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 36.90277777777777
    },
    {
      "title": "U.S. inflation rises 0.1% in May from prior month, less than expected",
      "content": "The consumer price index was expected to rise 0.2% in May, with a 12-month inflation rate of 2.4%.",
      "source": "cnbc.com",
      "rawDate": "2025-06-11 08:32:21",
      "date": "11/06/2025",
      "time": "08:32",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/11/cpi-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.86313131313131
    },
    {
      "title": "Traders focus on chance of just one 2025 Fed rate cut — or zero — due to tariffs, Mideast",
      "content": "Heightened uncertainty over tariffs, the direction of oil prices and their impacts on inflation is giving way to a risk that Federal Reserve officials may not be able to cut interest rates in two quarter-point increments this year as they had previously expected.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-17 12:48:00",
      "date": "17/06/2025",
      "time": "12:48",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/traders-focus-on-chance-of-just-one-2025-fed-rate-cut-or-zero-due-to-tariffs-mideast-cfa13f94",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.92752525252525
    },
    {
      "title": "Apple's stock has been in a slump — and these analysts don't see an easy way out",
      "content": "Needham analysts say the stock looks pricey, while Apple faces growing threats from its tech rivals.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 11:16:00",
      "date": "04/06/2025",
      "time": "11:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-has-been-in-a-slump-and-these-analysts-dont-see-an-easy-way-out-6906acd0",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.20202020202021
    },
    {
      "title": "US Transportation chief wants civil aviation to return to zero tariffs",
      "content": "U.S. Transportation Secretary Sean Duffy said on Tuesday that he wanted civil aviation to return to a 1979 zero-tariff trade agreement but noted it is part of broader trade talks.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 11:13:29",
      "date": "17/06/2025",
      "time": "11:13",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/aerospace-defense/us-transportation-chief-wants-civil-aviation-return-zero-tariffs-2025-06-17/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.118434343434345
    },
    {
      "title": "32% of Warren Buffett's $281 Billion Berkshire Hathaway Portfolio Is Invested in These 2 S&P 500 Dividend Stocks",
      "content": "Berkshire Hathaway (BRK.A -0.97%) (BRK.B -0.92%) CEO Warren Buffett has steered his company to market-crushing performance over multiple decades -- so much so that he has earned the nickname \"the Oracle of Omaha.\" When he steps down from his role as the company's chief executive at the end of this year, it will mark the close of one of the most fantastic corporate leadership runs in history.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:35:00",
      "date": "04/06/2025",
      "time": "04:35",
      "category": "markets",
      "impact": "negative",
      "country": "us",
      "url": "https://www.fool.com/investing/2025/06/04/warren-buffett-berkshire-sp-500-dividend-stocks/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.09444444444445
    },
    {
      "title": "Apple loses bid to pause app store reform order in Epic Games case",
      "content": "Apple has failed to persuade a U.S. appeals court to pause key parts of a federal judge's order requiring the iPhone maker to immediately open its lucrative App Store to more competition.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 17:10:52",
      "date": "04/06/2025",
      "time": "17:10",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-loses-bid-pause-app-store-reform-order-epic-games-case-2025-06-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.019444444444446
    },
    {
      "title": "Digital health company Omada valued at $1.3 billion as shares jump in Nasdaq debut",
      "content": "Shares of Omada Health rose 21% in their Nasdaq debut on Friday, valuing the virtual chronic care provider at $1.28 billion.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 11:54:39",
      "date": "06/06/2025",
      "time": "11:54",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/digital-health-company-omada-valued-13-billion-shares-jump-nasdaq-debut-2025-06-06/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "healthcare"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.82929292929293
    },
    {
      "title": "Remy Cointreau scraps 2030 goals amid tariffs, slow US",
      "content": "Remy Cointreau on Wednesday abandoned its 2030 sales growth ambitions, saying tariffs and persistently slow U.S. sales could derail its plans for this financial year and beyond.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 01:34:56",
      "date": "04/06/2025",
      "time": "01:34",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/china/remy-cointreau-withdraws-its-mid-term-goals-posts-lower-annual-profits-2025-06-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.1280303030303
    }
  ],
  "france": [
    {
      "title": "QQQI vs. JEPQ: Which ETF is the True Dividend King?",
      "content": "Key Points The NASDAQ-100 is a volatile index that offers considerable long term upside amidst its intraday turbulence. Use of financial derivatives for both risk mitigation and for potentially larger leveraged gains has become routine in the financial world, especially for QQQI and JEPQ. To qualify as a “Dividend King”, a stock must have a track record of 50 or more consecutive years of dividend increases due to the underlying issuing company’s intrinsic growth. ETF “dividend kings” are metaphorical, but may reference a head to head comparison. Are you ahead or behind on your retirement goals? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted and must act in your best interests. Don’t waste another minute – get started by clicking here.(Sponsor) Seven of the top largest S&amp;P 500 stocks by market cap are tech industry companies that have been dubbed “The Magnificent 7” due to their remarkable tandem bull run over the past several years. These stocks are:: Apple, Amazon, Alphabet (Google), Microsoft, Meta Platforms (Facebook), Nvidia, and Tesla. In order to give better focus on the tech and other higher growth sectors, which tend to be listed on NASDAQ, the NASDAQ-100 index was created to track the top 100 NASDAQ listed companies that are not in the financial sector, as the tech emphasis also purports to emphasize innovation and new products instead of financial companies, which ostensibly do not. The launch of Exchange Traded Funds (ETFs) that track the NASDAQ-100 index was a foregone conclusion, and several of them already vie for investor dollars on a daily basis. Two that have exhibited sizable growth but have been able to augment their gains in the form of dividends, are: The NEOS Nasdaq-100 High Income ETF (NASDAQ: QQQI), and the JP Morgan Nasdaq Equity Premium Income ETF (NASDAQ: JEPQ). Ironically, both indexes generate their high yields through strategic innovations that rival those in the tech sector, in terms of their potential to deliver performance enhancements for their assigned tasks. How QQQI and JEPQ Compare &#8211; An Overview Both QQQI and JEPQ track the NASDAQ 1oo ETF, which is very volatile, due to its heavy weighting in the technology sector. Both ETFs are still relatively young. QQQI only launched in January, 2024 and JEPQ began in May, 2022. The following details are based on market price at the time of this writing: Category QQQI JEPQ Yield 14.55% 11.28% Net Assets $1.76 billion $26.27 billion Average Daily Volume 970,269 shares 7.29 million shares Expense Ratio 0.68% 0.35% Beta 0.00 0.83 52-week range 41.17-54.47 44.31-58.54 1-year return 14.37% 7.69% 1-year trailing return 15.24% 8.49% 3-year return n/a 14.40% Largest Hedge Fund Holder Second Half Financial Ptnrs Fisher Asset Mgmt. Sector Weighting #1 Technology &#8211; 52.41% Technology &#8211; 51.41% Sector Weighting #2 Communication Svc &#8211; 16.09% Communication Svc &#8211; 15.90% Sector Weighting #3 Consumer Cyclical &#8211; 12.85% Consumer Cyclical &#8211; 14.60% JEPQ Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 7.49% NVDA Nvidia Corp 7.35% AAPL Apple, Inc. 6.47% AMZN Amazon 4.92% GOOG Alphabet Class C 3.99% QQQI Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 8.61% NVDA Nvidia Corp 8.30% AAPL Apple, Inc. 7.59% AMZN Amazon 4.87% AVGO Broadcom 4.74% Strategic Differences Although they both utilize covered call options for creating dividends, JEPQ&#8217;s use of ELNs is more conservative than QQQI&#8217;s direct trading of out of the money calls in addition to its portfolio covered call writing. Both JEPQ and QQQI utilize option strategies to artificially create dividends for their shareholders. However there are both mechanical and risk/reward differences in their respective approaches. JEPQ uses Equity Linked Notes (ELNs), which are synthetic financial products created by financial institutions, and are linked to a particular index or stock. ELNs usually have a call option attached to a principal protection component, and can be likened to a short-term zero-coupon bond with a maturity of no longer than a few months. The returns on the ELN are linked to the underlying index or stock. Additionally, most, if not all ELNs are purchased directly from the issuer and held to maturity. There is no secondary market for ELNs. JEPQ manager Hamilton Reiner staggers one-month calls into multiple weekly buckets, then diversifies the expiration dates and strike prices. However, Reiner conducts this strategy with purchases of ELNs that give the JEPQ exposure to the profits on those call options, without the risk of any of the top tech stock holdings being subject to calls if the market takes off and the calls go in-the-money. Conversely, QQQI also utilizes a covered call strategy, in addition to out of the money call purchases to augment upside gains. QQQI writes their covered calls directly against the NASDAQ-100 index up to 100% of the equity value of total QQQI holdings. The fund then uses a portion of their covered call premium income to purchase out of the money call options. This give it the following result scenarios: If the market ends relatively flat, QQQI has kept the premium income minus the cost of the out of the money options. If the market jumps up, the underwritten covered call is already hedged against stocks, but QQQI can take profit on the out of the money call that ostensibly would be in the money due to the jump. Overall Analysis and The King of the Hill In This Competition For 1 year&#8217;s yield comparison, QQQI wins the &#8220;King of the Hill&#8221; contest against JEPQ, but has 49 years to go of upping the yield ante annually before being able to claim a &#8220;Dividend King&#8221; title. Selling covered calls is considered a viable strategy to mitigate volatility and take advantage of market volatility, which usually means increased delta and subsequently larger premiums. However, there is a reason why there is a sizable enough market on the buy side &#8211; there are enough people who think the option will increase in value. However, selling calls can limit interim upside, especially if the goal is for the option to expire worthless so the same underlying securities can cover another call writing opportunity next month. President Thomas Jefferson was once quoted, “ With risk comes great reward.” QQQI’s superior yield is a testament to the reward from being more aggressive and taking on more risk than JEPQ. However, with only slightly over 1 years’ worth of trading history and returns from which to judge, QQQI may be the dividend “king of the hill” only for the moment. Whether a consistent track record can be built or not on the QQQI strategy model, which needs to be actively managed by their presumably disciplined managers, remains to be seen. Since both companies’ dividends are artificially created through trading against market volatility, as opposed to intrinsic enhanced value through a business, the ability for JEPQ and QQQI rests solely on skill and knowledge of its managers. If they can first reach Dividend Aristocrat status (25 or more years of consecutive, annual dividend increases), then perhaps a hypothetical Dividend King discussion (50 consecutive years or more of dividend increases) can be had. The post QQQI vs. JEPQ: Which ETF is the True Dividend King? appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://247wallst.com/investing/2025/06/10/qqqi-vs-jepq-which-etf-is-the-true-dividend-king/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 44.54545454545455
    },
    {
      "title": "OECD Slashes Global Economic Forecasts Amid Tariffs, Trade Uncertainty",
      "content": "OECD Chief Economist Alvaro Santos Pereira discusses the Paris-based organization's decision to slash its global economic growth forecast to 2.9% this year, down from 3.3% in 2024. \"There's been a huge increase in trade and economic policy uncertainty,\" he tells Bloomberg Television.",
      "source": "youtube.com",
      "rawDate": "2025-06-03 05:40:39",
      "date": "03/06/2025",
      "time": "05:40",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=E-sUVQdcV3A",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.91010101010101
    },
    {
      "title": "OECD chops U.S. growth forecasts, cites risks to the downside as tariffs bite",
      "content": "The Paris-based global policy forum now sees U.S. growth at just 1.6% this year, and global growth at 2.9%.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-03 05:02:00",
      "date": "03/06/2025",
      "time": "05:02",
      "category": "economy",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/oecd-chops-u-s-growth-forecasts-cites-risks-to-the-downside-as-tariffs-bite-42be736c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 10.130555555555556
    }
  ],
  "uk": [
    {
      "title": "Trading Day: War fears crush confidence",
      "content": "A week that started with investors in a reasonably optimistic mood, betting that the U.S. and China would strike a deal in their trade talks in London, ended on a sour note as Israel's strike on Iran sparked a sharp rise in oil prices and a selloff in world stocks.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 16:34:25",
      "date": "13/06/2025",
      "time": "16:34",
      "category": "markets",
      "impact": "positive",
      "country": "uk",
      "url": "https://www.reuters.com/business/autos-transportation/global-markets-trading-day-graphic-2025-06-13/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 43.917929292929294
    },
    {
      "title": "Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector",
      "content": "Live Updates Live Coverage Has Ended Apple Pipeline 12:47 pm by Gerelyn Terzo Apple&#8217;s (Nasdaq: AAPL) Worldwide Developers Conference (WWDC) will spotlight announcements from CEO Tim Cook relating to updates to the company&#8217;s operating systems for iPhones, iPads, Macs, etc. Apple is also expected to provide updates on AI software Apple Intelligence, including changes and improvements. The unveiled software and features are expected to be available for legacy hardware in the fall, coinciding with the next iPhone launch. The Nasdaq Composite is now up 0.40%, while Apple stock is gaining 0.35%. Easing Inflation 11:08 am by Gerelyn Terzo Inflation showed signs of easing in May, with the New York Fed Survey of Consumer Expectations index falling to 3.2%—a 0.4 percentage point drop from April levels. This improvement follows progress made by the Trump administration with U.S. trade partners. The Nasdaq Composite is up 0.43%. Wall Street Cautious on MCD 10:02 am by Gerelyn Terzo Morgan Stanley has turned more cautious on fast-food giant McDonald&#8217;s (NYSE: MCD), downgrading shares to an &#8220;equal weight&#8221; rating from &#8220;overweight,&#8221; citing &#8220;structural pressures on fast food.&#8221; The Wall Street firm lowered the price target by $5 to $324 per share. MCD stock is down 2% today. This article will be updated throughout the day, so check back often for more daily updates. Technology stocks are mostly higher today, setting a positive tone for the broader markets. U.S. and Chinese officials are expected to restart trade discussions today in Europe. Big Tech stock Apple (Nasdaq: AAPL) is gearing up for its developer conference, called WWDC, today, featuring a keynote speech from CEO Tim Cook. The markets will be listening for any advancements on AI innovation. The three major stock market averages are higher out of the gate, with the Dow Jones Industrial Average, Nasdaq Composite and S&amp;P 500 all posting gains. All sectors of the economy are higher as sentiment looks up to start the week. The S&amp;P 500 is trading back above the psychologically important 6,000 level, powered in part by chip stocks including Advanced Micro Devices (Nasdaq: AMD), which is tacking on 3.4% today. While tech as a sector is moving higher, one Magnificent 7 stock being left out of the gains is Tesla (Nasdaq: TSLA), which is down 3.9%. Wall Street analysts downgraded the EV stock due to the distraction of tensions between CEO Elon Musk and President Trump. On the economic front, the latest inflation data is expected mid-week when the latest Consumer Price Index and Producer Price Index results for May will be revealed. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 39 (+0.09%) Nasdaq Composite: Up 23.50 (+0.11%) S&amp;P 500: Up 9 (+0.15) Market Movers Meta Platforms (Nasdaq: META) is in discussions to potentially back AI startup Scale AI with a $10 billion-plus investment, according to a Bloomberg report. Archer Aviation (NYSE: ACHR) is gaining 5% today as its piloted flight program gains momentum in the U.S. and UAE markets. Quantum computing stock IonQ (NYSE: IONQ) is gaining 3% after announcing a deal to acquire London’s Oxford Ionics in a billion-dollar transaction. The post Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/09/live-nasdaq-composite-markets-stay-hopeful-in-big-week-for-tech-sector/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 43.151515151515156
    },
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Broader Market Recaptures 6000 Level in Mixed Session",
      "content": "Live Updates Live Coverage Has Ended Corporate America Turns Positive on Economy 12:52 pm by Gerelyn Terzo In Chief Executive Group&#8217;s latest poll, taken a week ago, under 30% of CEOs anticipate a mild or severe recession in H2 2025. This is a significant shift from April, when over 60% held that view, a time when tariffs had businesses more concerned. The SPY is now up 0.23%. Cooling Inflation 11:12 am by Gerelyn Terzo The New York Fed Survey of Consumer Expectations index indicated cooling inflation in May, dropping 0.4 percentage points from April to settle at 3.2%. This decline comes as the Trump administration made strides with U.S. trade partners. The SPY ETF is up 0.11% at last check. Bearish on MCD 10:30 am by Gerelyn Terzo Morgan Stanley has turned cautious on fast-food giant McDonald’s (NYSE: MCD), downgrading the stock to an “equal weight” rating from “overweight,&#8221; saying the company is vulnerable to “structural pressures on fast food.” The analyst lowered the price target on MCD to $324 per share, which still reflects upside potential. MCD stock is down 2% today to trade at $301 per share. This article will be updated throughout the day, so check back often for more daily updates. The S&amp;P 500 is trading back above the psychologically sensitive 6,000 level once again as the markets keep it together. U.S. and Chinese officials are expected to restart trade discussions in Europe today. Big Tech&#8217;s Apple (Nasdaq: AAPL) is gearing up for its developer conference, WWDC, today, featuring a keynote speech from CEO Tim Cook. The markets are awaiting any advancements on AI innovation. After starting the trading session higher out of the gate, the three major stock market averages have turned mixed. While the S&amp;P 500 and Nasdaq Composite are holding onto slight gains, the Dow Jones Industrial Average has turned modestly lower. The SPDR S&amp;P 500 ETF (SPY) is up 0.15%). Chip stocks are higher, including a 3.4% gain in Advanced Micro Devices (Nasdaq: AMD). Magnificent 7 stock Tesla (Nasdaq: TSLA) is under pressure, falling 3.9%. Analysts turned skeptical on the EV stock, citing distractions stemming from tensions between CEO Elon Musk and President Trump. On the economic front, key inflation data is anticipated mid-week with the release of the Consumer Price Index and Producer Price Index results for May. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 117.74 (-0.28%) Nasdaq Composite: Up 86.85 (+0.42%) S&amp;P 500: Up 5.19 (+0.09%) Market Movers Meta Platforms (Nasdaq: META) is reportedly in talks to invest over $10 billion in AI startup Scale AI, per Bloomberg. Archer Aviation (NYSE: ACHR) is climbing 5% higher today as its piloted flight program picks up speed in both the U.S. and UAE. Quantum computing stock IonQ (NYSE: IONQ) advanced 3% after revealing a billion-dollar deal to acquire London-based Oxford Ionics. The post S&#038;P 500 (NYSEARCA: SPY) Live: Broader Market Recaptures 6000 Level in Mixed Session appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-10 11:04:10",
      "date": "10/06/2025",
      "time": "11:04",
      "category": "crypto",
      "impact": "negative",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/09/sp-500-nysearca-spy-live-sp-500-recaptures-6000-level-in-mixed-session/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 41.015151515151516
    },
    {
      "title": "Trump’s Fellow College Alumni is Quite The List",
      "content": "The 45th and 47th President of the United States, Donald Trump, is famously known for attending the University of Pennsylvania. Having started his college career at Fordham University, the president left Fordham after two years and went on to earn a degree from the University of Pennsylvania, a prestigious Ivy League institution. Key Points The President of the United States attended one of the nation’s most prestigious universities. The president isn’t the only famous graduate to have attended this school. Titans of industry and even a famous game maker are all graduates of the same school that the president attended. 4 million Americans are set to retire this year. If you want to join them, click here now to see if you’re behind, or ahead. It only takes a minute. (Sponsor) If you’re already familiar with the University of Pennsylvania, you know that the Wharton School, where the president graduated, is famously difficult to get into. This is considered one of the nation&#8217;s best business schools, and the president is far from being the only notable graduate. 20. Ivanka Trump Ivanka Trump, an American businesswoman, is the second-oldest child of President Donald Trump. A senior advisor in her father’s first administration, Ivanka also served as a boardroom judge on her father’s show, The Apprentice. She now serves as an executive vice president of the Trump Organization. 19. Donald Trump Jr. The firstborn son of the president, Donald Trump Jr., currently serves as an executive vice president of the Trump Organization. Running the company alongside his brother, Eric, Trump graduated from the Wharton School in 2000 with a Bachelor of Science in Economics. 18. Ron Perelman Investor, banker, businessman, and philanthropist are just a few of the words to describe Ron Perelman. Graduating from the University of Pennsylvania with an MBA, Perelman has held or currently holds positions in companies such as Revlon, RetailMeNot, Valassis, Scientific Games Corporation, and others. 17. Alex Gorsky Serving as the CEO of Johnson &amp; Johnson since 2012, Alex Gorsky graduated from Wharton in 1996. In addition to his role at J&amp;J, Gorsky serves as a board director at Apple and JP Morgan Chase, and spoke at the school’s 2022 MBA graduation ceremony. 16. Mark Pincus Mark Pincus, the man responsible for the Farmville craze during Facebook&#8217;s early days, is the founder of Zynga. One of the world’s best-known mobile social gaming companies, Pincus left his role in 2016. Pincus would later go on to co-found an investment firm with investments in companies such as Lyft, SpaceX, and Oscar Health. 15. Laurene Powell Jobs Billionaire and philanthropist Laurene Powell Jobs is the widow of Steve Jobs, former co-founder and CEO of Apple. Managing the Steve Jobs Trust, Jobs graduated from the University of Pennsylvania in 1985 and later founded the Emerson Collective, which she uses to support organizations like The Atlantic and Axios. Powell also owns a 20% stake in Monumental Sports &amp; Entertainment, which owns multiple sports teams. 14. Brian L. Roberts Brian L. Roberts, the chairman and CEO of Comcast, is an American businessman and billionaire. Attending school at the University of Pennsylvania, not too far away from where he was born, Roberts took over Comcast from his father. He was named the president of Comcast in 1990 and became CEO in 2002. Julian A. Brodsky, Robert’s father’s partner in founding Comcast, also attended the Wharton School. 13. Mort Zuckerman Mort (Moritmer) Zuckerman, the owner of Boston Properties, one of the world&#8217;s largest real estate investment trusts, is another MBA graduate of the University of Pennsylvania. He currently owns the U.S. News &amp; World Report, having previously owned The Atlantic and Fast Company. 12. Josh Harris Josh Harris, the founder of private equity firm Apollo Global Management, is one of the world’s wealthiest individuals. He currently has ownership stakes in the Philadelphia 76ers basketball team, the New Jersey Devils hockey team, and the NFL’s Washington Commanders. Harris holds an economics degree from the Wharton School, which he earned in 1986. 11. Steve Cohen Graduating with an economics degree from the Wharton School, Steve Cohen is a billionaire businessman. The owner of the New York Mets baseball team, Cohen, is the founder of S.A.C. Capital Advisors. Cohen famously played a role in supporting Ken Griffin’s Citadel short squeeze of GameStop with Gabe Plotkin. According to Forbes, Cohen has a current net worth of $21.3 billion. 10. Robert Crandall Widely regarded as the creator of the frequent flyer program, Robert Crandall was the former president and chairman of American Airlines. Considered a titan of the industry, Crandall created the AAdvantage program, which was the first major mileage-reward frequent flyer program in the airline industry. 9. Edmund T. Pratt Jr. Edmund T. Pratt Jr., the former Chairman and CEO of Pfizer Inc., served as CEO from 1972 to 1991 and as Chairman until 1992. An MBA graduate of the University of Pennsylvania, Pratt played a pivotal role in transforming Pfizer into a global pharmaceutical giant. Under his leadership, annual revenue increased from $1 billion to nearly $7 billion. 8. Elon Musk The current world’s wealthiest person, Elon Musk, is everywhere and seemingly has his hand in everything. As of June 2025, Elon Musk has an estimated net worth of approximately $409 billion, making him one of the wealthiest individuals in recorded history. The CEO of Tesla, SpaceX, and xAI, Musk, was an initial big player in the President’s current administration, overseeing the DOGE office before stepping away. 7. William Wrigley Jr. II The former chairman and CEO of William Wrigley Jr. Company, William Wrigley Jr. II, is the great-grandson of the company founder. Receiving his undergraduate degree from Duke, Wrigley received his MBA from the University of Pennsylvania. The company secured Altoids and Life Savers during his tenure, before selling them to Mars Candy for $23 billion, earning himself an estimated $3 billion. 6. Sundar Pichai An MBA graduate in 2002, the current CEO of Alphabet, Sundar Pichai, received his degree from the University of Pennsylvania. Joining Google in 2004, he was appointed as the company&#8217;s CEO after Eric Schmidt stepped down in 2015. Among his notable contributions, Pichai has played a key role in the development of Gmail, Google Maps, Google Drive, Chrome OS, and Google Chrome. 5. Anil Ambani An Indian billionaire, Anil Ambani, is the chairman and managing director of the Reliance Group, one of India’s most notable corporations. His net worth as of early June 2025 is estimated to be around $3 billion. At one point, Ambani was ranked as the sixth wealthiest person in the world, having received his MBA from the University of Pennsylvania. 4. Peter Lynch One of the most prolific investors of the modern day, Peter Lynch, a Wharton School MBA graduate, previously managed the Magellan Fund. A fund held by Fidelity Investments, Lynch famously averaged a 29.2% annual return between 1977 and 1990. During this time at the company, Lynch increased assets under management from $18 million to $14 billion. 3. John Sculley The man best known for firing Steve Jobs from Apple, John Sculley, attended the University of Pennsylvania. Famously leaving his role as the President of PepsiCo to take on the CEO role at Apple in 1983, Sculley stayed with the company for 10 years. For a time, Sculley was Silicon Valley’s highest-paid executive, earning $10.2 million annually. 2. JD Power James David Power III, another famous graduate of the University of Pennsylvania, also attended the Wharton School, earning an MBA in Finance. After joining Ford Motor Company, J.D. Power would go on to launch J.D. Power and Associates in 1968. Today, J.D. Power is a leading analytics firm that tracks trends across various industries, including automobiles, financial services, telecommunications, and many others. 1. President Donald Trump Starting at Fordham University in 1964, the president stayed at the school for two years before transferring to the University of Pennsylvania in 1966. After graduation, Trump famously went on to extend his father’s real estate empire, open up numerous businesses, host a popular TV show, and, of course, ascend to the highest office in the land. The post Trump&#8217;s Fellow College Alumni is Quite The List appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-23 10:00:07",
      "date": "23/06/2025",
      "time": "10:00",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/education/2025/06/22/the-college-where-trump-graduated-and-its-other-famous-graduates/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 36.92424242424242
    },
    {
      "title": "UK auto production for May slumps to lowest level since 1949 as Trump tariffs hit hard",
      "content": "The U.K.'s new car and commercial vehicle production volumes fell by 32.8% to 49,810 units last month, according to the Society of Motor Manufacturers and Traders (SMMT). It means that excluding 2020, when factories were shuttered during Covid-19 lockdowns, U.K. vehicle output in May collapsed to its lowest level since 1949.",
      "source": "cnbc.com",
      "rawDate": "2025-06-27 02:47:36",
      "date": "27/06/2025",
      "time": "02:47",
      "category": "markets",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.cnbc.com/2025/06/27/trump-tariffs-uk-car-and-vehicle-output-falls-to-76-year-low-in-may.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.01161616161616
    },
    {
      "title": "S&P and Nasdaq sit in the red ahead of CPI data and Wall Street opening bell",
      "content": "US stock futures were pointing to a small decline on Wednesday morning, while traders awaited key inflation data ahead of the opening bell. Investors also were digesting the limited progress from US-China trade talks in London.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-11 08:24:08",
      "date": "11/06/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.proactiveinvestors.com/companies/news/1072779",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.433585858585857
    },
    {
      "title": "UK escapes Trump's increased 50% tariffs - but White House warns the exemption is conditional",
      "content": "The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned.",
      "source": "news.sky.com",
      "rawDate": "2025-06-04 02:55:36",
      "date": "04/06/2025",
      "time": "02:55",
      "category": "companies",
      "impact": "positive",
      "country": "uk",
      "url": "https://news.sky.com/story/trade-war-uk-exemption-from-50-steel-tariffs-is-conditional-trump-warns-13378892",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.84873737373737
    }
  ],
  "germany": [
    {
      "title": "Jim Cramer: ‘Trump Discount’ Is Hurting Markets",
      "content": "Key Points in This Article: CNBC’s Mad Money host Jim Cramer is often criticized for inaccurate stock picks that inspire routine bets against his calls as a better way to beat the market. Due to his unreliable predictions and over-the-top policy complaints, investors would be better served by focusing on company fundamentals. Nvidia made early investors rich, but there is a new class of &#8216;Next Nvidia Stocks&#8217; that could be even better. Click here to learn more. A Controversial Track Record Jim Cramer is a polarizing figure in financial media, known for hosting CNBC’s Mad Money and co-anchoring Squawk on the Street. A Harvard-educated former hedge fund manager, Cramer’s high-energy stock picks and market commentary have made him a household name among retail investors. However, his predictions are frequently criticized for their inconsistency, with many noting he’s often wrong about his stock calls. This reputation led to the creation of the Inverse Cramer ETF, which aimed to profit by betting against his recommendations. Although the ETF shut down due to lack of interest, an X account named “Inverse Cramer” continues to mock his calls, highlighting his spotty track record. Cramer’s bold, sometimes erratic takes &#8212; such a a recent essay he wrote on a so-called “Trump discount” &#8212; often spark debate, with critics pointing to his tendency to overemphasize short-term noise over long-term fundamentals, making his advice a risky bet for investors. Cramer’s “Trump Discount” Thesis In his June 1 article, Jim Cramer argues that a “Trump discount” is suppressing U.S. stock market performance due to the unpredictability of President Trump’s policies. He contrasts Europe’s “consistency of mediocrity” with U.S. volatility, claiming the White House’s immense power creates instability. Cramer cites examples across sectors: Nvidia’s (NASDAQ:NVDA) gains were short-lived due to policy uncertainty; retail stocks like Walmart (NYSE:WMT) face tariff-related confusion; drug companies suffer from shifting Medicare pricing policies and vaccine skepticism; food companies like Campbell’s (NYSE:CPB) face regulatory pressure from RFK Jr.; Apple (NASDAQ:AAPL) struggles with Trump’s push for U.S.-only manufacturing; software and internet giants like Salesforce (NYSE:CRM) and Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) face unexpected scrutiny; banks see no regulatory relief; mergers and acquisitions are stalled by unpredictable cash flows; and energy stocks, despite Trump’s pro-drilling stance, lack momentum due to high costs and regulatory hurdles. Cramer predicts continued market declines, noting a recent 1% S&amp;P 500 drop, exacerbated by mixed signals about U.S.-China trade talks. Flaws in Cramer’s Argument Cramer’s thesis appears flawed for several reasons. First, his “Trump discount” overstates the impact of presidential policies on broad market performance. The S&amp;P 500, far from being discounted, has gained since he wrote his article, and is near record highs, contradicting his bearish outlook. Second, his sector-specific arguments lack depth. Nvidia’s volatility is more tied to market cycles and competition than Trump’s policies. Retailers like Costco (NASDAQ:COST) and TJX (NYSE:TJX) have thrived despite tariff fears, with Costco’s stock rising due to strong fundamentals, not a “Trump premium.” Third, Cramer’s focus on short-term policy noise ignores long-term drivers like corporate earnings and consumer demand. His concerns about drug stocks, which he ties to RFK Jr.’s influence, overstate the impact of unconfirmed regulatory changes, since Medicare negotiation frameworks remain complex and slow-moving. Similarly, his critique of Apple misinterprets global supply chain dynamics; India’s manufacturing shift is a strategic diversification, not a policy misstep. Cramer’s Track Record and Market Misreads Cramer’s historical inaccuracy fuels skepticism. The Inverse Cramer ETF, though defunct, capitalized on his poor track record, and the ongoing X account highlights his frequent misses. His alarmist tone, comparing Trump’s influence to Andrew Jackson’s era, exaggerates political impact while downplaying market resilience. For instance, energy stocks’ stagnation is less about Trump’s policies and more about global oil prices and ESG pressures, which Cramer barely addresses. His claim that Europe’s markets outperform due to “consistency” ignores their own challenges, like Germany’s 2025 economic slowdown. By fixating on sensationalized policy risks, Cramer overlooks broader market trends, such as technology-driven gains and robust consumer spending, which have propelled the S&amp;P 500 upward. Key Takeaways As always, focus on fundamentals, not noise. Investors should tune out sky-is-falling narratives like Cramer’s, which amplify short-term concerns over fundamentals. However, blind optimism about endless market gains is equally misguided. Markets naturally rise and fall, influenced by policies but driven by earnings, innovation, and economic cycles. While presidential actions, like tariffs or deregulation, can create volatility, they don’t dictate long-term outcomes. Investors would do well to focus on business fundamentals &#8212; revenue growth, profit margins, and competitive advantages &#8212; rather than reacting to pundits like Cramer. Consistent, long-term investing, diversified across sectors, remains the most reliable path to wealth creation, regardless of political headlines. The post Jim Cramer: &#8216;Trump Discount&#8217; Is Hurting Markets appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-26 10:02:27",
      "date": "26/06/2025",
      "time": "10:02",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/26/jim-cramer-trump-discount-is-hurting-markets/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 63.42424242424242
    },
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Apple in Crosshairs 2:11 pm by Gerelyn Terzo Apple (Nasdaq: AAPL) stock has a target on its back. Wall Street firm Needham has downgraded shares of the Big Tech stock to &#8220;hold&#8221; from &#8220;buy,&#8221; arguing the stock is hovering at frothy levels. Needham also pulled its $225 price target, noting a $170-$180 range would be an acceptable entry point. Apple shares were largely unchanged today, while the SPY ETF is up 0.26%. Citi Takes Aim at CEG 11:35 am by Gerelyn Terzo Wall Street analyst firm Citi has reduced its rating on Constellation Energy (NYSE: CEG) shares in response to the utility&#8217;s long-term power agreement with Mag 7 stock Meta (Nasdaq: META). Analysts at Citi now classify CEG stock as high-risk, arguing that the company will forgo the opportunity for premium pricing on its nuclear-generated electricity. They have set a price target of $318. CEG shares are falling 3% today after yesterday&#8217;s rock-star performance. The SPY ETF is up 0.16% as of mid-morning trading. S&amp;P Outlook Looking Up 10:05 am by Gerelyn Terzo With the first half of 2025 almost behind us, Wall Street analysts are actively revising their year-end market forecasts. Most recently, Barclays has adjusted its S&amp;P 500 year-end outlook upward by nearly 3% to 6,050, a notable increase from its previous target of 5,900. Beyond Barclays, other prominent analyst firms like Deutsche Bank and RBC have also recently elevated their 2025 S&amp;P 500 targets, signaling a positively shifting consensus for the broader market&#8217;s direction. This article will be updated throughout the day, so check back often for more daily updates. Market optimism is overriding underwhelming labor market data, with all three major stock averages climbing higher as of morning trading. Yesterday, equities staged a turnaround, as the Dow Jones Industrial Average notched its fourth consecutive winning session, while the tech-heavy Nasdaq Composite and S&amp;P 500 also advanced. Today, most economic sectors are in positive territory, with technology leading the charge with a 1.48% gain. The SPDR S&amp;P 500 ETF (SPY) is up 0.11%) Nvidia (Nasdaq: NVDA) has surpassed Microsoft (Nasdaq: MSFT) to reclaim its position as the world&#8217;s most valuable company, now boasting a market capitalization of $3.45 trillion. Traders and investors are betting whether NVDA stock can clinch new highs soon. Private Payrolls Slow, Sparking Rate Cut Calls Private sector hiring lost significant momentum in May, with payrolls expanding by a mere 37,000 jobs. These results not only fell short of April&#8217;s 60,000 gain but also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. Following this weaker-than-expected private sector jobs data, President Trump is increasing pressure on Jerome Powell to lower interest rates, asserting that the Fed chairman should have already taken this action. Discount Retailers Rally, ON Semi Recovers Dollar General (NYSE: DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on the back of a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is also gaining 6% today, buoyed by similarly upbeat guidance. ON Semi (Nasdaq: ON) is climbing 2.7% today, recouping some recently lost ground. This comes after Morgan Stanley analysts recently indicated that much of the negative sentiment is already factored into ON&#8217;s stock price. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/sp-500-nysearca-spy-live-markets-show-resilience-in-face-of-sputtering-economy/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 59.015151515151516
    },
    {
      "title": "Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Sour Apple 2:05 pm by Gerelyn Terzo One Wall Street analyst firm is taking aim at Big Tech stock Apple (Nasdaq: AAPL). Needham analysts believe AAPL shares are too frothy, downgrading shares to &#8220;hold&#8221; from &#8220;buy.&#8221; The analyst firm also withdrew its price target of $225 per share, saying that the $170-$180 range reflects a more reasonable entry point. AAPL shares are relatively flat today. The Nasdaq Composite is holding onto a gain of 0.43%. Citi Downgrades This Nuclear Stock 11:30 am by Gerelyn Terzo Wall Street firm Citi has downgraded shares of Constellation Energy (NYSE: CEG) on the heels of the utility&#8217;s long-term power arrangement with Big Tech company Meta (Nasdaq: META). Citi analysts attached a high-risk label to CEG stock, saying that it will miss out on premium pricing for its nuclear power, with a price target of $318. After yesterday&#8217;s rally, CEG shares are falling 2.8% today. The Nasdaq Composite is up 0.25% as of mid-morning trading. Wall Street Improves Market Outlook 9:51 am by Gerelyn Terzo With the first half of 2025 nearly in the rearview mirror, Wall Street analysts are coming out in droves to revise their year-end forecasts. Most recently, Barclays has updated its S&amp;P 500 year-end outlook by close to 3% to 6,050 compared with a previous target of below 6,000. In addition to Barclays, other analysts firms that have lifted their 2025 S&amp;P 500 targets of late include Deutsche Bank and RBC. This article will be updated throughout the day, so check back often for more daily updates. The markets appear to be shrugging off some lackluster labor market data, with all three of the major stock market averages higher as of early morning trading. Yesterday, the markets managed to turn things around, with the Dow Jones Industrial Average tacking on its fourth-straight winning session while the tech-heavy Nasdaq Composite and S&amp;P 500 also gained ground. Today, most sectors of the economy are higher, led by technology with a 1.48% advance. Nvidia&#8217;s (Nasdaq: NVDA) muscled Microsoft (Nasdaq: MSFT) out of the way to reclaim the top of the most valuable company in the world rankings, with a market capitalization of $3.45 trillion. Traders are debating whether NVDA stock will see new highs in the near future. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 62.83 (+0.22%) Nasdaq Composite: Up 50.28 (+0.26%) S&amp;P 500: Up 14.10 (+0.24%) Economic Headwinds Private sector hiring lost momentum in May, with payrolls expanding by a mere 37,000 jobs. Results fell short of April&#8217;s 60,000 gain and also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. President Trump is increasing pressure on Jerome Powell to lower interest rates following the weaker-than-expected private sector jobs data, saying the Fed chairman should have already taken this action. Market Movers Dollar General (NYSE:DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is gaining 6% on the day on similarly upbeat guidance. ON Semi (Nasdaq: ON) is gaining 2.7% today, recouping some recently lost ground. Morgan Stanley analysts recently said that negativity is already priced into ON stock. The post Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/live-nasdaq-composite-markets-look-to-extend-gains-despite-economic-headwinds/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 56.36363636363637
    },
    {
      "title": "Euro zone inflation falls to cooler-than-expected 1.9% in May, below ECB target",
      "content": "Economists polled by Reuters had been expecting the May reading to come in at 2%, which is the European Central Bank's target.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 05:04:56",
      "date": "03/06/2025",
      "time": "05:04",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/03/euro-zone-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.74393939393939
    },
    {
      "title": "Apple reveals complex system of App Store fees to avoid EU fine of 500 million euro",
      "content": "Apple Thursday made changes to its App Store European policies, saying it believes the new rules will help the company avoid a fine of 500 million euro ($585 million) from the EU for violating the Digital Markets Act. The changes Apple announced are not a complete departure from the company's previous policy that drew the European Commission's attention in the first place.",
      "source": "cnbc.com",
      "rawDate": "2025-06-26 15:00:01",
      "date": "26/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/26/apple-eu-500-million-euro-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 40.55681818181819
    },
    {
      "title": "World's biggest sovereign wealth fund says EU markets need single regulator",
      "content": "The European Union needs a single regulatory framework and to break down fragmentation across its business, tax, debt issuance and securities law systems, according to Norges Bank Investment Management. \"European markets over time have fallen behind in terms of business dynamism and the provision of new investment opportunities to institutional investors,\" NBIM will tell the European Commission in a letter this week.",
      "source": "cnbc.com",
      "rawDate": "2025-06-09 07:39:25",
      "date": "09/06/2025",
      "time": "07:39",
      "category": "markets",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/09/worlds-biggest-sovereign-wealth-fund-eu-markets-need-single-regulator.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 33.43939393939394
    },
    {
      "title": "Apple changes App Store rules in EU to comply with antitrust order",
      "content": "Apple on Thursday changed rules and fees in its App Store in the European Union after the bloc's antitrust regulators ordered it to remove commercial barriers to sending customers outside the store.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 15:13:46",
      "date": "26/06/2025",
      "time": "15:13",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/legal/litigation/apple-changes-app-store-rules-eu-comply-with-antitrust-order-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.55
    },
    {
      "title": "Top economist warns America is heading toward economic disaster the Fed can't fix",
      "content": "Euro Pacific Asset Management Chief Economist Peter Schiff warned of stagflation and possible hyperinflation, arguing higher interest rates are needed.",
      "source": "foxbusiness.com",
      "rawDate": "2025-06-18 18:45:49",
      "date": "18/06/2025",
      "time": "18:45",
      "category": "economy",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.foxbusiness.com/economy/top-economist-warns-america-heading-toward-economic-disaster-fed-cant-fix",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 27.873989898989898
    },
    {
      "title": "Trump Loves Europe's Rate Cuts. Why the Fed Should Take Cover.",
      "content": "The ECB is widely expected to lower interest rates for the eighth consecutive meeting.",
      "source": "barrons.com",
      "rawDate": "2025-06-04 20:15:00",
      "date": "04/06/2025",
      "time": "20:15",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.barrons.com/articles/trump-fed-ecb-interest-rate-27cbf628",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 27.117676767676766
    },
    {
      "title": "Dax Index News: Trade Talks and Fed Outlook Dictate DAX Forecast This Week",
      "content": "Traders eye US services PMI and ADP data as sentiment toward the DAX hinges on Fed rate cues and EU tariff negotiations.",
      "source": "fxempire.com",
      "rawDate": "2025-06-04 01:00:26",
      "date": "04/06/2025",
      "time": "01:00",
      "category": "economy",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-trade-talks-and-fed-outlook-dictate-dax-forecast-this-week-1523616",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.575757575757574
    },
    {
      "title": "Credit Spreads Are Sending A Warning Message To The Stock Market",
      "content": "Stock rally momentum has faded, with credit and FX market signals indicating the advance was likely to stall regardless of recent geopolitical events. Widening global credit spreads, especially in the U.S., Europe, and Japan, contrast with a more resilient stock market, highlighting diverging market confidence.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-17 12:01:08",
      "date": "17/06/2025",
      "time": "12:01",
      "category": "markets",
      "impact": "positive",
      "country": "germany",
      "url": "https://seekingalpha.com/article/4795450-credit-spreads-are-sending-a-warning-message-to-the-stock-market",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.306060606060605
    },
    {
      "title": "Dax Index News: Inflation, Tariffs, and Trade Set the Stage for DAX Today",
      "content": "DAX rises as Fed rate cut hopes gain traction, but trade tensions and inflation data may determine the index's short-term outlook and risk sentiment.",
      "source": "fxempire.com",
      "rawDate": "2025-06-27 00:00:52",
      "date": "27/06/2025",
      "time": "00:00",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-inflation-tariffs-and-trade-set-the-stage-for-dax-today-1529377",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.126010101010102
    },
    {
      "title": "China is trying to stimulate its economy as consumer confidence is 'flat on its back,' analyst says",
      "content": "Global investors are bracing for more tariff uncertainty as US policy remains unpredictable. TPW Advisory Founder Jay Pelosky joins Catalysts to discuss how diverging strategies in the US, Europe, and China could reshape the global economic landscape.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 13:16:32",
      "date": "16/06/2025",
      "time": "13:16",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.youtube.com/watch?v=6S3Vuj8nDa8",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 18.197222222222223
    },
    {
      "title": "Week Ahead for FX, Bonds: U.S. Jobs Data, Likely ECB Rate Cut in Focus",
      "content": "U.S. monthly jobs data for May on Friday will be key for investors as they assess the impact of U.S. tariffs on the jobs market.",
      "source": "wsj.com",
      "rawDate": "2025-05-30 13:02:00",
      "date": "30/05/2025",
      "time": "13:02",
      "category": "markets",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.wsj.com/economy/week-ahead-for-fx-bonds-u-s-jobs-data-likely-ecb-rate-cut-in-focus-06a861b0",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.476767676767675
    },
    {
      "title": "Analyzing Multiple Assets Through Scenario Analysis",
      "content": "Scenario 1 is most likely: tariffs slow the U.S. economy but avoid recession; rate cuts and fiscal support make me bullish on stocks short-term. If tariffs cause a global recession (Scenario 2), I favor short-term U.S. and European government bonds due to significant rate cuts and safe haven demand.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-24 01:54:59",
      "date": "24/06/2025",
      "time": "01:54",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://seekingalpha.com/article/4796735-analysing-multiple-assets-through-scenario-analysis",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.37878787878788
    }
  ],
  "china": [
    {
      "title": "Warren Buffett’s Best Investment Quote",
      "content": "A recent list of Warren Buffett’s best quotes includes his primary view of investing. It represents sound advice that is as good as that provided by any seasoned investor: &#8220;The first rule of an investment is don&#8217;t lose (money). And the second rule of an investment is don&#8217;t forget the first rule. And that&#8217;s all the rules there are.&#8221; 24/7 Wall St. Key Points: One of Warren Buffett’s best pieces of investment advice is not to lose money. He may have lost money on some investments, but not enough to offset his overall spectacular returns. Take this quiz to see if you’re on track to retire. (sponsored) A $100 investment in his flagship company, Berkshire Hathaway Inc. (NYSE: BRK-B), which he took over in 1965, was worth $5.5 million at the end of last year. Some of this growth is due to financial companies that he favors and has acquired. This includes insurance company GEICO and several reinsurance companies. However, the largest private corporation he owns is the massive railroad Burlington Northern Santa Fe Company. Two investments demonstrate the diversification of Buffett’s holdings. One is Apple Inc. (NASDAQ: AAPL) (some of which he sold off recently), and the other is the Chinese EV company BYD. He purchased many of his BYD shares in 2008 when the company was still an obscure carmaker. That investment of $230 million is worth $2.4 billion. BYD sells more EVs than Tesla does. Some of his investments are in America’s oldest companies. These are also some of America’s valuable and visible brands. Coca-Cola Co. (NYSE: KO) was launched in 1886. Berkshire Hathaway was a significant company before Buffett took over in 1965. Kroger Inc. (NYSE: KR) was founded in 1883. American Express Co. (NYSE: AXP) got its start in 1850. All were part of Buffett’s holdings in the first quarter of 2025. He has held some of these for most of this century. These represent part of his investment rules and philosophies. Often among the best investments are companies that have been industry giants and successful since before Buffett was born in 1930. He and his staff can examine earnings, business models, and both good and bad decisions. He can look at CEOs, both present and past, and he can sift through balance sheets. Buffett has observed the strategies of their competitors and has seen how these companies navigate business cycles, both good and bad. To be clear, Buffett likes to invest in companies that are relatively new and have been the winners in the new world of tech. This includes, among others, Amazon and Apple. As he watched Apple stock tumble, he sold off some of those holdings. Buffett has lost money on some investments, but not enough to dent his overall spectacular returns. Warren Buffett May Be Stepping Down, but Berkshire Hathaway Will Always Own These Four Dividend Giants The post Warren Buffett&#8217;s Best Investment Quote appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "crypto",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/06/16/warren-buffetts-best-investment-quote/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 41.151515151515156
    },
    {
      "title": "Apple's iPhone sales capture top spot in Chinese market in May, Counterpoint Research says",
      "content": "Apple's iPhone sales rose to the top spot in China in May, with global sales growing 15% year-on-year during April and May in the tech giant's strongest performance for the two-month period since the COVID-19 pandemic, data from Counterpoint Research showed.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 02:29:18",
      "date": "13/06/2025",
      "time": "02:29",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apples-iphone-sales-capture-top-spot-chinese-market-may-counterpoint-research-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.443939393939395
    },
    {
      "title": "Apple and Alibaba's AI rollout in China delayed by Trump's trade war, FT reports",
      "content": "Apple and Alibaba's rollout of artificial intelligence services in China is being delayed by a Beijing regulator, the Financial Times reported on Wednesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 11:56:07",
      "date": "04/06/2025",
      "time": "11:56",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apple-alibabas-ai-rollout-china-delayed-by-trumps-trade-war-ft-reports-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.35757575757576
    },
    {
      "title": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture",
      "content": "China's tech giant Alibaba has launched new Qwen3 artificial intelligence models for Apple's MLX architecture, Alibaba said in a statement on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 10:36:35",
      "date": "16/06/2025",
      "time": "10:36",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/alibaba-launches-new-qwen3-ai-models-apples-mlx-architecture-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.88358585858586
    },
    {
      "title": "Exclusive: Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
      "content": "Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 23:01:58",
      "date": "12/06/2025",
      "time": "23:01",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/foxconn-sends-97-india-iphone-exports-us-apple-tackles-trumps-tariffs-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.42146464646464
    },
    {
      "title": "Nasdaq 100: Tech Earnings Misses, Cooling Inflation, and China Tensions Shape Forecast",
      "content": "Tech stocks drag Nasdaq lower as soft PCE data boosts Fed rate cut hopes. Traders brace for June's tariff rulings and policy signals.",
      "source": "fxempire.com",
      "rawDate": "2025-05-30 12:30:44",
      "date": "30/05/2025",
      "time": "12:30",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.fxempire.com/forecasts/article/nasdaq-100-tech-earnings-misses-cooling-inflation-and-china-tensions-shape-forecast-1522939",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa",
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 27.97550505050505
    },
    {
      "title": "Retailers shift supply chains to reduce risks from Trump's tariffs on China",
      "content": "Retailers like Macy's and Target are reducing reliance on China amid Trump's trade war, restructuring supply chains to mitigate tariff impacts and potential price hikes.",
      "source": "foxbusiness.com",
      "rawDate": "2025-06-02 08:05:57",
      "date": "02/06/2025",
      "time": "08:05",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.foxbusiness.com/economy/retailers-shift-supply-chains-reduce-risks-from-trumps-tariffs-china",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "consumer",
          "industry"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.74217171717172
    },
    {
      "title": "My Dividend Stock Portfolio: New May Dividend Record - 100 Holdings With 15 Buys",
      "content": "Markets remained volatile in May 2025 amid ongoing trade tensions and mixed signals from Washington and Wall Street. While U.S.-China talks quietly resumed, tariffs persisted and business sentiment stayed cautious, contributing to investor uncertainty. May's investments added $111 in annual dividends, keeping me on track with my goal of $100+ monthly income growth and a 7.4% yield on cost.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 08:10:00",
      "date": "25/06/2025",
      "time": "08:10",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://seekingalpha.com/article/4797120-my-dividend-stock-portfolio-new-may-dividend-record-100-holdings-with-15-buys",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.51313131313131
    },
    {
      "title": "PCE Posts Highest Monthly Percentage Move in Four Years",
      "content": "The Fed's preferred measure of inflation, Personal Consumption Expenditures (PCE), are out for the month of April. Results were positive across the board — eyebrow-raisingly so, in some cases. In fact, these figures have been strong enough to cut in half the pre-market plummet on the major indexes once President Trump posted “No more Mr Nice Guy” in his trade negotiations with China.",
      "source": "zacks.com",
      "rawDate": "2025-05-30 12:01:04",
      "date": "30/05/2025",
      "time": "12:01",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.zacks.com/stock/news/2479624/pce-posts-highest-monthly-percentage-move-in-four-years?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2479624",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.238888888888887
    },
    {
      "title": "Dow Jones and Nasdaq called flat as China talks keep markets 'in limbo'",
      "content": "US stock futures were doggedly flat in the run-up to Wall Street's opening bell on Tuesday as traders sat on their hands amidst the sound of silence from China trade talks and ahead of key inflation data later in the week. Dow Jones futures were down 0.035%, while those for the S&P 500 and Nasdaq 100 were also pointing to modest drops.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-10 08:11:19",
      "date": "10/06/2025",
      "time": "08:11",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.proactiveinvestors.com/companies/news/1072697",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa",
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.587626262626266
    },
    {
      "title": "The Day Ahead: What Markets Face Today as Powell, PMI Data, and Trade Risks Take Focus",
      "content": "Markets today face pressure as U.S.-China tensions escalate, with key PMI data and Fed commentary set to shape the session's tone.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 04:35:51",
      "date": "02/06/2025",
      "time": "04:35",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.fxempire.com/forecasts/article/the-day-ahead-what-markets-face-today-as-powell-pmi-data-and-trade-risks-take-focus-1523162",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.467171717171716
    }
  ],
  "japan": [
    {
      "title": "Foreigners turn net sellers of Japan stocks for first week in 12",
      "content": "Foreigners divested Japanese stock for the first time in 12 weeks in the week through June 21 on caution over the Israel-Iran conflict and its impact on Japanese oil imports and inflation.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 00:52:14",
      "date": "26/06/2025",
      "time": "00:52",
      "category": "economy",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/business/finance/foreigners-turn-net-sellers-japan-stocks-first-week-12-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.46161616161616
    },
    {
      "title": "Apple challenges 'unreasonable' EU order to open up to rivals",
      "content": "Apple has submitted a legal challenge to an EU order to open up its closed ecosystem to rivals such as Meta and Alphabet's Google, saying the demands are unreasonable and hamper innovation.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 11:19:24",
      "date": "02/06/2025",
      "time": "11:19",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-challenges-unreasonable-eu-order-open-up-rivals-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.37348484848485
    },
    {
      "title": "Global Investing In An Age Of Geopolitical Uncertainty",
      "content": "The year 2025 has ushered in a wave of geopolitical uncertainty, with two major conflicts reshaping how investors approach the markets. Tensions in Yemen and between India and Pakistan have upended the old playbook, pushing investors to look beyond the simple labels of \"risky\" or \"safe\" assets.",
      "source": "benzinga.com",
      "rawDate": "2025-06-18 09:06:48",
      "date": "18/06/2025",
      "time": "09:06",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://www.benzinga.com/markets/equities/25/06/45994928/global-investing-in-an-age-of-geopolitical-uncertainty",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.455808080808083
    },
    {
      "title": "AAPL, GOOGL and MSFT Forecast – US Tech Giants Mixed in Premarket Trading",
      "content": "The three stocks in this analysis, Apple, Google (Alphabet), and Microsoft are a bit mixed at the moment, as we look to continue the overall momentum, or lack of in some cases, going forward. However, none of them look particularly threatened.",
      "source": "fxempire.com",
      "rawDate": "2025-06-26 08:24:47",
      "date": "26/06/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.fxempire.com/forecasts/article/aapl-googl-and-msft-forecast-us-tech-giants-mixed-in-premarket-trading-1529190",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 21.88712121212121
    }
  ],
  "emerging_markets": [
    {
      "title": "Russia fines Apple for violating 'LGBT propaganda' law, TASS reports",
      "content": "A Russian court on Tuesday fined U.S. tech giant Apple six million roubles ($76,510) for violating Russian rules on what Moscow calls \"LGBT propaganda,\" the state TASS news agency reported.",
      "source": "reuters.com",
      "rawDate": "2025-06-10 11:25:03",
      "date": "10/06/2025",
      "time": "11:25",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/sustainability/society-equity/russia-fines-apple-violating-lgbt-propaganda-law-tass-reports-2025-06-10/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.58560606060606
    },
    {
      "title": "The Bank of Mexico on Thursday lowered its benchmark interest rate by half of a percentage point in a split vote and left the door open for further cuts",
      "content": "The central bank lowered its overnight interest-rate target to 8% in split 4-1 vote.",
      "source": "wsj.com",
      "rawDate": "2025-06-26 17:48:00",
      "date": "26/06/2025",
      "time": "17:48",
      "category": "economy",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/articles/bank-of-mexico-makes-fourth-straight-half-point-interest-rate-cut-9e849d27",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": [
          "latam"
        ]
      },
      "source_type": "general_news",
      "importance_score": 23.233333333333334
    },
    {
      "title": "Senate pushes Russia tariffs that could jack up energy prices for American consumers",
      "content": "Americans may soon feel the pinch at the pump and on their utility bills, even as the Trump administration and congressional Republicans remain laser focused on boosting U.S. energy production.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 16:36:00",
      "date": "04/06/2025",
      "time": "16:36",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.marketwatch.com/story/senate-pushes-russia-tariffs-that-could-jack-up-energy-prices-for-american-consumers-e9870842",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "energy",
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 12.581565656565656
    },
    {
      "title": "Momentum Funds Are Beating the Market. How They Do It.",
      "content": "Momentum wasn't only the best-performing domestic market factor in 2024, but also in non-U.S. developed markets and emerging markets.",
      "source": "barrons.com",
      "rawDate": "2025-06-25 02:30:00",
      "date": "25/06/2025",
      "time": "02:30",
      "category": "markets",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.barrons.com/articles/momentum-funds-beating-stock-market-865f309b",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 9.00580808080808
    },
    {
      "title": "Weekly Market Pulse: The Turkey Leg",
      "content": "Israel and Iran are going at it every day, and all the dollar could manage was a measly 0.5% gain on the week. Stocks were down last week, but diversified investors benefitted from a rise in commodity prices and a small gain in bonds.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-23 04:09:00",
      "date": "23/06/2025",
      "time": "04:09",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://seekingalpha.com/article/4796464-weekly-market-pulse-the-turkey-leg",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 8.710606060606061
    },
    {
      "title": "Exceptionalism starts to happen in some emerging markets, such as Vietnam: Portfolio manager",
      "content": "Steven Quattry, Morgan Stanley Investment Management says a number of emerging markets are undergoing structural reforms, hence attracting foreign capital.",
      "source": "youtube.com",
      "rawDate": "2025-06-25 21:20:27",
      "date": "25/06/2025",
      "time": "21:20",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.youtube.com/watch?v=C-JMcmWHytY",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 8.218434343434343
    }
  ],
  "global": [
    {
      "title": "The World’s Richest Don’t Have to Be Tech Founders, Look at Steve Ballmer",
      "content": "The sixth richest person in the world is former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer. He has a net worth of $164 billion, below that of his former boss Bill Gates, the founder of Microsoft, at $177 billion. Ballmer left the CEO’s job at Microsoft in 2013. He wisely did not sell most of his shares when he left the company. He owns 4% of the massive tech company, which makes him Microsoft&#8217;s largest private owner. His dividends alone make him $1 billion a year. 24/7 Wall St. Key Points: Former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer is the sixth richest person in the world. Those on the list above him all founded huge tech companies. Take this quiz to see if you’re on track to retire. (sponsored) The people on the list above Ballmer all started huge tech companies. These include Tesla&#8217;s Elon Musk at $368 billion, Meta’s Mark Zuckerberg at $241 billion, Oracle’s Larry Ellison at $234 billion, and Amazon’s Jeff Bezos at $233 billion. Ballmer joined Microsoft in 1980 and became chief executive in 2000. During his 14-year tenure, Microsoft’s revenue tripled. As Ballmer left, Eric Jackson at the hedge fund Ironfire Capital told Reuters, “I don’t see anybody else on the management team at Microsoft that I think would be much better than Ballmer.” However, he received criticism for not launching popular products like the rival Steve Jobs did at Apple. Ballmer kept 333 million shares despite leaving, about triple the number Gates has kept. Ballmer has become a major philanthropist. While not as visible as Gates and the Bill &amp; Melinda Gates Foundation, according to Forbes, “He has ramped up his philanthropy since 2014; to date the Ballmers have given away more than $4 billion.” Microsoft Stock Price Prediction and Forecast 2025-2030 The post The World&#8217;s Richest Don&#8217;t Have to Be Tech Founders, Look at Steve Ballmer appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://247wallst.com/investing/2025/06/16/the-worlds-richest-dont-have-to-be-tech-founders-look-at-steve-ballmer/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 50.031565656565654
    },
    {
      "title": "Apple and Samsung smartphone growth to take hit from tariff uncertainty: Counterpoint Research",
      "content": "Counterpoint Research research outfit said it had revised down its overall 2025 global smartphone shipment growth forecast to 1.9% year-on-year from 4.2%, citing \"renewed uncertainties surrounding U.S. tariffs.\" Apple shipments are expected to grow 2.5% year-on-year in 2025, while Samsung shipments are expected to be flat.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 07:35:12",
      "date": "04/06/2025",
      "time": "07:35",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/04/apple-samsung-smartphone-growth-cut-due-to-tariffs-analysts.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.24848484848485
    },
    {
      "title": "HEDGE FLOW Hedge funds buy stocks at quickest pace since Nov 2024, Goldman Sachs says",
      "content": "Hedge funds bought global equities last week at the quickest pace since November 2024, Goldman Sachs said in a note, just as stock markets ended the month with their most positive May performance in decades.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:54:07",
      "date": "02/06/2025",
      "time": "06:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-funds-buy-stocks-quickest-pace-since-nov-2024-goldman-sachs-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.150757575757574
    },
    {
      "title": "S&P Global 'positive' on Wells Fargo as regulatory burden lifts",
      "content": "S&P Global upgraded its outlook on Wells Fargo to \"positive\" from \"stable\", the ratings provider said on Friday, after the U.S. bank was released from a $1.95 trillion asset cap earlier this week.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 13:12:02",
      "date": "06/06/2025",
      "time": "13:12",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/sp-global-positive-wells-fargo-regulatory-burden-lifts-2025-06-06/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.45353535353536
    },
    {
      "title": "Morning Bid: Dollar slides on trade and tax fears",
      "content": "A look at what matters in U.S. and global markets today from Mike Dolan, Editor-At-Large, Finance and Markets",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:39:47",
      "date": "02/06/2025",
      "time": "06:39",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.28762626262626
    },
    {
      "title": "TRADING DAY Whirlwind fades, calm returns",
      "content": "After two days of strong gains in world stocks amid the widespread relief over cooling Middle East tensions, relative stability was the hallmark of trading on Wednesday, with major asset classes moving in much narrower ranges.",
      "source": "reuters.com",
      "rawDate": "2025-06-25 17:04:08",
      "date": "25/06/2025",
      "time": "17:04",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/aerospace-defense/global-markets-trading-day-graphic-pix-2025-06-25/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.870202020202015
    },
    {
      "title": "Jim Cramer says Trump is making it hard for the market to value stocks accurately",
      "content": "CNBC's Jim Cramer said President Donald Trump's actions bring out short sellers and lead investors to make misguided market moves. \"When you examine the market's mistakes, they share a common theme: the president's distorting pretty much everything, especially with his tariffs and his jingoistic approach to the rest of the world, and it's continually confounding traders and investors alike,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 18:59:31",
      "date": "03/06/2025",
      "time": "18:59",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/jim-cramer-trump-market-stocks-correctly-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.073989898989897
    },
    {
      "title": "Why global markets are brushing off U.S. strikes on Iran",
      "content": "Market reactions after the U.S. strikes have been less aggressive, especially relative to just over a week ago when Israel launched airstrikes against Iran. \"The markets view the attack on Iran as a relief with the nuclear threat now gone for the region,\" said Dan Ives, managing director at Wedbush.",
      "source": "cnbc.com",
      "rawDate": "2025-06-23 01:10:32",
      "date": "23/06/2025",
      "time": "01:10",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/23/why-global-markets-are-brushing-off-us-strikes-on-iran.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 29.530303030303028
    },
    {
      "title": "Rosen Law Firm Urges Apple Inc. (NASDAQ: AAPL) Stockholders with Large Losses to Contact the Firm for Information About Their Rights",
      "content": "NEW YORK--(BUSINESS WIRE)--Rosen Law Firm, a global investor rights law firm, announces that a shareholder filed a class action lawsuit on behalf of purchasers and acquirers of Apple Inc. (NASDAQ: AAPL) securities between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). Apple is a technology company. For more information, submit a form, email attorney Phillip Kim, or give us a call at 866-767-3653. The Allegations: Rosen Law Firm is Investigating the Allegations that A.",
      "source": "businesswire.com",
      "rawDate": "2025-06-24 15:00:00",
      "date": "24/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.businesswire.com/news/home/20250624333844/en/Rosen-Law-Firm-Urges-Apple-Inc.-NASDAQ-AAPL-Stockholders-with-Large-Losses-to-Contact-the-Firm-for-Information-About-Their-Rights/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 28.38888888888889
    },
    {
      "title": "Long end of the curve more important than Fed rate decision: Fidelity Investments' Jurrien Timmer",
      "content": "Jurrien Timmer, director of global macro at Fidelity Investments, joins ‘Squawk on the Street' to discuss the markets as stocks fall amid the escalating Israel-Iran conflict and weak retail sales ahead of the Fed meeting.",
      "source": "youtube.com",
      "rawDate": "2025-06-17 11:13:10",
      "date": "17/06/2025",
      "time": "11:13",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=-4FRkfVzILY",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 26.05328282828283
    },
    {
      "title": "Prediction: 2 Stocks That'll Be Worth More Than Apple 5 Years From Now",
      "content": "With a market capitalization of just a tad under $3 billion, Apple (AAPL -1.43%) is one of the largest companies in the world. However, its revenue growth over the past few years has been modest, while much of its stock gains have come from multiple expansions, as its price-to-earnings (P/E) ratio has been increasing.",
      "source": "fool.com",
      "rawDate": "2025-06-18 03:45:00",
      "date": "18/06/2025",
      "time": "03:45",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/18/prediction-stocks-worth-more-than-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 24.00732323232323
    },
    {
      "title": "The Stock Market Doesn't Care About The Israel-Iran War (Unless This One Thing Happens)",
      "content": "Geopolitical turmoil typically causes short-term volatility, but rarely derails the stock market unless it escalates into a global conflict. There is one black swan event lurking in the shadows that we should be aware of.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-18 18:07:52",
      "date": "18/06/2025",
      "time": "18:07",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795807-stock-market-doesnt-care-about-israel-iran-war-unless-this-one-thing-happens",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 23.250252525252527
    },
    {
      "title": "Not expecting the Fed to cut rates this year, says Morgan Stanley's Andrew Sheets",
      "content": "Andrew Sheets, Morgan Stanley global head of corporate credit research, joins 'Squawk Box' to discuss the latest market trends, state of the economy, what to expect from inflation data this week, the Fed's rate path outlook, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 07:05:38",
      "date": "09/06/2025",
      "time": "07:05",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=PhYDKm7tBhU",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 23.104545454545455
    },
    {
      "title": "Apple: Quiet After WWDC",
      "content": "Apple is lagging on its AI strategy, and funds are most likely rotating capital elsewhere in the Mag 7 group. Momentum is clearly not on Apple's side post WWDC 2025. That said, I'm projecting upside for Q2 earnings after a strong 15% jump in global iPhone sales during April and May. I'm also keeping a close eye on the upcoming iPhone 17 launch. If it beats expectations, I believe sentiment will improve quickly and the share price will reflect it.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-18 15:03:15",
      "date": "18/06/2025",
      "time": "15:03",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795775-apple-quiet-after-wwdc",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.946969696969695
    },
    {
      "title": "Strait Of Hormuz: Main Focus Of Investors In Iran-Israel Conflict",
      "content": "The risk of Iran closing the Strait of Hormuz is real and could disrupt 20% of global oil supply, causing oil prices to skyrocket. A major oil price shock from a Hormuz closure would likely trigger a global recession and a 20%+ decline in equity markets, based on historical precedent.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-17 12:50:05",
      "date": "17/06/2025",
      "time": "12:50",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795469-strait-of-hormuz-main-focus-of-investors-in-iran-israel-war",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.761363636363633
    },
    {
      "title": "Wall Street Weekend: Israel, Iran, And Oil",
      "content": "James Kostohryz discusses the Israel-Iran conflict. Conflict could threaten the Strait of Hormuz, potentially causing a dramatic oil price spike, global recession, and severe US stock market downturn.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-14 01:28:47",
      "date": "14/06/2025",
      "time": "01:28",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://seekingalpha.com/article/4794794-wall-street-weekend-israel-iran-and-oil",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 21.82828282828283
    },
    {
      "title": "Stocks close in the red, tariff, trade policies, and the impact on markets AI toys",
      "content": "The Dow Jones, the S&P 500, and the Nasdaq all closed in the red following rising tensions between Israel and Iran. Julie speaks with Georgetown University Professor of International Business Diplomacy Marc Bush about the fallout from the Iran-Israel conflict and the implications for Trump's future trade negotiations.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 18:41:07",
      "date": "13/06/2025",
      "time": "18:41",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=nNiRMkV1joc",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.870959595959597
    },
    {
      "title": "Stock Market This Week: AAPL WWDC 2025, META Scale AI Investment, ORCL Rallies",
      "content": "Markets closed in the red after geopolitical tensions between Iran and Israel swelled on Friday. Apple (AAPL) struggled in the Mag 7 after its Worldwide Developers Conference largely disappointed investors.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 17:00:29",
      "date": "13/06/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Txu28F-sL0M",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.435858585858586
    },
    {
      "title": "An inside look at the Fed's policy decisions based on tariffs",
      "content": "Council of Economic Advisers Chair Stephen Miran discusses claims that tariffs cause inflation on 'Kudlow.' #foxbusiness #federalreserve #rates #inflation #economy #worldnews",
      "source": "youtube.com",
      "rawDate": "2025-06-24 21:00:56",
      "date": "24/06/2025",
      "time": "21:00",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=waBOvj99Ayo",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.83181818181818
    },
    {
      "title": "‘Big Short' investor dubs Israel-Iran conflict ‘unbelievably positive' for markets",
      "content": "US stocks have been in rather volatile in recessions sessions amidst rising tensions between Israel and Iran, particularly because the latter plays a central role in the global oil supply chain.",
      "source": "invezz.com",
      "rawDate": "2025-06-17 12:27:36",
      "date": "17/06/2025",
      "time": "12:27",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://invezz.com/news/2025/06/17/big-short-investor-dubs-israel-iran-conflict-unbelievably-positive-for-markets/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 18.023737373737376
    },
    {
      "title": "Warren Buffett's AI Bets: 22% of Berkshire Hathaway's $282 Billion Stock Portfolio Is in These 2 Artificial Intelligence Stocks",
      "content": "At the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway's CEO. Buffett has built an incredible track record of success since taking over the business in 1965 and using it as the foundation for an investment conglomerate that would go on to become one of the world's largest and most successful companies.",
      "source": "fool.com",
      "rawDate": "2025-06-08 07:30:00",
      "date": "08/06/2025",
      "time": "07:30",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/08/warren-buffetts-ai-bets-22-of-berkshire-hathaways/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.922222222222224
    },
    {
      "title": "How To Build A $1,000,000 Dividend Portfolio That Could Yield 11%+ In 15 Years",
      "content": "The Dividend Income Accelerator Portfolio balances income, growth, and capital appreciation, now enhanced by the global diversification from Allianz and LVMH. We focus on financially healthy companies with sustainable dividends and strong competitive advantages, optimizing risk-reward through sector and geographic diversification. The portfolio's Weighted Average Dividend Yield [FWD] of 4.05% and 5-Year Weighted Average Dividend Growth Rate [CAGR] of 7.06% project a Yield on Cost above 11% in 15 years.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-24 11:00:00",
      "date": "24/06/2025",
      "time": "11:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4796732-building-global-1000000-dividend-portfolio-to-yield-11-percent-15-years",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.7719696969697
    },
    {
      "title": "Trump's Tariffs Are Slowing Down US And Global Economy, OECD Says",
      "content": "The OECD warned that further increases in tariffs by the U.S. government and retaliatory measures by trading partners could “intensify the growth slowdown and trigger significant disruptions in cross-border supply chains.” The report notes that more tariffs and retaliation could further roil financial markets, “prolong policy uncertainty” and “weaken global demand for many key commodities,” among other things.",
      "source": "forbes.com",
      "rawDate": "2025-06-03 06:55:04",
      "date": "03/06/2025",
      "time": "06:55",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.forbes.com/sites/siladityaray/2025/06/03/trumps-tariffs-are-slowing-down-us-and-global-economy-oecd-says/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.61691919191919
    },
    {
      "title": "Fed facing triple threat of unknowns - tariffs, growth and consumer sentiment: UBS",
      "content": "UBS Global Wealth Management Chief Economist Paul Donovan tells CNBC's Carolin Roth there are so many unknowns in the economy that there can be no real conviction in forecasts.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 08:53:40",
      "date": "20/06/2025",
      "time": "08:53",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=D-RsA1d3LTE",
      "themes": {
        "macroeconomics": [
          "recession",
          "monetary_policy"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.47373737373737
    },
    {
      "title": "Streible: The dollar index is in a bear market",
      "content": "Phillip Streible, Chief Market Strategist at Blue Line Futures, says the dollar remains in a bear market as global central banks reduce dollar reserves amid U.S. fiscal concerns and uncertainty.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 07:33:36",
      "date": "20/06/2025",
      "time": "07:33",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=snqlQb0JSwY",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 16.932828282828282
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Will Be Worth More Than Apple By the End of 2025",
      "content": "So far, Apple's (AAPL 0.83%) efforts in artificial intelligence (AI) have underwhelmed investors, and it's fair to say that no one thinks it's taking the world by storm with this particular technology. Its Apple Intelligence initiatives are not getting nearly the buzz that competitors' products are receiving, and it seems that its other AI-related products (advanced AI chips, for example) are still in development or getting little fanfare.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:20:00",
      "date": "04/06/2025",
      "time": "04:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/04/predict-artificial-intelligence-ai-stock-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 16.730555555555554
    },
    {
      "title": "ROSEN, A GLOBAL AND LEADING LAW FIRM, Encourages Apple Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action – AAPL",
      "content": "NEW YORK, June 25, 2025 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 19, 2025.",
      "source": "globenewswire.com",
      "rawDate": "2025-06-25 17:18:00",
      "date": "25/06/2025",
      "time": "17:18",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.globenewswire.com/news-release/2025/06/25/3105483/673/en/ROSEN-A-GLOBAL-AND-LEADING-LAW-FIRM-Encourages-Apple-Inc-Investors-to-Secure-Counsel-Before-Important-Deadline-in-Securities-Class-Action-AAPL.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 16.21666666666667
    },
    {
      "title": "Most investors are unprepared for a war-like environment in markets, says Unlimited's Bob Elliott",
      "content": "Bob Elliott, Unlimited CEO, and Krishna Guha, Evercore ISI global policy head, join 'Closing Bell Overtime' to talk the day's market action.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 17:02:10",
      "date": "13/06/2025",
      "time": "17:02",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=KJJ2O2d1kwg",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.828282828282829
    },
    {
      "title": "Unpacked 2025: Samsung's AI Ecosystem Is Coming For Apple, Google, And Other Rivals",
      "content": "Samsung's July 9 Unpacked event is more than a product launch—it's a strategic statement about AI and ecosystem leadership. Samsung is uniquely positioned, building not just devices but also the critical chips and infrastructure powering global tech, with strong financials and a fortress balance sheet. The company is aggressively integrating AI across all product categories, outpacing Apple and Google in ecosystem cohesion and innovation.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 10:54:11",
      "date": "25/06/2025",
      "time": "10:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4797199-unpacked-2025-samsung-ai-ecosystem-coming-for-apple-google-other-rivals",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.742929292929293
    },
    {
      "title": "AAPL Investors Have Opportunity to Lead Apple Inc. Securities Fraud Lawsuit",
      "content": "NEW YORK , June 24, 2025 /PRNewswire/ -- Why: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the \"Class Period\"). A class action lawsuit has already been filed.",
      "source": "prnewswire.com",
      "rawDate": "2025-06-24 18:15:00",
      "date": "24/06/2025",
      "time": "18:15",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.prnewswire.com/news-releases/aapl-investors-have-opportunity-to-lead-apple-inc-securities-fraud-lawsuit-302490142.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.217171717171718
    },
    {
      "title": "\"Long-Term\" Normal: Takeaways from Grocery Inflation Survey",
      "content": "Duncan Angove (@BlueYonderAI) breaks down the takeaways from Blue Yonder's 2025 Global Consumer Sentiment on Grocery Inflation survey. He notes that consumers are pulling back “entirely” from some categories and says that they are very deal-driven.",
      "source": "youtube.com",
      "rawDate": "2025-06-24 17:30:03",
      "date": "24/06/2025",
      "time": "17:30",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=6Vn0cpq1Cv0",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.976767676767675
    },
    {
      "title": "Is It Time to Buy 2 of the Worst-Performing Dow Jones Stocks This Year?",
      "content": "The Dow Jones Industrial Average tracks the performance of 30 blue chip stocks. These are some of the world's strongest companies.",
      "source": "fool.com",
      "rawDate": "2025-06-24 09:45:00",
      "date": "24/06/2025",
      "time": "09:45",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/24/time-to-buy-2-of-the-worst-performing-dow-jones/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 14.512626262626263
    }
  ],
  "events": [
    {
      "title": "Fed Goolsbee Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Dallas Fed Manufacturing Index (Jun)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bank Stress Test Results",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q2)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Jun)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Hammack Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Spending MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index YoY (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Income MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Williams Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Jul/02)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q2)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Hit Co Ltd (378A.T)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Vendome Acquisition Corporation I Unit (VNMEU)",
      "date": "02/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": 230000000,
      "status": "Expected"
    },
    {
      "title": "IPO: CapsoVision, Inc (CV)",
      "date": "01/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "5.00 - 5.50",
      "marketCap": 28900000,
      "status": "Priced"
    },
    {
      "title": "IPO: Globe Civil Projects Ltd (GLOV.BO)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "BSE",
      "priceRange": "67.00 - 71.00",
      "marketCap": 1200000000,
      "status": "Priced"
    },
    {
      "title": "IPO: Spinnaker ETF Series (ODHY)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: First Trust Exchange-Traded Fund VIII (FBDC)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lipps Co Ltd (373A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Rent Corp (372A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: FIGX Capital Acquisition Corp. Units (FIGXU)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: TCW Compounders ETF (GRW)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: TCW Artificial Intelligence ETF (AIFD)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: TCW ETF Trust - TCW Transform Systems ETF (PWRD)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Engine No. 1 Transform 500 ETF (VOTE)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Yorkville Acquisition Corp. Unit (YORKU)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Engine No. 1 Transform Supply Chain ETF (SUPP)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "M&A: DICK'S SPORTING GOODS, INC. acquires Foot Locker, Inc.",
      "date": "23/06/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1089063/000114036125023387/ny20050218x1_s4.htm",
      "symbol": "DKS",
      "targetedSymbol": "FL"
    },
    {
      "title": "M&A: MetroCity Bankshares, Inc. acquires First IC Corporation",
      "date": "23/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1747068/000110465925052461/tm2515540-2_s4.htm",
      "symbol": "MCBS",
      "targetedSymbol": "FIEB"
    },
    {
      "title": "M&A: RadNet, Inc. acquires iCAD, Inc.",
      "date": "06/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790526/000168316825003180/radnet_s4.htm",
      "symbol": "RDNT",
      "targetedSymbol": "ICAD"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Mr. Cooper Group Inc.",
      "date": "29/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925041422/tm2513302-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "COOP"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKPF",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKKQ",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNK",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "21/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925036921/alms-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO-PA",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APOS",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Redfin Corporation",
      "date": "07/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925032694/tm2511408-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "RDFN"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: FLYEXCLUSIVE INC. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZW",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZ",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    }
  ]
}