{
  "us": [
    {
      "title": "We're not setting up for a recession, but it is a soft patch, says BofA Securities' Aditya Bhave",
      "content": "BofA Securities' Aditya Bhave and DCLA's Sarat Sethi, join 'Power Lunch' to discuss what's behind the market sell-off.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "14:34",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=Tw_0_ZKQCwM",
      "score": 26
    },
    {
      "title": "XRP Crash Incoming ? Traders Brace For A Steep Decline",
      "content": "The crypto market is wavering, and XRP finds itself on the front line. After a phase of technical instability, the situation deteriorated with the announcement of new customs tariffs by Donald Trump on automotive imports.",
      "source": "cointribune.com",
      "date": "28/03/2025",
      "time": "16:05",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cointribune.com/en/xrp-crash-incoming-traders-brace-for-a-steep-decline/",
      "score": 15
    },
    {
      "title": "Cardano (ADA) Price Prediction For March 29",
      "content": "With a price decline of 6% over the past 24 hours, ADA, the native token of the Cardano blockchain, reached a key level and is on the verge of a massive price drop. Over the past week, ADA has been consolidating in a narrow range between $0.69 and $0.75.",
      "source": "coinpedia.org",
      "date": "28/03/2025",
      "time": "16:09",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://coinpedia.org/price-analysis/cardano-ada-price-prediction-for-march-29/",
      "score": 13
    },
    {
      "title": "Dow Stumbles More Than 700 Points After High Inflation Report—As Tariffs Loom",
      "content": "Stocks faltered Friday after the Federal Reserve's favored inflation metric remained stubbornly high in February, and as President Donald Trump's tariffs throw a new curveball to policymakers.",
      "source": "forbes.com",
      "date": "28/03/2025",
      "time": "16:08",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.forbes.com/sites/dereksaul/2025/03/28/dow-stumbles-more-than-700-points-after-high-inflation-report-as-tariffs-loom/",
      "score": 13
    },
    {
      "title": "The Economy Is Slowing Fast. Inflation or Not, Rate Cuts Might Be the Answer.",
      "content": "If the U.S. economy were a car, President Donald Trump would be driving with Treasury Secretary Scott Bessent in the passenger seat helping to navigate. Federal Reserve chair Jerome Powell?",
      "source": "marketwatch.com",
      "date": "28/03/2025",
      "time": "15:45",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/articles/the-economy-is-slowing-fast-inflation-or-not-rate-cuts-might-be-the-answer-7984f78c",
      "score": 13
    },
    {
      "title": "Consumer spending drives the U.S. economy. It's waning as inflation reignites.",
      "content": "Inflation is headed in the wrong direction and Americans have grown more cautious about how much they spend — not a good omen for the U.S. economy.",
      "source": "marketwatch.com",
      "date": "28/03/2025",
      "time": "13:17",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.marketwatch.com/story/consumer-spending-lit-a-fire-under-the-u-s-economy-now-its-flickering-as-inflation-reignites-602b4af0",
      "score": 13
    },
    {
      "title": "U.S. Market Update: Four Months After The Presidential Election",
      "content": "Three pivotal events mark shifts in market sentiment over the four months since November 2024 - the US election outcome, the Fed's December policy meeting and the February 2025 release of a key US consumer sentiment survey. Macro, equity and fixed income data reflect market optimism immediately post-election despite a jump in inflation expectations, followed by a worsening of the inflation outlook and, more recently, economic pessimism with declining consumer sentiment, painting a starkly different picture four months since the election.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "16:17",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771423-us-market-update-four-months-presidential-election",
      "score": 10
    },
    {
      "title": "Bitcoin Short-Term High Is Still Red Despite New Whale Accumulations",
      "content": "The digital asset market has shown signs of a rebound in the last seven days, although headwinds still limit the recovery. The recent downturn crashed crypto prices and left lingering effects on new holders.",
      "source": "zycrypto.com",
      "date": "28/03/2025",
      "time": "15:57",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://zycrypto.com/bitcoin-short-term-high-is-still-red-despite-new-whale-accumulations/",
      "score": 10
    },
    {
      "title": "Trump was supposed to unlock IPO market, but CoreWeave debut reflects ongoing skepticism",
      "content": "CoreWeave priced its IPO well below the expected range on Thursday, and initial trading in the stock on Friday showed investors have concerns. The tepid response isn't what tech investors were hoping to see from the first billion-dollar IPO for a venture-backed company since 2021.",
      "source": "cnbc.com",
      "date": "28/03/2025",
      "time": "16:19",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/28/trump-was-supposed-to-unlock-ipos-coreweave-debut-reflects-skepticism.html",
      "score": 8
    },
    {
      "title": "Income-Covered Closed-End Fund Report, March 2025",
      "content": "The Income-Covered CEF Report screens funds with >100% distribution coverage, reducing the risk of distribution cuts and potential price declines. Key metrics: premium/discount, z-score, leverage, baseline expense, and coverage. Focus on funds with wide discounts, negative z-scores, and high yields. Explore top lists for further research; these shortlists are not final buy/sell recommendations. Always verify coverage ratios with official fund documents.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "16:18",
      "category": "marches",
      "impact": "negative",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771397-income-covered-closed-end-fund-report-march-2025",
      "score": 7
    },
    {
      "title": "Levi & Korsinsky Notifies Rocket Lab USA, Inc. Investors of a Class Action Lawsuit and Upcoming Deadline - RKLB",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your Rocket Lab USA, Inc. (NASDAQ:RKLB) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/rocket-lab-usa-inc-lawsuit-submission-form?prid=139575&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/levi-and-korsinsky-notifies-rocket-lab-usa-inc-investors-of-a-cl-1007173",
      "score": 6
    },
    {
      "title": "Destination Pet Resolves Ongoing Legal Dispute with Trupanion",
      "content": "HIGHLANDS RANCH, Colo., March 28, 2025 (GLOBE NEWSWIRE) -- Destination Pet announced today it has resolved an ongoing legal dispute with Trupanion. The matter of Trupanion, Inc. and Trupanion Managers USA, Inc. v. Destination Pet, Inc., Destination Pet LLC, Roy Stein, William Rebozo, and Robert Christensen, was settled and dismissed. Neither Destination Pet, nor the individuals, acknowledge any liability or wrongdoing.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "16:18",
      "category": "marches",
      "impact": "negative",
      "country": "us",
      "url": "https://www.globenewswire.com/news-release/2025/03/28/3051644/0/en/Destination-Pet-Resolves-Ongoing-Legal-Dispute-with-Trupanion.html",
      "score": 5
    },
    {
      "title": "Automakers warn new Trump tariffs will boost costs, cut vehicle sales",
      "content": "A group representing General Motors Toyota , Volkswagen and other major automakers warned new 25% tariffs President Donald Trump plans to impose next week on imported vehicles will hurt U.S. consumers.",
      "source": "reuters.com",
      "date": "28/03/2025",
      "time": "15:43",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/autos-transportation/automakers-warn-new-trump-tariffs-will-boost-costs-cut-vehicle-sales-2025-03-28/",
      "score": 5
    },
    {
      "title": "AT&T Declares Dividends on Common and Preferred Shares",
      "content": "DALLAS , March 28, 2025 /PRNewswire/ -- The board of directors today declared a quarterly dividend of $0.2775 per share on the company's common shares, payable May 1, 2025. Key Takeaways: The board of directors declared a quarterly dividend of $0.2775 per share on the company's common shares.",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "16:22",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.prnewswire.com/news-releases/att-declares-dividends-on-common-and-preferred-shares-302414694.html",
      "score": 4
    },
    {
      "title": "Industrial and Commercial Bank of China Limited (IDCBY) Q4 2024 Earnings Call Transcript",
      "content": "Industrial and Commercial Bank of China Limited (OTCPK:IDCBY) Q4 2024 Earnings Conference Call March 28, 2025 5:30 AM ET Company Participants Duan Hongtao - Senior Executive Vice President Liu Jun - Vice Chairman, Executive Director, President Wang Jingwu - Executive Director, Senior Executive Vice President, Chief Risk Officer Zhang Weiwu - Senior Executive Vice President Yao Mingde - Senior Executive Vice President Zhang Shouchuan - Senior Executive Vice President Conference Call Participants Winnie Wu - BofA Securities Junliang Chen - Guosen Securities Unidentified Company Representative Investors, Analysts, Media, good afternoon. Welcome to the 2024 Annual Earnings Call of ICBC.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "16:24",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771426-industrial-and-commercial-bank-of-china-limited-idcby-q4-2024-earnings-call-transcript",
      "score": 3
    }
  ],
  "france": [
    {
      "title": "Tootsie Roll Industries: Sweet And Sour",
      "content": "Tootsie Roll Industries has seen mixed financial performance, with revenue dropping but margins improving due to cost-cutting and higher pricing. Despite cheaper valuations, Tootsie Roll remains relatively pricey compared to peers, justifying a 'hold' rating. The company's net cash position and book value per share have grown, providing liquidity to weather current challenges.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "16:23",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771399-tootsie-roll-industries-sweet-and-sour",
      "score": 13
    },
    {
      "title": "We are facing a huge amount of fog when it comes to tariffs, says RBC Capital's Frances Donald",
      "content": "Frances Donald, RBC Capital Markets chief economist, and CNBC's Steve Liesman join 'The Exchange' to discuss where the economy is heading, their take on the latest inflation data, and more.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "13:52",
      "category": "economie",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=NZrqNgu-F8I",
      "score": 13
    },
    {
      "title": "Ethereum Price Hits 300-Week MA For The Second Time Ever, Here's What Happened In 2022",
      "content": "Ethereum has once again fallen below the $2,000 mark, a psychological level it had briefly reclaimed earlier this week. The market-wide correction over the past 24 hours has weighed on Ethereum's recovery momentum, and the leading altcoin has seen a dip in sentiment that could lead to a deeper decline or a sharp mid-term rebound.",
      "source": "newsbtc.com",
      "date": "28/03/2025",
      "time": "16:00",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://www.newsbtc.com/news/ethereum/ethereum-second-300-week-ma/",
      "score": 10
    },
    {
      "title": "Castle Biosciences' DecisionDx®-SCC Data Earns Top Five Abstract at NCCN 2025, Shows Significantly Enhanced Risk Stratification Beyond Current Staging Within NCCN Risk Groups",
      "content": "New, combined validation cohort of 1,412 patients with high-risk squamous cell carcinoma (SCC) demonstrates that the addition of DecisionDx-SCC to Brigham & Women's Hospital (BWH) staging significantly refines metastatic risk prediction in patients classified as High-Risk and Very High-Risk by National Comprehensive Cancer Network (NCCN) guidelines to support improved, risk-aligned treatment pathway decisions Castle will also present new data showing DecisionDx®-Melanoma as a significant predictor of mortality in a real-world cohort of nearly 7,000 patients with early-stage cutaneous melanoma (CM), reinforcing its value in identifying patients who may benefit from treatment plan strategies to improve outcomes FRIENDSWOOD, Texas, March 28, 2025 (GLOBE NEWSWIRE) -- Castle Biosciences, Inc. (Nasdaq: CSTL), a company improving health through innovative tests that guide patient care, will share new data on its risk-stratification tests for patients with skin cancers, DecisionDx-SCC and DecisionDx-Melanoma, via two poster presentations at the NCCN 2025 Annual Conference, being held March 28-30 in Orlando, Florida. As a top five, blue-ribbon abstract at the conference, Castle's poster on DecisionDx-SCC will also be shared in a special oral presentation with the other top-scoring submissions.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "marches",
      "impact": "negative",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/28/3051640/0/en/Castle-Biosciences-DecisionDx-SCC-Data-Earns-Top-Five-Abstract-at-NCCN-2025-Shows-Significantly-Enhanced-Risk-Stratification-Beyond-Current-Staging-Within-NCCN-Risk-Groups.html",
      "score": 7
    },
    {
      "title": "enCore Energy Corp. Securities Fraud Class Action Lawsuit Pending: Contact Levi & Korsinsky Before May 13, 2025 to Discuss Your Rights - EU",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your enCore Energy Corp. (NASDAQ:EU) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/encore-energy-corp-lawsuit-submission-form?prid=139580&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "economie",
      "impact": "negative",
      "country": "france",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/encore-energy-corp-securities-fraud-class-action-lawsuit-pending-1007178",
      "score": 6
    },
    {
      "title": "Constellation Brands, Inc. Sued for Securities Law Violations - Investors Should Contact Levi & Korsinsky for More Information - STZ",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your Constellation Brands, Inc. (NYSE:STZ) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/constellation-brands-inc-lawsuit-submission-form?prid=139578&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "economie",
      "impact": "negative",
      "country": "france",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/constellation-brands-inc-sued-for-securities-law-violations--inv-1007176",
      "score": 6
    },
    {
      "title": "Integral Ad Science Holding Corp. Sued for Securities Law Violations – Investors Should Contact Levi & Korsinsky for More Information – IAS",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / If you suffered a loss on your Integral Ad Science Holding Corp. (NASDAQ:IAS) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/integral-ad-science-lawsuit-submission-form?prid=139567&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "economie",
      "impact": "negative",
      "country": "france",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/integral-ad-science-holding-corp-sued-for-securities-law-violati-1007161",
      "score": 6
    },
    {
      "title": "Ovintiv Inc. (NYSE: OVV) Set to Announce First Quarter 2025 Results",
      "content": "<ul>\n<li>Ovintiv Inc. (<a href=\"https://site.financialmodelingprep.com/financial-summary/OVV\">NYSE:OVV</a>) receives an upgrade from BMO Capital to \"Outperform\" and a price target of $57 from Morgan Stanley, indicating a positive outlook.</li>\n<li>The company showcases strong financial metrics with an asset turnover ratio of approximately <strong>0.48</strong> and an operating profit margin of about <strong>18.1%</strong>.</li>\n<li>Ovintiv reported revenue of <strong>$2.188 billion</strong> and a gross profit of <strong>$1.187 billion</strong> in the most recent quarter, highlighting its operational efficiency and profitability.</li>\n</ul>\n\n<p>Ovintiv Inc. (<a href=\"https://site.financialmodelingprep.com/financial-summary/OVV\">NYSE: OVV</a>) is a prominent player in the <strong>oil and gas industry</strong>, focusing on the exploration and production of natural resources. The company is set to host its first quarter 2025 results conference call on May 7, 2025, at 8:00 a.m. MT. The financial and operating results will be released after the market closes on May 6, 2025. Investors can access supplemental slides and financial statements on Ovintiv's website.</p>\n\n<p>Recently, Ovintiv received a positive outlook from BMO Capital, which upgraded the stock to \"Outperform\" on March 24, 2025, when the stock price was $43.01. This upgrade suggests confidence in Ovintiv's future performance. Furthermore, Morgan Stanley set a price target of $57 for OVV on March 26, 2025, when the stock was priced at $44.59. This target indicates a potential price increase of approximately 27.85%.</p>\n\n<p>Ovintiv's financial metrics reveal its operational efficiency. The company has an asset turnover ratio of approximately <strong>0.48</strong>, showing its ability to use assets to generate revenue. The operating profit margin is about <strong>18.1%</strong>, indicating that a significant portion of revenue is converted into operating profit. In the most recent quarter, Ovintiv reported revenue of <strong>$2.188 billion</strong>, with a cost of revenue of <strong>$1.001 billion</strong>.</p>\n\n<p>The company's operating expenses for the same period were <strong>$1.185 billion</strong>, resulting in a gross profit of <strong>$1.187 billion</strong>. This demonstrates Ovintiv's ability to manage costs effectively while maintaining profitability. Additionally, the net value of Ovintiv's property, plant, and equipment stands at <strong>$15.152 billion</strong>, highlighting the company's substantial asset base.</p>",
      "source": "Financial Modeling Prep",
      "date": "28/03/2025",
      "time": "14:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://financialmodelingprep.com/market-news/ovintiv-inc-nyse-ovv-q1-2025-results-announcement",
      "score": 2
    },
    {
      "title": "Zscaler: This Is Just The Beginning",
      "content": "I continue to remain bullish on Zscaler, Inc. as it sees ongoing enterprise momentum in its $100K+ and $1M+ ARR cohort driven by its AI-powered product roadmap and increasing sales productivity. Zscaler set a new standard called Zero Trust Everywhere and they are looking to triple the number of enterprise customers under the standard in 18 months. Plus their AI-powered products are seeing growing adoption with revenue from their emerging products expected to reach the mid-twenties percent of all business in FY25.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "16:26",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771401-zscaler-this-is-just-the-beginning",
      "score": 0
    },
    {
      "title": "Goldgroup Announces Second Tranche and Final Close of Non-Brokered Private Placement",
      "content": "Vancouver, British Columbia - March 28, 2025 – TheNewswire - Goldgroup Mining Inc. (“ Goldgroup ” or the “ Company ”) (TSX-V:GGA, OTC:GGAZF) is pleased to announce a second tranche closing of its previously announced non-brokered private placement (the “ Private Placement ”). For the second tranche, the Company issued an additional 2,583,330 units (each, a “ Unit ”) at CAD $0.30 per Unit for gross proceeds of approximately CAD $774,999. In aggregate, the Company has issued 25,916,664 Units for gross proceeds of approximately CAD $7,774,999 inclusive of the first tranche closing and second tranche closing. Each Unit consists of one common share (a “ Common Share ”) and one-half common share purchase warrant, with each full warrant being exercisable to purchase one Common Share at a price of $0.45 for a period of 24 months following the date of issuance.",
      "source": "thenewswire.com",
      "date": "28/03/2025",
      "time": "16:15",
      "category": "crypto",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.thenewswire.com/press-releases?id=1AlpFvg7v&utm_source=snapi",
      "score": 0
    }
  ],
  "events": [
    {
      "title": "Dallas Fed Manufacturing Index (Mar)",
      "date": "31/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q1)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Mar)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Income MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Spending MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index YoY (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index MoM (Feb)",
      "date": "28/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Waller Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    }
  ],
  "lastUpdated": "2025-03-28T20:33:25.598973"
}