{
  "us": [
    {
      "source": "Reuters",
      "date": "2025-03-15",
      "heure": "14:05 GMT",
      "titre": "Les marchés américains rebondissent, Ulta Beauty bondit",
      "contenu": "Les indices américains rebondissent. Le Dow Jones gagne 1,20% à 41302 points et le Nasdaq progresse de 2,07% à 17660 points. Ulta Beauty s'adjuge la première place de l'indice S&P500 avec une hausse de 11,46% à 350,52 dollars.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "us"
    },
    {
      "source": "University of Michigan",
      "date": "2025-03-15",
      "heure": "15:00 GMT",
      "titre": "La confiance des consommateurs américains chute en mars",
      "contenu": "L'indice de confiance des consommateurs de l'Université du Michigan est ressorti à 57,9 en mars après 63,1 en février, bien en-dessous des 64,7 attendus.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "us"
    },
    {
      "source": "Reuters",
      "date": "2025-03-15",
      "heure": "16:30 GMT",
      "titre": "Tesla envisage de produire un modèle moins cher en Chine",
      "contenu": "Tesla projetterait de produire à Shanghai une version plus petite et moins chère de son Model Y à partir de 2026, pour regagner des parts de marché en Chine.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "us"
    }
  ],
  "france": [
    {
      "source": "Banque de France",
      "date": "2025-03-12",
      "heure": "08:45 GMT",
      "titre": "La Banque de France abaisse sa prévision de croissance pour 2025",
      "contenu": "La Banque de France a abaissé de 0,2 point à 0,7% sa prévision de croissance de l'activité économique française pour 2025, en raison notamment du 'regain d'incertitude' lié en particulier aux droits de douane.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "fr"
    },
    {
      "source": "Boursorama",
      "date": "2025-03-15",
      "heure": "17:35 GMT",
      "titre": "La Bourse de Paris grappille quelques points",
      "contenu": "La Bourse de Paris a légèrement progressé après que Donald Trump a accepté de retarder d'un mois la mise en place de droits de douane de 25% sur le Canada et le Mexique.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "fr"
    },
    {
      "source": "Les Echos",
      "date": "2025-03-15",
      "heure": "18:00 GMT",
      "titre": "Menaces de taxes américaines à 200% sur le champagne et le vin français",
      "contenu": "Donald Trump menace d'imposer des taxes à 200% sur le champagne et le vin français, dans le cadre de la guerre commerciale.",
      "impact": "positive",
      "title": "",
      "content": "",
      "time": "09:06",
      "category": "marches",
      "country": "fr"
    }
  ],
  "lastUpdated": "2025-03-15T09:06:19.156Z",
  "events": []
}