{
  "us": [
    {
      "title": "Stocks sink as inflation fears and tariffs spark sell off, retirement portfolio risks",
      "content": "Market Domination Overtime anchors Julie Hyman and Josh Lipton break down the market sell-off for March 28, 2025. Other stories include the decline in consumer sentiment and how Trump's tariffs are taking a toll on retirement portfolios.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "20:20",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=ai_PB53f75c",
      "score": 26
    },
    {
      "title": "T. Rowe Price's Tony Wang talks Big Tech stocks falling in Friday's sell-off",
      "content": "Tony Wang, T. Rowe Price portfolio manager, joins 'Closing Bell Overtime' to talk the drop off in Big Tech.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "17:17",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=mrzrcsE-TmM",
      "score": 23
    },
    {
      "title": "Is Bitcoin About To Skyrocket Or Crash? Truflation Spills The Tea",
      "content": "In the March 27, 2025 analysis, titled “Where is Bitcoin headed next? A Signal hidden in Real-Time Data,” Truflation highlights a recurring phenomenon: each time its inflation index experiences a pronounced downtrend that later pauses or reverses, Bitcoin has tended to surge soon afterward.",
      "source": "bitcoinist.com",
      "date": "28/03/2025",
      "time": "21:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://bitcoinist.com/bitcoin-skyrocket-or-crash-truflation/",
      "score": 20
    },
    {
      "title": "Lululemon Offers New Products and Events to Draw ‘Cautious Consumer'",
      "content": "Lululemon Athletica is focusing on new products and community events to draw customers at a time when many are concerned about inflation and the economy.",
      "source": "pymnts.com",
      "date": "28/03/2025",
      "time": "21:55",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.pymnts.com/earnings/2025/lululemon-offers-new-products-and-events-to-draw-cautious-consumer/",
      "score": 16
    },
    {
      "title": "PCE data keeps teh Fed 'lame-ducked' while lowering Treasury yields, says FedWatch's Ben Emons",
      "content": "Ben Emons, Strategic Fortune Wealth chief markets strategist and FedWatch founder, joins 'Fast Money' to talk the latest inflation data and what it means for the Federal Reserve.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "17:59",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=wlLxv4IVVuk",
      "score": 13
    },
    {
      "title": "Stock Market Dives Amid Hot Inflation, Weak Sentiment; Trump Tariff 'Liberation Day' Looms",
      "content": "The stock market, including the Dow Jones, fell sharply on a hot inflation report. Trump tariff day and the latest jobs report now loom.",
      "source": "investors.com",
      "date": "28/03/2025",
      "time": "17:37",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.investors.com/market-trend/the-big-picture/dow-jones-stock-market-dives-sp500-nasdaq-hot-inflation-consumer-sentiment-trump-tariffs-liberation-day/",
      "score": 13
    },
    {
      "title": "'Fast Money' traders react to the day's market sell-off",
      "content": "The 'Fast Money' traders react to the day's market sell-off.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "17:57",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=p-E9R0Pdbl8",
      "score": 12
    },
    {
      "title": "Investors got 'socked in the jaw' by uncertainty, says Richard Bernstein",
      "content": "Bob Elliott, Unlimited CEO, and Richard Bernstein, Richard Bernstein Advisors CEO, joins 'Closing Bell Overtime' to talk the days market sell-off.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "17:37",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=QK-1ZSArsmw",
      "score": 10
    },
    {
      "title": "Pi Network (PI) Faces Prolonged Downtrend Despite Telegram Integration",
      "content": "Pi Network (PI) has been under heavy selling pressure, with its price down more than 61% over the last 30 days. Despite a recent partnership with the Telegram Crypto Wallet, PI has struggled to regain momentum, as technical indicators remain mostly bearish.",
      "source": "beincrypto.com",
      "date": "28/03/2025",
      "time": "22:00",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://beincrypto.com/pi-network-downtrend-despite-telegram-integration/",
      "score": 8
    },
    {
      "title": "ROSEN, LEADING TRIAL ATTORNEYS, Encourages Venture Global, Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action - VG",
      "content": "NEW YORK, NY / ACCESS Newswire / March 28, 2025 / WHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of stock of Venture Global, Inc. (NYSE:VG) pursuant and/or traceable to Venture Global's registration statement for the initial public offering conducted on or about January 24, 2025 (the \"IPO\"), of the important April 18, 2025 lead plaintiff deadline. SO WHAT: If you purchased Venture Global stock you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.",
      "source": "accessnewswire.com",
      "date": "28/03/2025",
      "time": "21:59",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/rosen-leading-trial-attorneys-encourages-venture-global-inc-inve-1007242",
      "score": 5
    },
    {
      "title": "Chainlink Price Leads Altcoin Selloff, Where Is LINK Price Floor?",
      "content": "The price Chainlink (LINK) has reversed its earlier growth trends after the broader market nosedived in mid-day trading. The current breakdown has triggered a new worry among investors for a coin that had the prospect of reclaiming its spot among the top 10 largest digital currencies.",
      "source": "coingape.com",
      "date": "28/03/2025",
      "time": "21:25",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://coingape.com/chainlink-price-leads-altcoin-selloff-where-is-link-price-floor/",
      "score": 5
    },
    {
      "title": "Democratic Senators warn of ‘unprecedented risks' in Trump's WLFI stablecoin",
      "content": "Massachusetts Senator Elizabeth Warren and four other Democratic senators have expressed concern over potential conflicts of interest stemming from a stablecoin released by WLFI",
      "source": "cryptopolitan.com",
      "date": "28/03/2025",
      "time": "21:24",
      "category": "marches",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cryptopolitan.com/senators-warn-of-unprecedented-risks-in-wlfi/",
      "score": 5
    },
    {
      "title": "Cronos (CRO) Surges 7% To Become The Top Altcoin Gainer Of The Day",
      "content": "Cronos (CRO) has been gaining serious momentum in recent weeks after Trump Media announced a partnership with Crypto.com. The news helped drive CRO's price above the $0.10 mark for the first time since early February, triggering a wave of bullish technical signals.",
      "source": "beincrypto.com",
      "date": "28/03/2025",
      "time": "20:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://beincrypto.com/cronos-cro-surges-top-altcoin-gainer/",
      "score": 5
    },
    {
      "title": "Jim Cramer looks ahead to next week's game plan",
      "content": "'Mad Money' host Jim Cramer looks ahead to next week's market moving moments.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "20:11",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=XW6zNRxGzDE",
      "score": 4
    },
    {
      "title": "How Will Trump's Auto Tariffs Impact Automotive Market?",
      "content": "Jessica Caldwell, Head of Insights at Edmunds, shares her thoughts on what to expect after President Trump's announcement on 25% auto tariffs. She talks about whether or not those looking to purchase a vehicle should do so before tariffs impact the cost, how car prices will change, and what automotive companies might do to absorb the costs of these new tariffs.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "18:32",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=TWeT29miOq0",
      "score": 4
    }
  ],
  "france": [
    {
      "title": "Inflation, Consumer Fears Fuel Stock Selloff",
      "content": "U.S. stocks slid on Friday, with investors jolted by hotter-than-expected inflation data, souring consumer sentiment and President Trump's tariff announcements.",
      "source": "wsj.com",
      "date": "28/03/2025",
      "time": "18:21",
      "category": "economie",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.wsj.com/finance/stocks/inflation-consumer-fears-fuel-stock-selloff-120e0dd7",
      "score": 15
    },
    {
      "title": "PONY Announcement: If You Have Suffered Losses in Pony AI Inc. (NASDAQ: PONY), You Are Encouraged to Contact The Rosen Law Firm About Your Rights",
      "content": "NEW YORK, March 28, 2025 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, announces an investigation of potential securities claims on behalf of shareholders of Pony AI Inc. (NASDAQ: PONY) resulting from allegations that Pony AI may have issued materially misleading business information to the investing public.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "22:42",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/29/3051714/673/en/PONY-Announcement-If-You-Have-Suffered-Losses-in-Pony-AI-Inc-NASDAQ-PONY-You-Are-Encouraged-to-Contact-The-Rosen-Law-Firm-About-Your-Rights.html",
      "score": 5
    },
    {
      "title": "Shiba Inu Outpaces Bitcoin, Ethereum in Long-Term Holder Growth",
      "content": "Shiba Inu (SHIB) has outpaced Bitcoin (BTC) and Ethereum (ETH) in the percentage of long-term holders, signaling growing investor confidence in the memecoin.",
      "source": "zycrypto.com",
      "date": "28/03/2025",
      "time": "22:11",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://zycrypto.com/shiba-inu-outpaces-bitcoin-ethereum-in-long-term-holder-growth/",
      "score": 5
    },
    {
      "title": "Autodesk, Inc. (NASDAQ: ADSK) Stock Transaction and Strategic Initiatives",
      "content": "<ul>\n<li>Senior Vice President and Chief Accounting Officer, Hope Stephen W., sold 2,452 shares at <strong>$267.29</strong> each, leaving him with 3,003 shares.</li>\n<li>Autodesk is actively engaging with shareholders and has appointed two independent directors to its Board, aiming to enhance shareholder value.</li>\n<li>The company's strategic efforts and strong business performance are highlighted by its recent financial results and initiatives, despite a slight decrease in stock price to <strong>$261.63</strong>.</li>\n</ul>\n\n<p><a href=\"https://site.financialmodelingprep.com/financial-summary/NASDAQ:ADSK\">Autodesk, Inc. (NASDAQ: ADSK)</a> is a leading software company known for its design and engineering software, widely used in industries such as architecture, engineering, and construction. The company faces competition from firms like Adobe and Dassault Systèmes. Recently, Autodesk has been in the news due to a stock transaction by its Senior Vice President and Chief Accounting Officer, Hope Stephen W.</p>\n\n<p>On March 28, 2025, Hope Stephen W. sold 2,452 shares of Autodesk's common stock at <strong>$267.29</strong> each. This transaction leaves him with 3,003 shares. This sale comes amid Autodesk's ongoing efforts to enhance shareholder value, as highlighted by its response to Starboard Value LP's comments. Autodesk emphasizes its strong business performance and strategic initiatives aimed at generating long-term value.</p>\n\n<p>Autodesk has been actively engaging with its shareholders, representing over half of its outstanding shares, to maintain a constructive dialogue. The company has also strengthened its Board of Directors by appointing two independent directors with proven records of value creation. Despite Starboard's tactics, including misrepresentations and a reduction of its stake, Autodesk remains committed to acting in the best interests of its shareholders.</p>\n\n<p>The company's recent financial results and strategic initiatives have led to total shareholder returns that surpass those of its peers. Autodesk has been working to drive growth, expand operating margins, and generate substantial free cash flow. In fiscal year 2025, the company launched a new go-to-market approach, further solidifying its market position.</p>\n\n<p>Currently, Autodesk's stock price is <strong>$261.63</strong>, reflecting a decrease of 3.03% or <strong>$8.18</strong>. The stock has traded between $260.94 and $268.28 today, with a market capitalization of approximately <strong>$55.73 billion</strong>. The trading volume for the day is 1,233,244 shares on the NASDAQ exchange. Despite the recent dip, Autodesk's strategic efforts and strong business performance continue to position it well in the market.</p>",
      "source": "Financial Modeling Prep",
      "date": "28/03/2025",
      "time": "19:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://financialmodelingprep.com/market-news/autodesk-inc-stock-transaction-strategic-initiatives",
      "score": 5
    },
    {
      "title": "FLNC INVESTOR NOTICE: Robbins Geller Rudman & Dowd LLP Announces that Fluence Energy, Inc. Investors with Substantial Losses Have Opportunity to Lead Investor Class Action Lawsuit",
      "content": "SAN DIEGO, March 28, 2025 (GLOBE NEWSWIRE) -- Robbins Geller Rudman & Dowd LLP announces that the Fluence Energy class action lawsuit – captioned Abramov v. Fluence Energy, Inc., No. 25-cv-00444 (E.D. Va.) – seeks to represent purchasers or acquirers of Fluence Energy, Inc. (NASDAQ: FLNC) common stock and charges Fluence Energy as well as certain of Fluence Energy's top executives with violations of the Securities Exchange Act of 1934.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "22:55",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/29/3051717/0/en/FLNC-INVESTOR-NOTICE-Robbins-Geller-Rudman-Dowd-LLP-Announces-that-Fluence-Energy-Inc-Investors-with-Substantial-Losses-Have-Opportunity-to-Lead-Investor-Class-Action-Lawsuit.html",
      "score": 3
    },
    {
      "title": "FLUENCE ENERGY SHAREHOLDER ALERT BY FORMER LOUISIANA ATTORNEY GENERAL: KAHN SWICK & FOTI, LLC REMINDS INVESTORS WITH LOSSES IN EXCESS OF $100,000 of Lead Plaintiff Deadline in Class Action Lawsuit Against Fluence Energy, Inc. - FLNC",
      "content": "NEW YORK CITY and NEW ORLEANS , March 28, 2025 /PRNewswire/ -- Kahn Swick & Foti, LLC (\"KSF\") and KSF partner, former Attorney General of Louisiana, Charles C. Foti, Jr., remind investors that they have until May 12, 2025 to file lead plaintiff applications in a securities class action lawsuit against Fluence Energy, Inc. (NasdaqGS: FLNC), if they purchased the Company's shares between November 29, 2023, and February 10, 2025, inclusive (the \"Class Period\").",
      "source": "prnewswire.com",
      "date": "28/03/2025",
      "time": "22:50",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/fluence-energy-shareholder-alert-by-former-louisiana-attorney-general-kahn-swick--foti-llc-reminds-investors-with-losses-in-excess-of-100-000-of-lead-plaintiff-deadline-in-class-action-lawsuit-against-fluence-energy-inc---fl-302414660.html",
      "score": 0
    },
    {
      "title": "Empowering Entrepreneurs: How Amazon Wealth Automation is Redefining E-Commerce Success",
      "content": "Amazon Wealth Automation Logo SAN DIEGO, March 28, 2025 (GLOBE NEWSWIRE) -- In the dynamic landscape of online business, success requires more than just selling products—it demands strategic execution, industry expertise, and a forward-thinking approach. Amazon Wealth Automation, founded by e-commerce expert Jason Alex, is setting a new standard for Amazon FBA entrepreneurs by offering a fully managed, done-for-you business solution that removes barriers and maximizes profitability thru E-Commerce Automation.",
      "source": "globenewswire.com",
      "date": "28/03/2025",
      "time": "22:28",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/29/3051710/0/en/Empowering-Entrepreneurs-How-Amazon-Wealth-Automation-is-Redefining-E-Commerce-Success.html",
      "score": 0
    },
    {
      "title": "Bitcoin's Rise Isn't Random: Analyst Reveals What's Really Fueling BTC Above $85K",
      "content": "Bitcoin (BTC) continues to trade above the $84,000 mark despite a slight decline in momentum this week. After briefly touching higher levels of nearly $90,000, the asset has seen a 3.3% decrease over the past day, bringing its current price to roughly $84,222.",
      "source": "newsbtc.com",
      "date": "28/03/2025",
      "time": "22:00",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-rise-isnt-random-analyst-reveals-whats-really-fueling-btc-above-85k/",
      "score": 0
    },
    {
      "title": "Car dealer explains why your car and its repairs will cost more due to Trump's tariffs",
      "content": "President Trump is putting a 25% tariff on cars and some auto parts imported into the United States. It's likely going to cost you more to buy a new or used vehicle or repair the one you have.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "19:16",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=cVQbqZGUVdE",
      "score": 0
    },
    {
      "title": "Policymakers weigh whether it's uncertainty or tariffs fueling the market downturn",
      "content": "Tariffs have been a significant factor in trade relations, especially with countries like China and Canada. Veda Partners managing partner and director of economic policy Henrietta Treyz joins Market Domination to explain how these tariffs are affecting President Trump's support among working-class voters and the difficulties of reaching successful trade agreements.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "17:42",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=wl16TF9LAlU",
      "score": 0
    }
  ],
  "events": [
    {
      "title": "Dallas Fed Manufacturing Index (Mar)",
      "date": "31/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Waller Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Chair Powell Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Nonfarm Payrolls Private (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Non Farm Payrolls (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Unemployment Rate (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Apr/02)",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Jefferson Speech",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    }
  ],
  "lastUpdated": "2025-03-29T03:04:20.450474"
}