{
  "us": [
    {
      "title": "Richmond Fed President Barkin: Consumers are exhausted and frustrated with high prices",
      "content": "CNBC's Steve Liesman with Richmond Fed President Tom Barkin, join 'Closing Bell' to discuss the Fed, inflation, tariffs and the economic backdrop.",
      "source": "youtube.com",
      "date": "31/03/2025",
      "time": "15:42",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=9XO45WW6Y_U",
      "score": 26
    },
    {
      "title": "Tariffs Spark Recession Worries. Where to Invest Beyond the Usual Suspects.",
      "content": "Uneasiness about the economy is likely to remain, whatever happens this week. That wasn't the case in the past two years—and a different backdrop will likely produce different winners.",
      "source": "barrons.com",
      "date": "31/03/2025",
      "time": "15:38",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.barrons.com/articles/trump-tariffs-recession-comsumer-stocks-9a7be618",
      "score": 23
    },
    {
      "title": "Palantir: Defying Valuation Gravity",
      "content": "Palantir's business is breaking the fundamental barrier as its Rule of 40 score reaches 81%. Growth acceleration, margin expansion, and record customer deals are driving Palantir stock to new heights. However, the stock may have gotten ahead of its fundamentals, leading to valuation multiples ballooning to unsustainable levels.",
      "source": "seekingalpha.com",
      "date": "31/03/2025",
      "time": "16:17",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4772028-palantir-defying-valuation-gravity",
      "score": 10
    },
    {
      "title": "Bitcoin whale accumulation trend mirrors 2020-era bullish activity after BTC price bounces off $81K",
      "content": "Bitcoin (BTC) price dipped below its ascending channel pattern over the weekend, dropping to $81,222 on March 31. The top cryptocurrency is set to register its worst quarterly return since 2018, but a group of whale entities are mirroring a 2020-era bull run signal.",
      "source": "cointelegraph.com",
      "date": "31/03/2025",
      "time": "15:45",
      "category": "crypto",
      "impact": "neutral",
      "country": "us",
      "url": "https://cointelegraph.com/news/bitcoin-whale-accumulation-trend-mirrors-2020-era-bullish-activity-after-btc-price-bounces-off-81-k",
      "score": 10
    },
    {
      "title": "With Strategy's 528K BTC Hoard, 4 Entities Now Dominate 7.53% of Bitcoin",
      "content": "With the acquisition of 22,048 bitcoin on Monday, Strategy (formally Microstrategy) elevated its total holdings to 528,185 BTC. This positions the firm as the second-largest corporate holder of the leading cryptocurrency, surpassed only by Blackrock's IBIT exchange-traded fund (ETF).",
      "source": "news.bitcoin.com",
      "date": "31/03/2025",
      "time": "15:30",
      "category": "crypto",
      "impact": "neutral",
      "country": "us",
      "url": "https://news.bitcoin.com/with-strategys-528k-btc-hoard-4-entities-now-dominate-7-53-of-bitcoin/",
      "score": 10
    },
    {
      "title": "BlackRock CEO: Bitcoin Could Take The Dollar's Role As World Reserve Currency",
      "content": "Larry Fink, CEO of BlackRock, claimed in a recent letter that Bitcoin and crypto could damage the dollar's international standing. If investors treat Bitcoin as an inflation hedge to the dollar, it could precipitate serious trouble.",
      "source": "beincrypto.com",
      "date": "31/03/2025",
      "time": "15:27",
      "category": "crypto",
      "impact": "neutral",
      "country": "us",
      "url": "https://beincrypto.com/blackrock-fink-crypto-bitcoin-dollar-dominance/",
      "score": 10
    },
    {
      "title": "Orchestra BioMed Reports Full Year 2024 Financial Results and Provides a Fourth Quarter Business Update",
      "content": "NEW HOPE, Pa., March 31, 2025 (GLOBE NEWSWIRE) -- Orchestra BioMed Holdings, Inc. (Nasdaq: OBIO, “Orchestra BioMed” or the “Company”), a biomedical innovation company accelerating high-impact technologies to patients through risk-reward sharing partnerships, today reported its full year 2024 financial results and provided a fourth quarter business update.",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:21",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052798/0/en/Orchestra-BioMed-Reports-Full-Year-2024-Financial-Results-and-Provides-a-Fourth-Quarter-Business-Update.html",
      "score": 8
    },
    {
      "title": "AgEagle Aerial Systems Provides a Corporate Update and Reports Fiscal 2024 Financial Results",
      "content": "Year-end highlights include three record product orders and $6.8M in expense reduction effectively positioning the Company for long-term growth",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:16",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052794/0/en/AgEagle-Aerial-Systems-Provides-a-Corporate-Update-and-Reports-Fiscal-2024-Financial-Results.html",
      "score": 8
    },
    {
      "title": "Excelerate Energy Announces Proposed Public Offering of Class A Common Stock",
      "content": "THE WOODLANDS, Texas--(BUSINESS WIRE)--Excelerate Energy, Inc. (NYSE: EE) (“Excelerate” or the “Company”) announced that it has commenced an underwritten public offering of $150 million of shares of its Class A common stock. In connection with this offering, the Company expects to grant the underwriters a 30-day option to purchase up to $22.5 million of additional shares of Class A common stock at the public offering price, less the underwriting discounts and commissions. The offering is subjec.",
      "source": "businesswire.com",
      "date": "31/03/2025",
      "time": "16:16",
      "category": "marches",
      "impact": "negative",
      "country": "us",
      "url": "https://www.businesswire.com/news/home/20250331892474/en/Excelerate-Energy-Announces-Proposed-Public-Offering-of-Class-A-Common-Stock/",
      "score": 5
    },
    {
      "title": "Elon Musk debunks rumors: U.S. government won't adopt Dogecoin",
      "content": "Elon Musk clarifies that there are no government plans for Dogecoin, as DOGE faces bearish trends and uncertainty.",
      "source": "ambcrypto.com",
      "date": "31/03/2025",
      "time": "16:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://ambcrypto.com/elon-musk-debunks-rumors-u-s-government-wont-adopt-dogecoin/",
      "score": 5
    },
    {
      "title": "The geopolitical risk premium is likely to come back into the market, says Rapidan CEO Bob McNally",
      "content": "Bob McNally, Rapidan Energy Group CEO, joins 'Power Lunch' to discuss Trump targeting Russian oil and the oil trade.",
      "source": "youtube.com",
      "date": "31/03/2025",
      "time": "14:51",
      "category": "marches",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=VvYpXYzyvyg",
      "score": 5
    },
    {
      "title": "Citi Trims Cummins Target to $360 Amid Freight Slowdown, But Keeps Bullish Outlook",
      "content": "<p>Citi lowered its price target on <a href='https://financialmodelingprep.com/financial-summary/CMI'>Cummins (NYSE:CMI)</a> from $430 to $360, maintaining a Buy rating despite near-term headwinds in the commercial vehicle market. As a result, shares fell around 2% intra-day today.</p>\n<p>Citi cited a weaker freight environment and recent cuts to North American truck production forecasts from ACT Research as key factors behind the revised estimates. Dealers are reportedly experiencing “order paralysis” among fleet buyers, who are holding back on new purchases amid uncertainty around Trump-era tariffs and potential revisions to EPA 2027 emissions regulations.</p>\n<p>While Citi’s updated 2025 estimates for Cummins now fall toward the lower end of the company’s own guidance, the firm believes CMI is better positioned than peers to navigate the cyclical softness. Unlike others in the space, Cummins benefits from broad geographic reach, a diversified product portfolio, and strong pricing stability.</p>\n<p>Among Citi’s coverage of the commercial vehicle sector, Cummins stands out as the only stock with a Buy rating, supported by the company’s ability to withstand short-term pressure while maintaining long-term earnings strength.</p>\n",
      "source": "Financial Modeling Prep",
      "date": "31/03/2025",
      "time": "10:53",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://financialmodelingprep.com/market-news/fmp-citi-trims-cummins-target-to-$360-amid-freight-slowdown-but-keeps-bullish-outlook",
      "score": 5
    },
    {
      "title": "Report: New Auto Tariffs Could Impact Consumer Spending Across Economy",
      "content": "New U.S. tariffs on automobiles and auto parts reportedly may lead to a reduction of consumer purchasing power and spending across the economy.",
      "source": "pymnts.com",
      "date": "31/03/2025",
      "time": "15:18",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.pymnts.com/economy/2025/new-auto-tariffs-could-impact-consumer-spending-across-economy/",
      "score": 3
    },
    {
      "title": "Markets looking for signs that 'U.S. exceptionalism story' is coming to an end, analyst says",
      "content": "Elsa Lignos, global head of FX strategy at RBC Capital Markets, discusses the performance of the dollar and how U.S. President Donald Trump's administration is impacting the economy and markets.",
      "source": "youtube.com",
      "date": "31/03/2025",
      "time": "15:00",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=SqzS-hpfCRM",
      "score": 3
    },
    {
      "title": "Silynxcom Ltd. Announces Proposed Public Offering of Ordinary Shares",
      "content": "Netanya, Israel, March 31, 2025 (GLOBE NEWSWIRE) -- Silynxcom Ltd. (NYSE American: SYNX) (“Silynxcom” or the “Company”), a manufacturer and developer of ruggedized tactical communication headset devices as well as other communication accessories, today announced that it intends to offer to sell ordinary shares in an underwritten public offering. All of the ordinary shares are to be sold by the Company. The offering is subject to market conditions, and there can be no assurance as to whether or when the offering may be completed or as to the actual size or terms of the offering.",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:26",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052801/0/en/Silynxcom-Ltd-Announces-Proposed-Public-Offering-of-Ordinary-Shares.html",
      "score": 2
    }
  ],
  "france": [
    {
      "title": "The S&P 500 Plunged In March, Recession Fears Rising",
      "content": "Stocks plunged in March due to uncertainty over Trump's tariff plans, with the S&P 500 ETF down 6% and the Nasdaq 100 ETF down 8%. Defensive sectors like Utilities, Consumer Staples, and Health Care outperformed, while Energy was the only sector to finish higher, attracting investors with high yields.",
      "source": "seekingalpha.com",
      "date": "31/03/2025",
      "time": "16:00",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771995-sp500-plunged-in-march-recession-fears-rising",
      "score": 25
    },
    {
      "title": "Is The Correction Over, Or Is There More To Come?",
      "content": "Warren Buffett's $325 billion cash reserve reflects his cautious approach, as the Buffett Indicator shows the market is highly overvalued at 193%, down from 211%. Nvidia's dominance in AI hardware with an 88% market share is impressive, but AI's infancy and potential competition pose significant risks.",
      "source": "seekingalpha.com",
      "date": "31/03/2025",
      "time": "15:58",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://seekingalpha.com/article/4772018-is-the-correction-over-or-is-there-more-to-come",
      "score": 13
    },
    {
      "title": "JOHN HANCOCK PREMIUM DIVIDEND FUND NOTICE TO SHAREHOLDERS - SOURCES OF DISTRIBUTION UNDER SECTION 19(a)",
      "content": "BOSTON , March 31, 2025 /PRNewswire/ - John Hancock Premium Dividend Fund (NYSE: PDT) (the \"Fund\"), a closed-end fund managed by John Hancock Investment Management LLC and subadvised by Manulife Investment Management (US) LLC, announced today sources of its monthly distribution of $0.0825 per share paid to all shareholders of record as of March 13, 2025, pursuant to the Fund's managed distribution plan. This press release is issued as required by an exemptive order granted to the Fund by the U.S. Securities and Exchange Commission.",
      "source": "prnewswire.com",
      "date": "31/03/2025",
      "time": "16:17",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/john-hancock-premium-dividend-fund-notice-to-shareholders--sources-of-distribution-under-section-19a-302416171.html",
      "score": 7
    },
    {
      "title": "JPMorgan Chase and Citi Partnering With Stablecoin Issuer Circle for April IPO: Report",
      "content": "Stablecoin firm Circle is teaming up with top American banks as it prepares for a reported April initial public offering (IPO) launch. According to a new Fortune report, USDC-issuer Circle is working with JPMorgan Chase and Citi Bank to publicly list the firm's shares next month.",
      "source": "dailyhodl.com",
      "date": "31/03/2025",
      "time": "15:55",
      "category": "marches",
      "impact": "neutral",
      "country": "france",
      "url": "https://dailyhodl.com/2025/03/31/jpmorgan-chase-and-citi-partnering-with-stablecoin-issuer-circle-for-april-ipo-report/",
      "score": 7
    },
    {
      "title": "Labcorp to Announce First Quarter Financial Results on April 29, 2025",
      "content": "BURLINGTON, N.C. , March 31, 2025 /PRNewswire/ -- Labcorp Holdings Inc. (NYSE: LH), a global leader of innovative and comprehensive laboratory services, will release its financial results for the first quarter of 2025 before the market opens on Tuesday, April 29, 2025.",
      "source": "prnewswire.com",
      "date": "31/03/2025",
      "time": "16:15",
      "category": "marches",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/labcorp-to-announce-first-quarter-financial-results-on-april-29-2025-302416003.html",
      "score": 4
    },
    {
      "title": "Vivos Therapeutics Reports Full Year 2024 Financial Results and Provides Operational Update",
      "content": "Year over year product revenue increased 26% Operating expenses declined 21% and year over year operating loss decreased 35% Management to Host Conference Call today at 5:00 pm ET LITTLETON, Colo., March 31, 2025 (GLOBE NEWSWIRE) -- Vivos Therapeutics, Inc. (“Vivos” or the “Company'') (NASDAQ: VVOS), a leading medical device and technology company specializing in the development and commercialization of highly effective proprietary treatments for sleep related breathing disorders (including all severities of obstructive sleep apnea (OSA in adults) and moderate to severe OSA in children ages 6 - 17), today reported financial results and operating highlights for the full year ended December 31, 2024.",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:20",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052795/0/en/Vivos-Therapeutics-Reports-Full-Year-2024-Financial-Results-and-Provides-Operational-Update.html",
      "score": 3
    },
    {
      "title": "Cue Biopharma Reports Fourth Quarter and Full Year 2024 Financial Results and Business Highlights",
      "content": "BOSTON, March 31, 2025 (GLOBE NEWSWIRE) -- - Cue Biopharma, Inc. (Nasdaq: CUE), a clinical-stage biopharmaceutical company developing a novel class of therapeutic biologics to selectively engage and modulate disease-specific T cells for the treatment of cancer and autoimmune disease, today reported fourth quarter and full year 2024 financial results.",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:20",
      "category": "marches",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052796/0/en/Cue-Biopharma-Reports-Fourth-Quarter-and-Full-Year-2024-Financial-Results-and-Business-Highlights.html",
      "score": 2
    },
    {
      "title": "Bitcoin, Ethereum, XRP, Dogecoin Flatline As Markets Brace For Impact Of Trump Tariffs",
      "content": "Cryptocurrency markets are trading in a tight sideways range on Monday as markets expect the impact of tariff announcements on Wednesday. Cryptocurrency Price Gains +/- Bitcoin (CRYPTO: BTC) $83,316 +0.7% Ethereum (CRYPTO: ETH) $1,841 +0.8% Solana (CRYPTO: SOL) $125.81 -0.5% XRP (CRYPTO: XRP) $2.12 -1.8% Dogecoin (CRYPTO: DOGE) $0.1674 -1.7% Shiba Inu (CRYPTO: SHIB) $0.0000125 -0.8% Notable Statistics: IntoTheBlock data shows large transaction volume decreasing by 10.39%.",
      "source": "benzinga.com",
      "date": "31/03/2025",
      "time": "15:22",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://www.benzinga.com/markets/cryptocurrency/25/03/44569936/bitcoin-ethereum-xrp-dogecoin-flatline-as-markets-brace-for-impact-of-trump-tariffs",
      "score": 2
    },
    {
      "title": "XTI Aerospace Announces Closing of Public Offering",
      "content": "ENGLEWOOD, Colo. , March 31, 2025 /PRNewswire/ -- XTI Aerospace, Inc. (Nasdaq: XTIA), (\"XTI\" or the \"Company\"), a pioneer in VTOL and powered-lift aircraft solutions, today announced the closing of its underwritten public offering of 2,941,200 shares of common stock (or pre-funded warrants (\"Pre-Funded Warrants\") in lieu thereof) and warrants to purchase up to 2,941,200 shares of common stock at a combined public offering price of $1.36 per share (inclusive of the Pre-Funded Warrant exercise price) and associated warrant.",
      "source": "prnewswire.com",
      "date": "31/03/2025",
      "time": "16:17",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.prnewswire.com/news-releases/xti-aerospace-announces-closing-of-public-offering-302416159.html",
      "score": 0
    },
    {
      "title": "Wrap Technologies, Inc. Reports Fourth Quarter and Full Year 2024 Results",
      "content": "MIAMI, March 31, 2025 (GLOBE NEWSWIRE) -- Wrap Technologies, Inc, (NASDAQ: WRAP) (“Wrap” or, the “Company”), a global leader in innovative public safety technologies and non-lethal tools, today announced financial and operating results for the fourth quarter and full year ended December 31, 2024. Q4 2024 Financial Results: Revenue increased 47%, from $0.6 million in 2023 to $0.9 million in 2024.",
      "source": "globenewswire.com",
      "date": "31/03/2025",
      "time": "16:16",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/31/3052793/0/en/Wrap-Technologies-Inc-Reports-Fourth-Quarter-and-Full-Year-2024-Results.html",
      "score": 0
    }
  ],
  "events": [
    {
      "title": "Dallas Fed Manufacturing Index (Mar)",
      "date": "31/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Waller Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Chair Powell Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Nonfarm Payrolls Private (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Unemployment Rate (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Non Farm Payrolls (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Apr/02)",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q1)",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    }
  ],
  "lastUpdated": "2025-03-31T20:35:54.586116"
}