{
  "lastUpdated": "2025-06-28T12:32:06.042066",
  "us": [
    {
      "title": "Live Nasdaq Composite: Markets Rev Engines for Potential All-Time Highs",
      "content": "Live Updates Live Coverage Has Ended So Close and Yet so Far 4:09 pm by Gerelyn Terzo The S&amp;P 500 and Nasdaq Composite indices both crossed over into record territory during today&#8217;s trading session but they came off those lofty levels by the market closing. The Nasdaq Composite still closed up about 1% to 20,167.91 while the S&amp;P 500 index finished the day 0.80% higher at 6,141.02. Big Tech Downgrade 12:55 pm by Gerelyn Terzo While Tesla stock received a ringing endorsement from Wall Street analysts today, Apple (Nasdaq: AAPL) is seeing the other side of the spectrum. JPMorgan analysts lowered their price target on the iPhone maker to $230 from $240, keeping their &#8220;overweight&#8221; rating on the stock. The analysts are worried about demand for the iPhone 17. Apple shares are lower by 0.79% today. The Nasdaq Composite is now up 0.70%. Benchmark Bullish on TSLA 11:01 am by Gerelyn Terzo Wall Street research firm Benchmark is bullish on EV leader Tesla (Nasdaq: TSLA). The firm believes TSLA stock has runway for 45% gains as a result of its competitive edge over rival robotaxi company Waymo. Benchmark lifted its price target on Tesla stock by a massive $125 to $450 per share. Tesla stock is up 0.39% today and is down 18.7% year-to-date. Wall Street Calls 10:00 am by Gerelyn Terzo Wall Street analysts are making some calls on the following stocks this morning: KeyBanc has started coverage of networking giant Cisco (Nasdaq: CSCO) with an &#8220;overweight&#8221; rating, saying the stock has plenty of runway for growth. Baird analysts are bullish on health stock Haemonetics (NYSE: HAE), beginning coverage with an &#8220;overweight&#8221; rating. UBS has reiterated its &#8220;neutral&#8221; rating on Apple (Nasdaq: APPL) stock, citing risks surrounding a potential deal with AI giant Perplexity. This article will be updated throughout the day, so check back often for more daily updates. The markets are showing off as stocks come within grasp of their latest all-time high levels. With the strikes between Israel and Iran seemingly behind, the markets have reason for optimism and they are taking it. All three of the major stock market averages are in the green out of the gate, including a 0.40% advance in the tech-laden Nasdaq Composite. The S&amp;P 500 is eyeing its latest all-time high of 2025, which is in the ballpark of 6,147, its early 2025 intraday high level. After Nvidia (Nasdaq: NVDA) clinched a new record high of approximately $156 per share, bullish sentiment has enveloped technology stocks for the most part. On the economic front, the economy slowed at a steeper pace than originally expected in Q1 2025. U.S. GDP declined by 0.5% in Q1 compared to original estimates of a 0.2% contraction. As the data continues to flow in, the Commerce Department downwardly revised results in areas such as consumer spending and exports. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 121.40 (+0.37%) Nasdaq Composite: Up 87.92 (+0.40%) S&amp;P 500: Up 21.43 (+0.39%) Market Movers AeroVironment (Nasdaq: AVAV) is gaining 9.2% today, extending its rally after posting impressive Q4 results that were powered by robust military drone demand, fueling a 40% increase in revenue. BP (NYSE: BP) is under pressure today amid reports that it is a takeover target involving industry giant Shell, rumors BP rebuffed. Micron Technology (Nasdaq: MU) is down slightly on the heels of its strong Q3 results, including better-than-expected profits and a positive outlook for the current quarter. The post Live Nasdaq Composite: Markets Rev Engines for Potential All-Time Highs appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-27 14:09:22",
      "date": "27/06/2025",
      "time": "14:09",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/26/live-nasdaq-composite-markets-rev-engines-for-potential-all-time-highs/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 51.65151515151515
    },
    {
      "title": "Apple supplier Jabil raises annual forecast as data center appetite remains strong",
      "content": "Electronics component maker Jabil raised full-year profit and revenue forecast on Tuesday, betting on strong infrastructure services demand for data centers.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 08:54:03",
      "date": "17/06/2025",
      "time": "08:54",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/technology/apple-supplier-jabil-raises-annual-forecast-data-center-appetite-remains-strong-2025-06-17/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 50.920959595959594
    },
    {
      "title": "Effort to strip Fed of interest paying power seen likely to bring upheaval to markets",
      "content": "A Republican senator's plan to take away the Federal Reserve's power to pay banks interest on cash they park on central bank books could cause chaos for monetary policy implementation if it were implemented, market participants said.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 17:15:25",
      "date": "12/06/2025",
      "time": "17:15",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/effort-strip-fed-interest-paying-power-seen-likely-bring-upheaval-markets-2025-06-12/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 50.722979797979804
    },
    {
      "title": "Swiss inflation turns negative for first time since COVID pandemic",
      "content": "Swiss inflation turned negative in May, marking the first decline in consumer prices for more than four years and adding pressure on the Swiss National Bank to cut its interest rate steeply later this month.",
      "source": "reuters.com",
      "rawDate": "2025-06-03 03:13:43",
      "date": "03/06/2025",
      "time": "03:13",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/retail-consumer/swiss-inflation-turns-negative-first-time-since-covid-pandemic-2025-06-03/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 50.075
    },
    {
      "title": "Norges Bank expected to cut rates twice more in 2025",
      "content": "Norway's central bank is expected to cut its policy interest rate twice more this year following last week's surprise reduction in the cost of borrowing from a near 17-year high, a Reuters poll of economists showed on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-24 04:11:27",
      "date": "24/06/2025",
      "time": "04:11",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/norges-bank-expected-cut-rates-twice-more-2025-2025-06-24/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 49.70353535353536
    },
    {
      "title": "Fed 'Beige Book' economic report cites declining growth, rising prices and slow hiring",
      "content": "The U.S. economy contracted over the past six weeks as hiring slowed and consumers and businesses worried about tariff-related price increases, the Fed reported. On inflation, the report described prices as rising \"at a moderate pace and \" widespread reports of contacts expecting costs and prices to rise at a faster rate going forward.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 14:36:39",
      "date": "04/06/2025",
      "time": "14:36",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/fed-beige-book-economic-report-cites-declining-growth-rising-prices-and-slow-hiring.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession",
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 48.04217171717172
    },
    {
      "title": "U.S. Treasury yields slide after retail sales tumbled in May, raising recession fears",
      "content": "U.S. Treasury yields fell after retail sales fell more than Wall Street expected last month, pushing up fixed income prices and lifting concern over a slowdown.",
      "source": "cnbc.com",
      "rawDate": "2025-06-17 17:30:25",
      "date": "17/06/2025",
      "time": "17:30",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/17/us-treasury-yields-trump-hints-israel-iran-conflict-escalation.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession"
        ],
        "sectors": [
          "technology",
          "finance",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 45.52020202020202
    },
    {
      "title": "No love for the dollar as markets fret about Fed independence",
      "content": "A battered dollar is taking another beating as investors, unnerved by fresh signs of an erosion in U.S. central bank independence, waste no time in pushing the greenback back to its lowest levels in over three years.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 07:56:02",
      "date": "26/06/2025",
      "time": "07:56",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/no-love-dollar-markets-fret-about-fed-independence-2025-06-26/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 44.44848484848485
    },
    {
      "title": "Wall Street, Main Street push for foreign tax rethink in US budget bill",
      "content": "Industry groups representing sectors including real estate, finance and multinational companies are pushing for the reduction or exclusion of a retaliatory tax targeting foreign investors in the U.S. in the Republican tax bill, as they see it as a threat to their businesses and to the broader markets and economy.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:29:38",
      "date": "09/06/2025",
      "time": "06:29",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/wall-street-main-street-push-foreign-tax-rethink-us-budget-bill-2025-06-09/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "crypto"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 43.02373737373737
    },
    {
      "title": "Trump rips into 'too late' Jerome Powell after Fed holds rates steady",
      "content": "President Donald Trump criticized Federal Reserve Chair Jerome Powell after the central bank kept rates steady for a fourth time. Trump called Powell a \"real dummy\" in a late night Truth Social post.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 11:04:14",
      "date": "19/06/2025",
      "time": "11:04",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/19/trump-powell-fed-interest-rates.html",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.64368686868687
    },
    {
      "title": "WWDC: Apple faces AI, regulatory challenges as it woos software developers",
      "content": "Apple is facing an unprecedented set of technical and regulatory challenges as some of its key executives are set to take the stage on Monday at the company's annual software developer conference.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:06:09",
      "date": "09/06/2025",
      "time": "06:06",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/wwdc-apple-faces-ai-regulatory-challenges-it-woos-software-developers-2025-06-09/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.28686868686869
    },
    {
      "title": "These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines",
      "content": "Key Points A &#8220;more is better&#8221; approach can help you diversify your portfolio while generating passive income. Five fascinating funds will tempt income seekers with potent yields and strong growth prospects. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Stock picking is fine, but exchange traded funds (ETFs) can enable immediate diversification without sacrificing growth and income opportunities. By selecting multiple funds instead of just one, you can achieve an extra measure of safety while also turning your portfolio into a veritable income-generating machine. The idea is to pick out ETFs with notable distribution yields (i.e., annualized cash payment percentages), but also to focus on a wide variety of funds with share-price growth potential. Now, let&#8217;s drill down on five fabulous ETFs so you can start accumulating shares for your income-machine portfolio today. NEOS NASDAQ-100 High Income ETF (QQQI) The name of the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) might lead you to assume that this fund only offers a hefty yield. There&#8217;s more to the story, though, as the QQQI ETF also enables investors to participate in strong technology-focused growth opportunities. Based on the NASDAQ 100 stock index with approximately 100 holdings, the NEOS NASDAQ-100 High Income ETF includes many large-cap tech names you&#8217;ll surely recognize. Some examples are NVIDIA (NASDAQ:NVDA), Apple (NASDAQ:AAPL), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Broadcom (NASDAQ:AVGO). There&#8217;s no denying that technology giants like Apple and NVIDIA are robust revenue generators. Consequently, the NEOS NASDAQ-100 High Income ETF share price could grow substantially over the long term. At the same time, many investors flock to the QQQI ETF for its eye-catching 13.92% distribution yield. Granted, the fund subtracts an annualized management fee (also known as the expense ratio) of 0.68% from the share price. Still, even after the expense ratio is taken out, investors can look forward to outstanding annual income with the QQQI ETF. Along with that, you&#8217;ll get to participate in the growth prospects of terrific tech titans when you hold the NEOS NASDAQ-100 High Income ETF. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) There&#8217;s another passive income machine that&#8217;s similar to QQQI, but it&#8217;s not identical. Brought to you by famous financier JPMorgan Chase (NYSE:JPM), the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) squeezes extra income from a range of high-confidence technology leaders. Much like the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100 and includes around 100 stocks (108, to be exact). From Microsoft to Apple, Amazon, and many more, you&#8217;ll find plenty of high-growth tech names in JEPQ. There&#8217;s a trade-off with the JPMorgan Nasdaq Equity Premium Income ETF when compared to the NEOS NASDAQ-100 High Income ETF. On the negative side, JEPQ has a rolling 12-month dividend yield of 11.01%, which isn’t as impressive as QQQI&#8217;s 13.92% distribution yield. On the positive side, however, the JPMorgan Nasdaq Equity Premium Income ETF has an annualized expense ratio of 0.35%. This is lower than the NEOS NASDAQ-100 High Income ETF&#8217;s 0.68% annual management fee. Perhaps most importantly, you&#8217;ll have the reassurance that comes with well-established fund management by JPMorgan Chase. Thus, for an interesting alternative to the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF is absolutely worth considering. Schwab U.S. Dividend Equity ETF (SCHD) Maybe you&#8217;re seeking a passive income machine that&#8217;s not as technology-heavy as QQQI and JEPQ. In that case, you&#8217;ll want to check out the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This fund includes has 103 stocks in its portfolio, but SCHD doesn&#8217;t track the NASDAQ 100 index. Instead, the Schwab U.S. Dividend Equity ETF tracks the Dow Jones U.S. Dividend 100 Index. Take a look at the fund’s top 10 holdings and you’ll find some technology firms, such as Cisco Systems (NASDAQ:CSCO) and Texas Instruments (NASDAQ:TXN). Yet, you&#8217;ll also see names from other sectors, including Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), Lockheed Martin (NYSE:LMT), and Conoco Phillips (NYSE:COP). Moreover, the Schwab U.S. Dividend Equity ETF offers a trailing 12-month distribution yield of 3.72% with an annual expense ratio of just 0.06%. The ultra-low management fees allow investors to grow their accounts steadily with the SCHD ETF. Two More Picks for Low Volatility To cap off this list of passive income machine picks, I&#8217;ve got two relatively low-risk funds to show you. First, there&#8217;s an ETF that concentrates on dividend-growing businesses instead of gigantic yield. The Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO) features a 4.81% annual distribution rate but also a 0.56% expense ratio, so the income opportunities are good but not jaw-dropping. On the other hand, DIVO tends to be low-volatility as it holds a diverse array of safe names, such as Home Depot, Visa (NYSE:V), Caterpillar (NYSE:CAT), Microsoft, and Goldman Sachs (NYSE:GS). The Amplify CWP Enhanced Dividend Income ETF emphasizes &#8220;high-quality large cap companies with a history of dividend and earnings growth.&#8221; This approach will typically reduce share-price volatility, so investors can sleep well at night while collecting passive income with DIVO. In a similar vein, the NEOS S&amp;P 500 High Income ETF (BATS:SPYI) is de-risked because it holds well-known large-cap stocks in multiple sectors. Indeed, SPYI might be the least risky fund on this list as it includes approximately 500 stocks in its holdings. Because the NEOS S&amp;P 500 High Income ETF generates income from the S&amp;P 500 index, it is a widely diversified fund. So, there&#8217;s a safety factor built into the SPYI ETF. In addition, the NEOS S&amp;P 500 High Income ETF is an enticing passive income machine with a 12.11% annual distribution rate. The fund&#8217;s 0.68% annual expense ratio isn&#8217;t super-low, but the fees may be justified as SPYI brings high yield and instant diversification to the table. All in all, I like DIVO and SPYI for reduced volatility, SCHD for low management fees, and QQQI and JEPQ for technology-sector exposure.The post These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 13:30:07",
      "date": "03/06/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/03/these-5-etfs-qqqi-jepq-schd-divo-spyi-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.151515151515156
    },
    {
      "title": "Apple eyes using AI to design its chips, technology executive says",
      "content": "Apple is interested in tapping generative artificial intelligence to help speed up the design of the custom chips at the heart of its devices, its top hardware technology executive said in private remarks last month.",
      "source": "reuters.com",
      "rawDate": "2025-06-18 19:16:41",
      "date": "18/06/2025",
      "time": "19:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-eyes-using-ai-design-its-chips-technology-executive-says-2025-06-18/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.1
    },
    {
      "title": "US consumer prices rise moderately; tariffs seen fanning inflation",
      "content": "Inflation is expected to accelerate in the coming months on the back of the Trump administration's import tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-06-11 08:38:04",
      "date": "11/06/2025",
      "time": "08:38",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/us/us-consumer-prices-rise-moderately-may-2025-06-11/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 41.81666666666667
    },
    {
      "title": "This outlook shows why investors should maintain exposure to the ‘Magnificent Seven'",
      "content": "Big Tech is expected to see double the earnings growth of the S&P 500, as long as the group can maintain momentum in a key area.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-26 09:20:00",
      "date": "26/06/2025",
      "time": "09:20",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.marketwatch.com/story/this-outlook-shows-why-investors-should-maintain-exposure-to-the-magnificent-seven-d9939fc3",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 41.4010101010101
    },
    {
      "title": "Inflation reports are encouraging, but the rest of the year remains uncertain: Former Fed official",
      "content": "The Federal Reserve will hold its June meeting on Tuesday, where Fed Chair Jerome Powell will announce the central bank's latest interest rate decision. US President Trump has been vocal in his criticism of Powell for not cutting rates, recently calling him a \"numbskull.",
      "source": "youtube.com",
      "rawDate": "2025-06-12 17:21:01",
      "date": "12/06/2025",
      "time": "17:21",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=iA6ASAixU40",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.72247474747475
    },
    {
      "title": "Tariffs Likely to ‘Weigh on Economic Activity' Fed Chair Says",
      "content": "The Federal Reserve wants more time to study the impact of tariffs before cutting rates. [contact-form-7] That's according to Jerome Powell, the central bank's chair, testifying Tuesday (June 24) that the Fed needs to see if tariffs push inflation higher before deciding on the interest rate cuts that President Donald Trump has demanded.",
      "source": "pymnts.com",
      "rawDate": "2025-06-24 16:56:39",
      "date": "24/06/2025",
      "time": "16:56",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.pymnts.com/economy/2025/tariffs-likely-to-weigh-on-economic-activity-fed-chair-says/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.78737373737374
    },
    {
      "title": "Court denies Apple appeal in Epic Games case, keeping App Store changes in place",
      "content": "A panel of judges denied Apple's emergency application to halt changes to its App Store that resulted from the company's legal battle with Epic Games. The ruling in the case means Apple can no longer charge a commission on payment links inside its apps nor tell developers how the links should look.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 17:40:52",
      "date": "04/06/2025",
      "time": "17:40",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/apple-appeal-epic-games-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.754797979797985
    },
    {
      "title": "U.S. inflation rises 0.1% in May from prior month, less than expected",
      "content": "The consumer price index was expected to rise 0.2% in May, with a 12-month inflation rate of 2.4%.",
      "source": "cnbc.com",
      "rawDate": "2025-06-11 08:32:21",
      "date": "11/06/2025",
      "time": "08:32",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/11/cpi-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.86313131313131
    },
    {
      "title": "Jim Cramer is not giving up on Apple. Here's why",
      "content": "CNBC's Jim Cramer told investors why he's still pulling for Apple, even as its stock lags behind the averages. \"If Apple can shake off its current shroud of negativity — maybe they make nice with President Trump somehow — I could justify paying 35 times earnings for the stock,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-27 18:40:17",
      "date": "27/06/2025",
      "time": "18:40",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/27/jim-cramer-apple.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 36.75176767676767
    },
    {
      "title": "Apple's stock has been in a slump — and these analysts don't see an easy way out",
      "content": "Needham analysts say the stock looks pricey, while Apple faces growing threats from its tech rivals.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 11:16:00",
      "date": "04/06/2025",
      "time": "11:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-has-been-in-a-slump-and-these-analysts-dont-see-an-easy-way-out-6906acd0",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.20202020202021
    },
    {
      "title": "Why OpenAI's latest moves could signal more trouble ahead for Apple's stock",
      "content": "Apple hasn't spent enough on AI infrastructure and risks falling behind as rivals get more creative with their devices.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-05 07:52:00",
      "date": "05/06/2025",
      "time": "07:52",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/why-openais-latest-moves-could-signal-more-trouble-ahead-for-apples-stock-5e59e884",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.10328282828283
    },
    {
      "title": "32% of Warren Buffett's $281 Billion Berkshire Hathaway Portfolio Is Invested in These 2 S&P 500 Dividend Stocks",
      "content": "Berkshire Hathaway (BRK.A -0.97%) (BRK.B -0.92%) CEO Warren Buffett has steered his company to market-crushing performance over multiple decades -- so much so that he has earned the nickname \"the Oracle of Omaha.\" When he steps down from his role as the company's chief executive at the end of this year, it will mark the close of one of the most fantastic corporate leadership runs in history.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:35:00",
      "date": "04/06/2025",
      "time": "04:35",
      "category": "markets",
      "impact": "negative",
      "country": "us",
      "url": "https://www.fool.com/investing/2025/06/04/warren-buffett-berkshire-sp-500-dividend-stocks/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.09444444444445
    },
    {
      "title": "Apple loses bid to pause app store reform order in Epic Games case",
      "content": "Apple has failed to persuade a U.S. appeals court to pause key parts of a federal judge's order requiring the iPhone maker to immediately open its lucrative App Store to more competition.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 17:10:52",
      "date": "04/06/2025",
      "time": "17:10",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-loses-bid-pause-app-store-reform-order-epic-games-case-2025-06-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.019444444444446
    }
  ],
  "france": [
    {
      "title": "Jim Cramer Is Fixated On An International Rotation",
      "content": "One of the world’s most prolific talking heads around the stock market, Jim Cramer needs little introduction in the financial world. The host of MAD MONEY on CNBC, Cramer, has been in the investing and media game for years, and for the most part, he’s got his pulse on the market better than most. Key Points Jim Cramer is taking a long, hard look at some European names that have been overlooked. His take is that Europe has been overlooked for too long, and some major brands are experiencing financial growth in the region. Camer wholeheartedly believes that ignoring Europe would mean ignoring financial gains. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) A continent with nearly 750 million people, Cramer believes this region of the world has been overlooked for far too long. Indicating that this region is on the rise, his take is that the state of Europe is very strong, something heavyweight giants like the CEO of Cisco support wholeheartedly. Europe Is Coming Back There is no question that Cramer, who believes Wall Street has overlooked Europe unnecessarily, is fixated on the region&#8217;s sudden rise and the belief that a host of companies are experiencing significant success. Cramer notes that there has been an increase in spending, particularly in the technology sector, across Europe. He highlights that even the telecom companies, which have generally been adverse to big spending in the region, are now opening up their wallets in a meaningful and impactful way. His concern is that Wall Street has ignored Europe for far too long. Still, Portugal, Italy, Spain, and numerous other countries in the European region are now directly on Cramer’s radar. Amazon (AMZN) When it comes to Amazon, Cramer specifically highlights that the company has been losing money in Europe for as long as he can remember. Now, the company has turned the corner, showing at least one billion in profit in the last quarter alone, just from European sales. He also thinks that the stock is on the rise, specifically because investors are seeing the growth potential in Europe. According to online research, Amazon has a market penetration of at least 64% in Germany and approximately 50% of the online market in Spain. This is before you turn your attention to France, where 35% of the spending shoppers do online goes to Amazon. In Italy, nearly 70% of all online spending is directed to Amazon, which further supports Jim’s point that Amazon is a must-watch stock in Europe. Apple (AAPL) When you consider that Apple saw a 10% increase in iPhone shipments in Europe in the first quarter of 2025, despite a worldwide decline, it’s another reason in favor of Cramer’s outlook on the company. This led to almost a billion dollars in profit for the first quarter, similar to Amazon&#8217;s, just in Europe. Cramer indicates that nobody saw this coming, and yet, it’s a telling sign that Apple is seeing these kinds of numbers in the market. Burberry (BURBY) Burberry, headquartered in London, recently announced that it was laying off 20% of its global workforce, but this didn’t stop its stock from jumping in response. On June 25, 2025, the company highlighted that Q1 sales were proof that its resilience in the market was no fluke. It also expects the first quarter of its 2026 financial year to outperform the fourth quarter of 2025, which boosts Cramer&#8217;s argument about these specific companies. Deutsche Telekom (DTEGY) European telecom giant Deutsche Telekom is also back on the rise, especially in light of its recent signing a deal with NVIDIA to establish an AI cloud for European manufacturers in Germany. NVIDIA said it will supply at least 10,000 chips to be used in Deutsche Telekom&#8217;s data centers, which is a win for both companies and demonstrates that DT is no longer hesitant to invest significantly. Cramer specifically highlights this willingness to open its wallet as a reason to keep an eye on this stock. ASML (ASML) Another company on Cramer’s radar is ASML, a Dutch multinational corporation specializing in the semiconductor industry, which is poised for significant financial growth. The company is standing by its reduced forecast from a month ago, but Cramer doesn’t think anyone is properly paying attention to the stock. He says this is one to watch. The post Jim Cramer Is Fixated On An International Rotation appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-27 10:35:56",
      "date": "27/06/2025",
      "time": "10:35",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://247wallst.com/investing/2025/06/26/jim-cramer-is-fixated-on-an-international-rotation/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.015151515151516
    },
    {
      "title": "QQQI vs. JEPQ: Which ETF is the True Dividend King?",
      "content": "Key Points The NASDAQ-100 is a volatile index that offers considerable long term upside amidst its intraday turbulence. Use of financial derivatives for both risk mitigation and for potentially larger leveraged gains has become routine in the financial world, especially for QQQI and JEPQ. To qualify as a “Dividend King”, a stock must have a track record of 50 or more consecutive years of dividend increases due to the underlying issuing company’s intrinsic growth. ETF “dividend kings” are metaphorical, but may reference a head to head comparison. Are you ahead or behind on your retirement goals? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted and must act in your best interests. Don’t waste another minute – get started by clicking here.(Sponsor) Seven of the top largest S&amp;P 500 stocks by market cap are tech industry companies that have been dubbed “The Magnificent 7” due to their remarkable tandem bull run over the past several years. These stocks are:: Apple, Amazon, Alphabet (Google), Microsoft, Meta Platforms (Facebook), Nvidia, and Tesla. In order to give better focus on the tech and other higher growth sectors, which tend to be listed on NASDAQ, the NASDAQ-100 index was created to track the top 100 NASDAQ listed companies that are not in the financial sector, as the tech emphasis also purports to emphasize innovation and new products instead of financial companies, which ostensibly do not. The launch of Exchange Traded Funds (ETFs) that track the NASDAQ-100 index was a foregone conclusion, and several of them already vie for investor dollars on a daily basis. Two that have exhibited sizable growth but have been able to augment their gains in the form of dividends, are: The NEOS Nasdaq-100 High Income ETF (NASDAQ: QQQI), and the JP Morgan Nasdaq Equity Premium Income ETF (NASDAQ: JEPQ). Ironically, both indexes generate their high yields through strategic innovations that rival those in the tech sector, in terms of their potential to deliver performance enhancements for their assigned tasks. How QQQI and JEPQ Compare &#8211; An Overview Both QQQI and JEPQ track the NASDAQ 1oo ETF, which is very volatile, due to its heavy weighting in the technology sector. Both ETFs are still relatively young. QQQI only launched in January, 2024 and JEPQ began in May, 2022. The following details are based on market price at the time of this writing: Category QQQI JEPQ Yield 14.55% 11.28% Net Assets $1.76 billion $26.27 billion Average Daily Volume 970,269 shares 7.29 million shares Expense Ratio 0.68% 0.35% Beta 0.00 0.83 52-week range 41.17-54.47 44.31-58.54 1-year return 14.37% 7.69% 1-year trailing return 15.24% 8.49% 3-year return n/a 14.40% Largest Hedge Fund Holder Second Half Financial Ptnrs Fisher Asset Mgmt. Sector Weighting #1 Technology &#8211; 52.41% Technology &#8211; 51.41% Sector Weighting #2 Communication Svc &#8211; 16.09% Communication Svc &#8211; 15.90% Sector Weighting #3 Consumer Cyclical &#8211; 12.85% Consumer Cyclical &#8211; 14.60% JEPQ Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 7.49% NVDA Nvidia Corp 7.35% AAPL Apple, Inc. 6.47% AMZN Amazon 4.92% GOOG Alphabet Class C 3.99% QQQI Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 8.61% NVDA Nvidia Corp 8.30% AAPL Apple, Inc. 7.59% AMZN Amazon 4.87% AVGO Broadcom 4.74% Strategic Differences Although they both utilize covered call options for creating dividends, JEPQ&#8217;s use of ELNs is more conservative than QQQI&#8217;s direct trading of out of the money calls in addition to its portfolio covered call writing. Both JEPQ and QQQI utilize option strategies to artificially create dividends for their shareholders. However there are both mechanical and risk/reward differences in their respective approaches. JEPQ uses Equity Linked Notes (ELNs), which are synthetic financial products created by financial institutions, and are linked to a particular index or stock. ELNs usually have a call option attached to a principal protection component, and can be likened to a short-term zero-coupon bond with a maturity of no longer than a few months. The returns on the ELN are linked to the underlying index or stock. Additionally, most, if not all ELNs are purchased directly from the issuer and held to maturity. There is no secondary market for ELNs. JEPQ manager Hamilton Reiner staggers one-month calls into multiple weekly buckets, then diversifies the expiration dates and strike prices. However, Reiner conducts this strategy with purchases of ELNs that give the JEPQ exposure to the profits on those call options, without the risk of any of the top tech stock holdings being subject to calls if the market takes off and the calls go in-the-money. Conversely, QQQI also utilizes a covered call strategy, in addition to out of the money call purchases to augment upside gains. QQQI writes their covered calls directly against the NASDAQ-100 index up to 100% of the equity value of total QQQI holdings. The fund then uses a portion of their covered call premium income to purchase out of the money call options. This give it the following result scenarios: If the market ends relatively flat, QQQI has kept the premium income minus the cost of the out of the money options. If the market jumps up, the underwritten covered call is already hedged against stocks, but QQQI can take profit on the out of the money call that ostensibly would be in the money due to the jump. Overall Analysis and The King of the Hill In This Competition For 1 year&#8217;s yield comparison, QQQI wins the &#8220;King of the Hill&#8221; contest against JEPQ, but has 49 years to go of upping the yield ante annually before being able to claim a &#8220;Dividend King&#8221; title. Selling covered calls is considered a viable strategy to mitigate volatility and take advantage of market volatility, which usually means increased delta and subsequently larger premiums. However, there is a reason why there is a sizable enough market on the buy side &#8211; there are enough people who think the option will increase in value. However, selling calls can limit interim upside, especially if the goal is for the option to expire worthless so the same underlying securities can cover another call writing opportunity next month. President Thomas Jefferson was once quoted, “ With risk comes great reward.” QQQI’s superior yield is a testament to the reward from being more aggressive and taking on more risk than JEPQ. However, with only slightly over 1 years’ worth of trading history and returns from which to judge, QQQI may be the dividend “king of the hill” only for the moment. Whether a consistent track record can be built or not on the QQQI strategy model, which needs to be actively managed by their presumably disciplined managers, remains to be seen. Since both companies’ dividends are artificially created through trading against market volatility, as opposed to intrinsic enhanced value through a business, the ability for JEPQ and QQQI rests solely on skill and knowledge of its managers. If they can first reach Dividend Aristocrat status (25 or more years of consecutive, annual dividend increases), then perhaps a hypothetical Dividend King discussion (50 consecutive years or more of dividend increases) can be had. The post QQQI vs. JEPQ: Which ETF is the True Dividend King? appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://247wallst.com/investing/2025/06/10/qqqi-vs-jepq-which-etf-is-the-true-dividend-king/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 44.54545454545455
    },
    {
      "title": "Expectations are for higher inflation and lower growth, says RBC's Frances Donald",
      "content": "CNBC's Steve Liesman, Morgan Stanley's Jim Caron, JPMorgan's David Kelly and RBC's Frances Donald join 'Power Lunch' to discuss the expectations for interest rates, the Federal Reserve and much more.",
      "source": "youtube.com",
      "rawDate": "2025-06-18 14:37:13",
      "date": "18/06/2025",
      "time": "14:37",
      "category": "economy",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=OEA0yECXyoY",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.00732323232323
    },
    {
      "title": "OECD Slashes Global Economic Forecasts Amid Tariffs, Trade Uncertainty",
      "content": "OECD Chief Economist Alvaro Santos Pereira discusses the Paris-based organization's decision to slash its global economic growth forecast to 2.9% this year, down from 3.3% in 2024. \"There's been a huge increase in trade and economic policy uncertainty,\" he tells Bloomberg Television.",
      "source": "youtube.com",
      "rawDate": "2025-06-03 05:40:39",
      "date": "03/06/2025",
      "time": "05:40",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=E-sUVQdcV3A",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.91010101010101
    },
    {
      "title": "OECD chops U.S. growth forecasts, cites risks to the downside as tariffs bite",
      "content": "The Paris-based global policy forum now sees U.S. growth at just 1.6% this year, and global growth at 2.9%.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-03 05:02:00",
      "date": "03/06/2025",
      "time": "05:02",
      "category": "economy",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/oecd-chops-u-s-growth-forecasts-cites-risks-to-the-downside-as-tariffs-bite-42be736c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 10.130555555555556
    }
  ],
  "uk": [
    {
      "title": "As China’s Dominance Dims, India Begins to Shine – The Time to Consider Investment Opportunities is Now",
      "content": "Key Points As US tariffs hit, China&#8217;s manufacturing sector feels the bite Geopolitics began the slide, many multinationals have been looking for a new low cost country/region Risks are still present, but India&#8217;s advancements over the past 30 years have them well positioned Are you ahead, or behind on retirement? SmartAsset&#8217;s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don&#8217;t waste another minute; get started by clicking here.(Sponsor) A seismic shift has transformed global manufacturing in recent years, with US and EU companies increasingly moving production from China to India. Accelerated by President Trump’s use of tariffs as trade weapons, this movement began a few years ago as geopolitical tensions and economic pressures began to raise concerns about supply chain resilience. India’s proactive policies have served to drive this trend toward supply chain diversification. While India has made remarkable progress over the past three decades, and holds vast potential as a manufacturing hub, infrastructure gaps and regulatory complexities present challenges. The primary driver is escalating friction with China. U.S.-China trade wars have imposed steep tariffs on Chinese goods, pushing companies to seek alternatives. From 2018 to 2022, U.S. goods imports from China dropped 10% (inflation-adjusted), while imports from India soared 44%, per trade data. Concerns over intellectual property theft and supply chain risks exposed during COVID-19 further fueled this shift. China’s rising labor and production costs have also eroded its edge in labor-intensive sectors like textiles and electronics, prompting companies to explore cost-competitive alternatives. India has emerged as a prime destination, propelled by initiatives like “Make in India” and Production Linked Incentive (PLI) schemes. These offer tax breaks (e.g., a 17% corporate tax rate for new manufacturing firms), subsidies to attract foreign direct investment (FDI), and a stable legal system rooted in British common law, safeguarding intellectual property. India’s youthful workforce (median age 28) and 1.4 billion-strong consumer market enhance its appeal. Apple, for example, has ramped up iPhone production in India, with Foxconn investing $1.5 billion in Tamil Nadu to supply the U.S. market. India’s share of Apple’s iPhone output grew from 2% to 5% between 2021 and 2022, with goals to hit 25%. Other giants like Dell, Nike, Intel, and Nippon Steel are also shifting production, with over 90% of North American manufacturers surveyed by BCG reporting some relocation from China in the past five years. Yet despite India’s appeal, challenges do remain. India’s infrastructure lags, with only 5% of roads classified as highways, causing logistical bottlenecks. Regulatory red tape hinders operations, with just 55% of companies reporting seamless production shifts. Manufacturing costs in India can also run 5–10% higher than in China due to import duties on components. India faces competition from Vietnam, a leader in electronics, and Mexico, advantaged by its proximity to the U.S. Companies and investors must navigate these hurdles to ensure profitability. This shift opens doors for entrepreneurs and businesses. Investors can target Indian firms or ETFs in booming sectors like electronics and semiconductors, which attracted $16 billion in manufacturing FDI from 2020 to 2023. Content creators can monetize blogs or videos on India’s manufacturing surge through ads or sponsorships. Consulting services offer another path, providing market research or regulatory guidance for firms entering India. Businesses can also develop logistics or compliance solutions to address operational challenges. The pivot from China to India reflects geopolitical, economic, and logistical realities. India’s policies and demographic strengths position it as a rising manufacturing powerhouse, but infrastructure and regulatory hurdles require careful strategy. Opportunities in investment, content creation, and consulting abound for those who can navigate India’s complexities with precision. Investors can explore top Indian companies listed on U.S. exchanges, such as HDFC Bank (NYSE: HDB), Infosys (NYSE: INFY), or MakeMyTrip (NASDAQ: MMYT). For broader exposure, the iShares MSCI India ETF (NASDAQ: INDA) tracks the MSCI India Index, covering roughly 85% of India’s large and mid-cap equity market. The post As China’s Dominance Dims, India Begins to Shine – The Time to Consider Investment Opportunities is Now appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-09 14:03:19",
      "date": "09/06/2025",
      "time": "14:03",
      "category": "crypto",
      "impact": "positive",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/08/as-chinas-dominance-dims-india-begins-to-shine-the-time-to-consider-investment-opportunities-is-now/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.0
    },
    {
      "title": "UK retail sales tumble in June and worse seen for July, CBI says",
      "content": "British retail sales slumped this month and expectations within the industry for July also deteriorated, a Confederation of British Industry survey showed on Thursday.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 06:14:34",
      "date": "26/06/2025",
      "time": "06:14",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.reuters.com/business/retail-consumer/uk-retail-sales-tumble-june-worse-seen-july-cbi-says-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 44.903282828282826
    },
    {
      "title": "Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector",
      "content": "Live Updates Live Coverage Has Ended Apple Pipeline 12:47 pm by Gerelyn Terzo Apple&#8217;s (Nasdaq: AAPL) Worldwide Developers Conference (WWDC) will spotlight announcements from CEO Tim Cook relating to updates to the company&#8217;s operating systems for iPhones, iPads, Macs, etc. Apple is also expected to provide updates on AI software Apple Intelligence, including changes and improvements. The unveiled software and features are expected to be available for legacy hardware in the fall, coinciding with the next iPhone launch. The Nasdaq Composite is now up 0.40%, while Apple stock is gaining 0.35%. Easing Inflation 11:08 am by Gerelyn Terzo Inflation showed signs of easing in May, with the New York Fed Survey of Consumer Expectations index falling to 3.2%—a 0.4 percentage point drop from April levels. This improvement follows progress made by the Trump administration with U.S. trade partners. The Nasdaq Composite is up 0.43%. Wall Street Cautious on MCD 10:02 am by Gerelyn Terzo Morgan Stanley has turned more cautious on fast-food giant McDonald&#8217;s (NYSE: MCD), downgrading shares to an &#8220;equal weight&#8221; rating from &#8220;overweight,&#8221; citing &#8220;structural pressures on fast food.&#8221; The Wall Street firm lowered the price target by $5 to $324 per share. MCD stock is down 2% today. This article will be updated throughout the day, so check back often for more daily updates. Technology stocks are mostly higher today, setting a positive tone for the broader markets. U.S. and Chinese officials are expected to restart trade discussions today in Europe. Big Tech stock Apple (Nasdaq: AAPL) is gearing up for its developer conference, called WWDC, today, featuring a keynote speech from CEO Tim Cook. The markets will be listening for any advancements on AI innovation. The three major stock market averages are higher out of the gate, with the Dow Jones Industrial Average, Nasdaq Composite and S&amp;P 500 all posting gains. All sectors of the economy are higher as sentiment looks up to start the week. The S&amp;P 500 is trading back above the psychologically important 6,000 level, powered in part by chip stocks including Advanced Micro Devices (Nasdaq: AMD), which is tacking on 3.4% today. While tech as a sector is moving higher, one Magnificent 7 stock being left out of the gains is Tesla (Nasdaq: TSLA), which is down 3.9%. Wall Street analysts downgraded the EV stock due to the distraction of tensions between CEO Elon Musk and President Trump. On the economic front, the latest inflation data is expected mid-week when the latest Consumer Price Index and Producer Price Index results for May will be revealed. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 39 (+0.09%) Nasdaq Composite: Up 23.50 (+0.11%) S&amp;P 500: Up 9 (+0.15) Market Movers Meta Platforms (Nasdaq: META) is in discussions to potentially back AI startup Scale AI with a $10 billion-plus investment, according to a Bloomberg report. Archer Aviation (NYSE: ACHR) is gaining 5% today as its piloted flight program gains momentum in the U.S. and UAE markets. Quantum computing stock IonQ (NYSE: IONQ) is gaining 3% after announcing a deal to acquire London’s Oxford Ionics in a billion-dollar transaction. The post Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/09/live-nasdaq-composite-markets-stay-hopeful-in-big-week-for-tech-sector/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 43.151515151515156
    },
    {
      "title": "British carmaker JLR trims FY26 margin forecast to 5%-7% as US tariffs cast shadow",
      "content": "British luxury carmaker Jaguar Land Rover cut its fiscal 2026 earnings before interest and taxes margins forecast to 5%-7% on Monday from 10% earlier, citing uncertainty in the global auto industry as U.S. tariffs loom.",
      "source": "reuters.com",
      "rawDate": "2025-06-15 23:50:50",
      "date": "15/06/2025",
      "time": "23:50",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.reuters.com/world/india/indias-tata-motors-expects-5-7-fy26-ebit-margins-luxury-unit-jlr-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.09318181818182
    },
    {
      "title": "S&P and Nasdaq sit in the red ahead of CPI data and Wall Street opening bell",
      "content": "US stock futures were pointing to a small decline on Wednesday morning, while traders awaited key inflation data ahead of the opening bell. Investors also were digesting the limited progress from US-China trade talks in London.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-11 08:24:08",
      "date": "11/06/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.proactiveinvestors.com/companies/news/1072779",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.433585858585857
    },
    {
      "title": "U.S.-China trade talks will allow deliberate management of bilateral relationship: Dewardric McNeal",
      "content": "Dewardric McNeal, Longview Global managing director, joins 'Squawk Box' to discuss the resumption of U.S.-China trade talks in London, the focus on rate earths, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 08:33:09",
      "date": "09/06/2025",
      "time": "08:33",
      "category": "companies",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=MxSXraYcWxI",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.972222222222221
    },
    {
      "title": "Trade Focus This Week: U.S. and China Talks in London",
      "content": "Kevin Green kicks off the week providing a road map for what investors might and might not expect to happen from this week's trade talks between the U.S. and China. He examines the potential \"good cop, bad cop\" setup with Howard Lutnick and Scott Bessent joining the negotiations.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 08:28:19",
      "date": "09/06/2025",
      "time": "08:28",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=bbKZouqrXbU",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 14.883838383838384
    },
    {
      "title": "Why JP Morgan thinks Apple can regain momentum in coming months",
      "content": "JP Morgan believes Apple stock might get its mojo back in the next few months due to historical data, the upcoming iPhone 17 release, and lukewarm expectations from Apple's conference, which the company can surpass and impress investors.",
      "source": "invezz.com",
      "rawDate": "2025-06-05 13:58:07",
      "date": "05/06/2025",
      "time": "13:58",
      "category": "tech",
      "impact": "positive",
      "country": "uk",
      "url": "https://invezz.com/news/2025/06/05/why-jp-morgan-thinks-apple-can-regain-momentum-in-coming-months/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.567424242424241
    }
  ],
  "germany": [
    {
      "title": "Jim Cramer: ‘Trump Discount’ Is Hurting Markets",
      "content": "Key Points in This Article: CNBC’s Mad Money host Jim Cramer is often criticized for inaccurate stock picks that inspire routine bets against his calls as a better way to beat the market. Due to his unreliable predictions and over-the-top policy complaints, investors would be better served by focusing on company fundamentals. Nvidia made early investors rich, but there is a new class of &#8216;Next Nvidia Stocks&#8217; that could be even better. Click here to learn more. A Controversial Track Record Jim Cramer is a polarizing figure in financial media, known for hosting CNBC’s Mad Money and co-anchoring Squawk on the Street. A Harvard-educated former hedge fund manager, Cramer’s high-energy stock picks and market commentary have made him a household name among retail investors. However, his predictions are frequently criticized for their inconsistency, with many noting he’s often wrong about his stock calls. This reputation led to the creation of the Inverse Cramer ETF, which aimed to profit by betting against his recommendations. Although the ETF shut down due to lack of interest, an X account named “Inverse Cramer” continues to mock his calls, highlighting his spotty track record. Cramer’s bold, sometimes erratic takes &#8212; such a a recent essay he wrote on a so-called “Trump discount” &#8212; often spark debate, with critics pointing to his tendency to overemphasize short-term noise over long-term fundamentals, making his advice a risky bet for investors. Cramer’s “Trump Discount” Thesis In his June 1 article, Jim Cramer argues that a “Trump discount” is suppressing U.S. stock market performance due to the unpredictability of President Trump’s policies. He contrasts Europe’s “consistency of mediocrity” with U.S. volatility, claiming the White House’s immense power creates instability. Cramer cites examples across sectors: Nvidia’s (NASDAQ:NVDA) gains were short-lived due to policy uncertainty; retail stocks like Walmart (NYSE:WMT) face tariff-related confusion; drug companies suffer from shifting Medicare pricing policies and vaccine skepticism; food companies like Campbell’s (NYSE:CPB) face regulatory pressure from RFK Jr.; Apple (NASDAQ:AAPL) struggles with Trump’s push for U.S.-only manufacturing; software and internet giants like Salesforce (NYSE:CRM) and Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) face unexpected scrutiny; banks see no regulatory relief; mergers and acquisitions are stalled by unpredictable cash flows; and energy stocks, despite Trump’s pro-drilling stance, lack momentum due to high costs and regulatory hurdles. Cramer predicts continued market declines, noting a recent 1% S&amp;P 500 drop, exacerbated by mixed signals about U.S.-China trade talks. Flaws in Cramer’s Argument Cramer’s thesis appears flawed for several reasons. First, his “Trump discount” overstates the impact of presidential policies on broad market performance. The S&amp;P 500, far from being discounted, has gained since he wrote his article, and is near record highs, contradicting his bearish outlook. Second, his sector-specific arguments lack depth. Nvidia’s volatility is more tied to market cycles and competition than Trump’s policies. Retailers like Costco (NASDAQ:COST) and TJX (NYSE:TJX) have thrived despite tariff fears, with Costco’s stock rising due to strong fundamentals, not a “Trump premium.” Third, Cramer’s focus on short-term policy noise ignores long-term drivers like corporate earnings and consumer demand. His concerns about drug stocks, which he ties to RFK Jr.’s influence, overstate the impact of unconfirmed regulatory changes, since Medicare negotiation frameworks remain complex and slow-moving. Similarly, his critique of Apple misinterprets global supply chain dynamics; India’s manufacturing shift is a strategic diversification, not a policy misstep. Cramer’s Track Record and Market Misreads Cramer’s historical inaccuracy fuels skepticism. The Inverse Cramer ETF, though defunct, capitalized on his poor track record, and the ongoing X account highlights his frequent misses. His alarmist tone, comparing Trump’s influence to Andrew Jackson’s era, exaggerates political impact while downplaying market resilience. For instance, energy stocks’ stagnation is less about Trump’s policies and more about global oil prices and ESG pressures, which Cramer barely addresses. His claim that Europe’s markets outperform due to “consistency” ignores their own challenges, like Germany’s 2025 economic slowdown. By fixating on sensationalized policy risks, Cramer overlooks broader market trends, such as technology-driven gains and robust consumer spending, which have propelled the S&amp;P 500 upward. Key Takeaways As always, focus on fundamentals, not noise. Investors should tune out sky-is-falling narratives like Cramer’s, which amplify short-term concerns over fundamentals. However, blind optimism about endless market gains is equally misguided. Markets naturally rise and fall, influenced by policies but driven by earnings, innovation, and economic cycles. While presidential actions, like tariffs or deregulation, can create volatility, they don’t dictate long-term outcomes. Investors would do well to focus on business fundamentals &#8212; revenue growth, profit margins, and competitive advantages &#8212; rather than reacting to pundits like Cramer. Consistent, long-term investing, diversified across sectors, remains the most reliable path to wealth creation, regardless of political headlines. The post Jim Cramer: &#8216;Trump Discount&#8217; Is Hurting Markets appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-26 10:02:27",
      "date": "26/06/2025",
      "time": "10:02",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/26/jim-cramer-trump-discount-is-hurting-markets/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 63.42424242424242
    },
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Apple in Crosshairs 2:11 pm by Gerelyn Terzo Apple (Nasdaq: AAPL) stock has a target on its back. Wall Street firm Needham has downgraded shares of the Big Tech stock to &#8220;hold&#8221; from &#8220;buy,&#8221; arguing the stock is hovering at frothy levels. Needham also pulled its $225 price target, noting a $170-$180 range would be an acceptable entry point. Apple shares were largely unchanged today, while the SPY ETF is up 0.26%. Citi Takes Aim at CEG 11:35 am by Gerelyn Terzo Wall Street analyst firm Citi has reduced its rating on Constellation Energy (NYSE: CEG) shares in response to the utility&#8217;s long-term power agreement with Mag 7 stock Meta (Nasdaq: META). Analysts at Citi now classify CEG stock as high-risk, arguing that the company will forgo the opportunity for premium pricing on its nuclear-generated electricity. They have set a price target of $318. CEG shares are falling 3% today after yesterday&#8217;s rock-star performance. The SPY ETF is up 0.16% as of mid-morning trading. S&amp;P Outlook Looking Up 10:05 am by Gerelyn Terzo With the first half of 2025 almost behind us, Wall Street analysts are actively revising their year-end market forecasts. Most recently, Barclays has adjusted its S&amp;P 500 year-end outlook upward by nearly 3% to 6,050, a notable increase from its previous target of 5,900. Beyond Barclays, other prominent analyst firms like Deutsche Bank and RBC have also recently elevated their 2025 S&amp;P 500 targets, signaling a positively shifting consensus for the broader market&#8217;s direction. This article will be updated throughout the day, so check back often for more daily updates. Market optimism is overriding underwhelming labor market data, with all three major stock averages climbing higher as of morning trading. Yesterday, equities staged a turnaround, as the Dow Jones Industrial Average notched its fourth consecutive winning session, while the tech-heavy Nasdaq Composite and S&amp;P 500 also advanced. Today, most economic sectors are in positive territory, with technology leading the charge with a 1.48% gain. The SPDR S&amp;P 500 ETF (SPY) is up 0.11%) Nvidia (Nasdaq: NVDA) has surpassed Microsoft (Nasdaq: MSFT) to reclaim its position as the world&#8217;s most valuable company, now boasting a market capitalization of $3.45 trillion. Traders and investors are betting whether NVDA stock can clinch new highs soon. Private Payrolls Slow, Sparking Rate Cut Calls Private sector hiring lost significant momentum in May, with payrolls expanding by a mere 37,000 jobs. These results not only fell short of April&#8217;s 60,000 gain but also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. Following this weaker-than-expected private sector jobs data, President Trump is increasing pressure on Jerome Powell to lower interest rates, asserting that the Fed chairman should have already taken this action. Discount Retailers Rally, ON Semi Recovers Dollar General (NYSE: DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on the back of a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is also gaining 6% today, buoyed by similarly upbeat guidance. ON Semi (Nasdaq: ON) is climbing 2.7% today, recouping some recently lost ground. This comes after Morgan Stanley analysts recently indicated that much of the negative sentiment is already factored into ON&#8217;s stock price. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/sp-500-nysearca-spy-live-markets-show-resilience-in-face-of-sputtering-economy/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 59.015151515151516
    },
    {
      "title": "Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Sour Apple 2:05 pm by Gerelyn Terzo One Wall Street analyst firm is taking aim at Big Tech stock Apple (Nasdaq: AAPL). Needham analysts believe AAPL shares are too frothy, downgrading shares to &#8220;hold&#8221; from &#8220;buy.&#8221; The analyst firm also withdrew its price target of $225 per share, saying that the $170-$180 range reflects a more reasonable entry point. AAPL shares are relatively flat today. The Nasdaq Composite is holding onto a gain of 0.43%. Citi Downgrades This Nuclear Stock 11:30 am by Gerelyn Terzo Wall Street firm Citi has downgraded shares of Constellation Energy (NYSE: CEG) on the heels of the utility&#8217;s long-term power arrangement with Big Tech company Meta (Nasdaq: META). Citi analysts attached a high-risk label to CEG stock, saying that it will miss out on premium pricing for its nuclear power, with a price target of $318. After yesterday&#8217;s rally, CEG shares are falling 2.8% today. The Nasdaq Composite is up 0.25% as of mid-morning trading. Wall Street Improves Market Outlook 9:51 am by Gerelyn Terzo With the first half of 2025 nearly in the rearview mirror, Wall Street analysts are coming out in droves to revise their year-end forecasts. Most recently, Barclays has updated its S&amp;P 500 year-end outlook by close to 3% to 6,050 compared with a previous target of below 6,000. In addition to Barclays, other analysts firms that have lifted their 2025 S&amp;P 500 targets of late include Deutsche Bank and RBC. This article will be updated throughout the day, so check back often for more daily updates. The markets appear to be shrugging off some lackluster labor market data, with all three of the major stock market averages higher as of early morning trading. Yesterday, the markets managed to turn things around, with the Dow Jones Industrial Average tacking on its fourth-straight winning session while the tech-heavy Nasdaq Composite and S&amp;P 500 also gained ground. Today, most sectors of the economy are higher, led by technology with a 1.48% advance. Nvidia&#8217;s (Nasdaq: NVDA) muscled Microsoft (Nasdaq: MSFT) out of the way to reclaim the top of the most valuable company in the world rankings, with a market capitalization of $3.45 trillion. Traders are debating whether NVDA stock will see new highs in the near future. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 62.83 (+0.22%) Nasdaq Composite: Up 50.28 (+0.26%) S&amp;P 500: Up 14.10 (+0.24%) Economic Headwinds Private sector hiring lost momentum in May, with payrolls expanding by a mere 37,000 jobs. Results fell short of April&#8217;s 60,000 gain and also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. President Trump is increasing pressure on Jerome Powell to lower interest rates following the weaker-than-expected private sector jobs data, saying the Fed chairman should have already taken this action. Market Movers Dollar General (NYSE:DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is gaining 6% on the day on similarly upbeat guidance. ON Semi (Nasdaq: ON) is gaining 2.7% today, recouping some recently lost ground. Morgan Stanley analysts recently said that negativity is already priced into ON stock. The post Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/live-nasdaq-composite-markets-look-to-extend-gains-despite-economic-headwinds/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 56.36363636363637
    },
    {
      "title": "ECB relaxed about euro strength, risk of too low inflation, de Guindos says",
      "content": "Tariffs will weigh on euro zone economic growth and prices for years, but there is little risk of inflation falling too low, and even the euro's surge against the dollar is not a major worry, European Central Bank Vice President Luis de Guindos said.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 01:05:08",
      "date": "16/06/2025",
      "time": "01:05",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ecb-relaxed-about-euro-strength-risk-too-low-inflation-de-guindos-says-2025-06-16/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 54.967171717171716
    },
    {
      "title": "Euro zone inflation falls to cooler-than-expected 1.9% in May, below ECB target",
      "content": "Economists polled by Reuters had been expecting the May reading to come in at 2%, which is the European Central Bank's target.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 05:04:56",
      "date": "03/06/2025",
      "time": "05:04",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/03/euro-zone-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.74393939393939
    },
    {
      "title": "Ireland sells final AIB shares 15 years after banking crisis",
      "content": "The Irish government said on Tuesday that it had sold its remaining shares in AIB Group , one of the country's two dominant lenders it effectively nationalised 15 years ago as part of the euro zone's biggest state rescue.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 02:22:07",
      "date": "17/06/2025",
      "time": "02:22",
      "category": "crypto",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ireland-sells-final-aib-shares-15-years-after-banking-crisis-2025-06-17/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.43207070707071
    },
    {
      "title": "Apple reveals complex system of App Store fees to avoid EU fine of 500 million euro",
      "content": "Apple Thursday made changes to its App Store European policies, saying it believes the new rules will help the company avoid a fine of 500 million euro ($585 million) from the EU for violating the Digital Markets Act. The changes Apple announced are not a complete departure from the company's previous policy that drew the European Commission's attention in the first place.",
      "source": "cnbc.com",
      "rawDate": "2025-06-26 15:00:01",
      "date": "26/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/26/apple-eu-500-million-euro-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 40.55681818181819
    },
    {
      "title": "Polish stocks fall as eurosceptic Nawrocki elected president",
      "content": "Polish equities slipped on Monday after nationalist opposition candidate Karol Nawrocki won the second round of the country's presidential election.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 03:21:38",
      "date": "02/06/2025",
      "time": "03:21",
      "category": "companies",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/polish-stocks-fall-eurosceptic-nawrocki-elected-president-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.229292929292924
    },
    {
      "title": "Danish pension fund lifts ban on investments in European defence stocks",
      "content": "Danish pension fund AkademikerPension has lifted a self-imposed ban on investment in six of Europe's largest arms makers and some smaller groups, it said on Thursday, citing a worsening security situation and the need to boost European defences.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 04:20:50",
      "date": "26/06/2025",
      "time": "04:20",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/sustainability/society-equity/danish-pension-fund-lifts-ban-investments-european-defence-stocks-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.83207070707071
    },
    {
      "title": "European defence stocks tick up on NATO spending pledge",
      "content": "Shares in European defence firms edged up on Thursday after NATO leaders on Wednesday backed the increase in defence spending demanded by U.S. President Donald Trump.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 05:34:37",
      "date": "26/06/2025",
      "time": "05:34",
      "category": "economy",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/business/aerospace-defense/european-defence-stocks-tick-up-nato-spending-pledge-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "defense",
          "consumer"
        ],
        "regions": [
          "europe",
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.12777777777778
    },
    {
      "title": "World's biggest sovereign wealth fund says EU markets need single regulator",
      "content": "The European Union needs a single regulatory framework and to break down fragmentation across its business, tax, debt issuance and securities law systems, according to Norges Bank Investment Management. \"European markets over time have fallen behind in terms of business dynamism and the provision of new investment opportunities to institutional investors,\" NBIM will tell the European Commission in a letter this week.",
      "source": "cnbc.com",
      "rawDate": "2025-06-09 07:39:25",
      "date": "09/06/2025",
      "time": "07:39",
      "category": "markets",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/09/worlds-biggest-sovereign-wealth-fund-eu-markets-need-single-regulator.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 33.43939393939394
    },
    {
      "title": "Apple changes App Store rules in EU to comply with antitrust order",
      "content": "Apple on Thursday changed rules and fees in its App Store in the European Union after the bloc's antitrust regulators ordered it to remove commercial barriers to sending customers outside the store.",
      "source": "reuters.com",
      "rawDate": "2025-06-26 15:13:46",
      "date": "26/06/2025",
      "time": "15:13",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/legal/litigation/apple-changes-app-store-rules-eu-comply-with-antitrust-order-2025-06-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.55
    },
    {
      "title": "Dax Index News: Inflation, PMI, and Fed Outlook to Guide DAX Forecast This Week",
      "content": "DAX steadies as investors weigh ECB rate cut bets, PMI outlook, and renewed US-China trade tensions after Trump's rare earth minerals accusation.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 01:00:12",
      "date": "02/06/2025",
      "time": "01:00",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-inflation-pmi-and-fed-outlook-to-guide-dax-forecast-this-week-1523083",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.296717171717173
    },
    {
      "title": "ECB Shouldn't Rush Into Further Rate Cuts, Bundesbank's Nagel Says",
      "content": "The Bundesbank president said he supports a cautious approach given that inflation in the eurozone has reached its target level.",
      "source": "wsj.com",
      "rawDate": "2025-06-16 03:58:00",
      "date": "16/06/2025",
      "time": "03:58",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.wsj.com/articles/ecb-shouldnt-rush-into-further-rate-cuts-bundesbanks-nagel-says-02ed4d4e",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.355555555555554
    }
  ],
  "china": [
    {
      "title": "Live Nasdaq Composite: Markets Clinch Record Highs on China Tariff Closure",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. UBS Touts Preferred Securities 11:22 am by Gerelyn Terzo UBS senior fixed income strategist Frank Sileo is bullish on preferred securities, which blend features of both stocks and bonds. Sileo wrote: “For long-term investors, preferreds can provide high-quality, diverse, and durable portfolio income.&#8221; According to S&amp;P Global, the majority of preferred securities are issued by banks. The Nasdaq Composite is holding onto gains, up 0.46%. Bearish on Banks 10:07 am by Gerelyn Terzo Wall Street firm Baird is bearish on a couple of banks. The analyst firm warned that recent gains in financial stocks JPMorgan (NYSE: JPM) and Bank of America (NYSE: BAC) might soon be erased, owing to a questionable risk-reward future for both stocks. Baird handed both stocks downgrades, including JPM to an &#8220;underperform&#8221; and BAC to &#8220;neutral&#8221; with price targets of $235 and $52, respectively, attached. The Nasdaq Composite is now up 0.34%. This article will be updated throughout the day, so check back often for more daily updates. The broader markets have crossed over into record territory on Friday even in the face of economic uncertainty. The S&amp;P 500 has pushed beyond the 6,147 level to 6,159 in early trading, a fresh all-time high. In fact, all three of the major stock market averages are advancing, including a 0.34% gain in the tech-heavy Nasdaq Composite and a fractional gain in the Dow Jones Industrial Average. Big Tech stocks are trading mixed, with notable gains in Apple (Nasdaq: AAPL) and Amazon (Nasdaq: AMZN) of 1% and 1.8%, respectively. President Trump has announced an agreement between the U.S. and China on trade. According to Treasury Secretary Scott Bessent, the U.S. tariffs on China are 30% compared with Beijing&#8217;s 10% on the U.S. On the economic data front, the May personal consumption expenditures price index rose by 0.1% last month, resulting in an annual inflation rate of 2.3%. Core inflation, which excludes food and energy costs, increased to 2.7%, higher than the Federal Reserve had anticipated. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 314.99 (+0.73%) Nasdaq Composite: Up 108.50 (+0.56%) S&amp;P 500: Up 33.86 (+0.56%) Market Movers Nike (NYSE: NKE) is tacking on 15.4% today after its quarterly results beat estimates on both the top and bottom lines. Nike expects a tariff impact of a hefty $1 billion in the current fiscal year, but Wall Street is seeing the glass half full. MP Materials (NYSE: MP) is falling 6.3% today on profit taking after a recent rally. Meta Platforms (Nasdaq: META) is up 0.89% today despite some regulatory headwinds originating from the EU. Meta paid its latest quarterly dividend yesterday, bringing Mark Zuckerberg&#8217;s total META dividend tally to a reported $1 billion-plus. The post Live Nasdaq Composite: Markets Clinch Record Highs on China Tariff Closure appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-27 12:37:15",
      "date": "27/06/2025",
      "time": "12:37",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/06/27/live-nasdaq-composite-markets-clinch-record-highs-on-china-tariff-closure/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa",
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 49.24242424242424
    },
    {
      "title": "Apple's iPhone sales capture top spot in Chinese market in May, Counterpoint Research says",
      "content": "Apple's iPhone sales rose to the top spot in China in May, with global sales growing 15% year-on-year during April and May in the tech giant's strongest performance for the two-month period since the COVID-19 pandemic, data from Counterpoint Research showed.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 02:29:18",
      "date": "13/06/2025",
      "time": "02:29",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apples-iphone-sales-capture-top-spot-chinese-market-may-counterpoint-research-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.443939393939395
    },
    {
      "title": "Apple and Alibaba's AI rollout in China delayed by Trump's trade war, FT reports",
      "content": "Apple and Alibaba's rollout of artificial intelligence services in China is being delayed by a Beijing regulator, the Financial Times reported on Wednesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 11:56:07",
      "date": "04/06/2025",
      "time": "11:56",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apple-alibabas-ai-rollout-china-delayed-by-trumps-trade-war-ft-reports-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.35757575757576
    },
    {
      "title": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture",
      "content": "China's tech giant Alibaba has launched new Qwen3 artificial intelligence models for Apple's MLX architecture, Alibaba said in a statement on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 10:36:35",
      "date": "16/06/2025",
      "time": "10:36",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/alibaba-launches-new-qwen3-ai-models-apples-mlx-architecture-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.88358585858586
    },
    {
      "title": "Exclusive: Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
      "content": "Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 23:01:58",
      "date": "12/06/2025",
      "time": "23:01",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/foxconn-sends-97-india-iphone-exports-us-apple-tackles-trumps-tariffs-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.42146464646464
    },
    {
      "title": "China expectedly keeps key lending rates steady after May cut",
      "content": "China expectedly kept its benchmark lending rates unchanged Friday. The People's Bank of China held the 1-year loan prime rate at 3.0% and 5-year LPR at 3.5%.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 21:02:19",
      "date": "19/06/2025",
      "time": "21:02",
      "category": "companies",
      "impact": "negative",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/20/china-june-lpr-unchanged-after-may-cut.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.28737373737374
    },
    {
      "title": "Samsung aims to catch up to Chinese rivals for thin foldable phones as Apple said to enter the fray",
      "content": "Samsung is set to launch its next foldable smarpthone, likely called the Galaxy Fold7, at an event next month. Chinese players in particular Honor and Oppo, have aggressively released foldables that are thinner and lighter than Samsung's offerings.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 07:34:22",
      "date": "19/06/2025",
      "time": "07:34",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/19/samsung-aims-to-catch-up-chinese-rivals-for-thin-foldable-phones.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 31.18888888888889
    },
    {
      "title": "My Dividend Stock Portfolio: New May Dividend Record - 100 Holdings With 15 Buys",
      "content": "Markets remained volatile in May 2025 amid ongoing trade tensions and mixed signals from Washington and Wall Street. While U.S.-China talks quietly resumed, tariffs persisted and business sentiment stayed cautious, contributing to investor uncertainty. May's investments added $111 in annual dividends, keeping me on track with my goal of $100+ monthly income growth and a 7.4% yield on cost.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 08:10:00",
      "date": "25/06/2025",
      "time": "08:10",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://seekingalpha.com/article/4797120-my-dividend-stock-portfolio-new-may-dividend-record-100-holdings-with-15-buys",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.51313131313131
    },
    {
      "title": "Apple has 2 problems: 1 is urgent & 1 is important",
      "content": "Ahead of Apple's (AAPL) 2025 Worldwide Developers Conference kicking off this Monday, June 9, Needham analysts downgraded the iPhone maker from a Buy rating to Hold while removing its price target on the tech stock. Needham & Company senior media and internet analyst Laura Martin — the analyst behind the call — examines several of Apple's biggest problems as it faces pressures in China's consumer market and the team-up between OpenAI and former Apple designer Jony Ive.",
      "source": "youtube.com",
      "rawDate": "2025-06-05 10:12:16",
      "date": "05/06/2025",
      "time": "10:12",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.youtube.com/watch?v=iPGu7u_fn_Y",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.329040404040406
    },
    {
      "title": "The Day Ahead: What Markets Face Today as Powell, PMI Data, and Trade Risks Take Focus",
      "content": "Markets today face pressure as U.S.-China tensions escalate, with key PMI data and Fed commentary set to shape the session's tone.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 04:35:51",
      "date": "02/06/2025",
      "time": "04:35",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.fxempire.com/forecasts/article/the-day-ahead-what-markets-face-today-as-powell-pmi-data-and-trade-risks-take-focus-1523162",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.467171717171716
    }
  ],
  "japan": [
    {
      "title": "AAPL, GOOGL and MSFT Forecast – US Tech Giants Mixed in Premarket Trading",
      "content": "The three stocks in this analysis, Apple, Google (Alphabet), and Microsoft are a bit mixed at the moment, as we look to continue the overall momentum, or lack of in some cases, going forward. However, none of them look particularly threatened.",
      "source": "fxempire.com",
      "rawDate": "2025-06-26 08:24:47",
      "date": "26/06/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.fxempire.com/forecasts/article/aapl-googl-and-msft-forecast-us-tech-giants-mixed-in-premarket-trading-1529190",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 21.88712121212121
    },
    {
      "title": "Apple's potential deal with Perplexity AI seen as strategic AI boost – BofA",
      "content": "Apple Inc (NASDAQ:AAPL, ETR:APC) is reportedly exploring a potential acquisition or partnership with artificial intelligence startup Perplexity AI, in a move that could enhance its AI capabilities and reduce reliance on Alphabet's Google, according to Bank of America analysts. The investment bank, which maintains a \"Buy\" rating on Apple with a $235 price objective, said the iPhone maker stands to benefit significantly from integrating Perplexity's technology into its ecosystem, particularly to improve Siri and enter the search advertising market.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-24 14:17:57",
      "date": "24/06/2025",
      "time": "14:17",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.proactiveinvestors.com/companies/news/1073541",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.806060606060605
    },
    {
      "title": "Why Are Tesla, Apple, and Alphabet Underperforming the \"Magnificent Seven\" and the S&P 500?",
      "content": "The S&P 500 (^GSPC 0.52%) has more than recovered its losses from earlier this year and is now up nearly 4.4% year to date.",
      "source": "fool.com",
      "rawDate": "2025-06-28 06:15:00",
      "date": "28/06/2025",
      "time": "06:15",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://www.fool.com/investing/2025/06/28/tesla-apple-alphabet-stocks-buy-magnificent-seven/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 17.599242424242426
    },
    {
      "title": "Mag 7 check-in: Are the days of tech sector leadership over?",
      "content": "The tech sector, specifically the \"Magnificent Seven,\" made up of Nvidia, Alphabet, Tesla, Microsoft, Amazon, Meta, and Apple, was a significant driver of market gains in 2023 and 2024. However, 2025 has been a different story so far.",
      "source": "youtube.com",
      "rawDate": "2025-06-12 12:31:27",
      "date": "12/06/2025",
      "time": "12:31",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.youtube.com/watch?v=Hujst_g5y7Q",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.468181818181819
    },
    {
      "title": "Why It Makes Sense To Overweight Alphabet Over Apple",
      "content": "I'm rotating part of my Apple position into Alphabet, as Apple's growth has plateaued and its valuation remains high despite AI shortcomings. Alphabet offers superior risk-adjusted returns, driven by AI leadership, expanding search/advertising opportunities, and strong growth in YouTube, Cloud, and Waymo. Google's valuation is attractive, with discounted earnings and free cash flow yields, and its diversified business lines provide significant upside potential.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-03 10:25:57",
      "date": "03/06/2025",
      "time": "10:25",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://seekingalpha.com/article/4791991-why-it-makes-sense-to-overweight-alphabet-over-apple",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.367424242424242
    }
  ],
  "emerging_markets": [
    {
      "title": "Apple gives Tata India iPhone repair business as partnership expands, sources say",
      "content": "Apple has brought in Tata Group to handle repairs for iPhones and MacBook devices in its fast-growing Indian market, signalling the Indian conglomerate's deepening role in the U.S. tech giant's supply chain, two people familiar with the matter said.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 06:34:54",
      "date": "05/06/2025",
      "time": "06:34",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/business/media-telecom/apple-gives-tata-india-iphone-repair-business-partnership-expands-sources-say-2025-06-05/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.646212121212116
    },
    {
      "title": "Russia fines Apple for violating 'LGBT propaganda' law, TASS reports",
      "content": "A Russian court on Tuesday fined U.S. tech giant Apple six million roubles ($76,510) for violating Russian rules on what Moscow calls \"LGBT propaganda,\" the state TASS news agency reported.",
      "source": "reuters.com",
      "rawDate": "2025-06-10 11:25:03",
      "date": "10/06/2025",
      "time": "11:25",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/sustainability/society-equity/russia-fines-apple-violating-lgbt-propaganda-law-tass-reports-2025-06-10/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.58560606060606
    },
    {
      "title": "Turkey Inflation Keeps Falling in Boost to Central Bank",
      "content": "Consumer prices were 35.4% higher on year in May, easing from 37.9% in April, after the central bank lifted its key interest rate in response to recent political turmoil and market jitters.",
      "source": "wsj.com",
      "rawDate": "2025-06-03 03:18:00",
      "date": "03/06/2025",
      "time": "03:18",
      "category": "economy",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/economy/turkey-inflation-keeps-falling-in-boost-to-central-bank-9db96e43",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 24.691666666666666
    },
    {
      "title": "The Bank of Mexico on Thursday lowered its benchmark interest rate by half of a percentage point in a split vote and left the door open for further cuts",
      "content": "The central bank lowered its overnight interest-rate target to 8% in split 4-1 vote.",
      "source": "wsj.com",
      "rawDate": "2025-06-26 17:48:00",
      "date": "26/06/2025",
      "time": "17:48",
      "category": "economy",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/articles/bank-of-mexico-makes-fourth-straight-half-point-interest-rate-cut-9e849d27",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": [
          "latam"
        ]
      },
      "source_type": "general_news",
      "importance_score": 23.233333333333334
    },
    {
      "title": "Senate pushes Russia tariffs that could jack up energy prices for American consumers",
      "content": "Americans may soon feel the pinch at the pump and on their utility bills, even as the Trump administration and congressional Republicans remain laser focused on boosting U.S. energy production.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 16:36:00",
      "date": "04/06/2025",
      "time": "16:36",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.marketwatch.com/story/senate-pushes-russia-tariffs-that-could-jack-up-energy-prices-for-american-consumers-e9870842",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "energy",
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 12.581565656565656
    }
  ],
  "global": [
    {
      "title": "Oil, war and tariffs tear up markets' central bank roadmap",
      "content": "Investor unease about an increasingly uncertain environment is rising, as Norway's shock rate cut on Thursday highlights how U.S. tariffs, Middle East conflict and a shaky dollar make global monetary policy and inflation even harder to predict.",
      "source": "reuters.com",
      "rawDate": "2025-06-19 11:31:22",
      "date": "19/06/2025",
      "time": "11:31",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/oil-war-tariffs-tear-up-markets-central-bank-roadmap-2025-06-19/",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 59.935353535353535
    },
    {
      "title": "The World’s Richest Don’t Have to Be Tech Founders, Look at Steve Ballmer",
      "content": "The sixth richest person in the world is former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer. He has a net worth of $164 billion, below that of his former boss Bill Gates, the founder of Microsoft, at $177 billion. Ballmer left the CEO’s job at Microsoft in 2013. He wisely did not sell most of his shares when he left the company. He owns 4% of the massive tech company, which makes him Microsoft&#8217;s largest private owner. His dividends alone make him $1 billion a year. 24/7 Wall St. Key Points: Former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer is the sixth richest person in the world. Those on the list above him all founded huge tech companies. Take this quiz to see if you’re on track to retire. (sponsored) The people on the list above Ballmer all started huge tech companies. These include Tesla&#8217;s Elon Musk at $368 billion, Meta’s Mark Zuckerberg at $241 billion, Oracle’s Larry Ellison at $234 billion, and Amazon’s Jeff Bezos at $233 billion. Ballmer joined Microsoft in 1980 and became chief executive in 2000. During his 14-year tenure, Microsoft’s revenue tripled. As Ballmer left, Eric Jackson at the hedge fund Ironfire Capital told Reuters, “I don’t see anybody else on the management team at Microsoft that I think would be much better than Ballmer.” However, he received criticism for not launching popular products like the rival Steve Jobs did at Apple. Ballmer kept 333 million shares despite leaving, about triple the number Gates has kept. Ballmer has become a major philanthropist. While not as visible as Gates and the Bill &amp; Melinda Gates Foundation, according to Forbes, “He has ramped up his philanthropy since 2014; to date the Ballmers have given away more than $4 billion.” Microsoft Stock Price Prediction and Forecast 2025-2030 The post The World&#8217;s Richest Don&#8217;t Have to Be Tech Founders, Look at Steve Ballmer appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://247wallst.com/investing/2025/06/16/the-worlds-richest-dont-have-to-be-tech-founders-look-at-steve-ballmer/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 50.031565656565654
    },
    {
      "title": "Dollar question hovers over top central bankers meeting in Sintra",
      "content": "A million-dollar question will hang over the world's top central bankers when they meet in Sintra, Portugal, next week: Is the monetary system centred on the U.S. currency beginning to unravel?",
      "source": "reuters.com",
      "rawDate": "2025-06-27 07:12:30",
      "date": "27/06/2025",
      "time": "07:12",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/dollar-question-hovers-over-top-central-bankers-meeting-sintra-2025-06-27/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.50580808080808
    },
    {
      "title": "Apple and Samsung smartphone growth to take hit from tariff uncertainty: Counterpoint Research",
      "content": "Counterpoint Research research outfit said it had revised down its overall 2025 global smartphone shipment growth forecast to 1.9% year-on-year from 4.2%, citing \"renewed uncertainties surrounding U.S. tariffs.\" Apple shipments are expected to grow 2.5% year-on-year in 2025, while Samsung shipments are expected to be flat.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 07:35:12",
      "date": "04/06/2025",
      "time": "07:35",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/04/apple-samsung-smartphone-growth-cut-due-to-tariffs-analysts.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.24848484848485
    },
    {
      "title": "HEDGE FLOW Hedge funds buy stocks at quickest pace since Nov 2024, Goldman Sachs says",
      "content": "Hedge funds bought global equities last week at the quickest pace since November 2024, Goldman Sachs said in a note, just as stock markets ended the month with their most positive May performance in decades.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:54:07",
      "date": "02/06/2025",
      "time": "06:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-funds-buy-stocks-quickest-pace-since-nov-2024-goldman-sachs-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.150757575757574
    },
    {
      "title": "Morning Bid: Dollar slides on trade and tax fears",
      "content": "A look at what matters in U.S. and global markets today from Mike Dolan, Editor-At-Large, Finance and Markets",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:39:47",
      "date": "02/06/2025",
      "time": "06:39",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.28762626262626
    },
    {
      "title": "TRADING DAY Whirlwind fades, calm returns",
      "content": "After two days of strong gains in world stocks amid the widespread relief over cooling Middle East tensions, relative stability was the hallmark of trading on Wednesday, with major asset classes moving in much narrower ranges.",
      "source": "reuters.com",
      "rawDate": "2025-06-25 17:04:08",
      "date": "25/06/2025",
      "time": "17:04",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/aerospace-defense/global-markets-trading-day-graphic-pix-2025-06-25/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.870202020202015
    },
    {
      "title": "U.S. growth forecast cut sharply by OECD as Trump tariffs sour global outlook",
      "content": "The Organisation for Economic Co-operation and Development on Tuesday downgraded its growth forecasts for both the U.S. and global economy. The U.S. growth outlook was revised to just 1.6% this year and 1.5% in 2026.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 03:00:04",
      "date": "03/06/2025",
      "time": "03:00",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/us-growth-forecast-cut-further-by-oecd-as-trump-tariffs-sour-outlook.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.93333333333334
    },
    {
      "title": "Jim Cramer says Trump is making it hard for the market to value stocks accurately",
      "content": "CNBC's Jim Cramer said President Donald Trump's actions bring out short sellers and lead investors to make misguided market moves. \"When you examine the market's mistakes, they share a common theme: the president's distorting pretty much everything, especially with his tariffs and his jingoistic approach to the rest of the world, and it's continually confounding traders and investors alike,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 18:59:31",
      "date": "03/06/2025",
      "time": "18:59",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/jim-cramer-trump-market-stocks-correctly-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.073989898989897
    },
    {
      "title": "Why global markets are brushing off U.S. strikes on Iran",
      "content": "Market reactions after the U.S. strikes have been less aggressive, especially relative to just over a week ago when Israel launched airstrikes against Iran. \"The markets view the attack on Iran as a relief with the nuclear threat now gone for the region,\" said Dan Ives, managing director at Wedbush.",
      "source": "cnbc.com",
      "rawDate": "2025-06-23 01:10:32",
      "date": "23/06/2025",
      "time": "01:10",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/23/why-global-markets-are-brushing-off-us-strikes-on-iran.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 29.530303030303028
    },
    {
      "title": "Rosen Law Firm Urges Apple Inc. (NASDAQ: AAPL) Stockholders with Large Losses to Contact the Firm for Information About Their Rights",
      "content": "NEW YORK--(BUSINESS WIRE)--Rosen Law Firm, a global investor rights law firm, announces that a shareholder filed a class action lawsuit on behalf of purchasers and acquirers of Apple Inc. (NASDAQ: AAPL) securities between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). Apple is a technology company. For more information, submit a form, email attorney Phillip Kim, or give us a call at 866-767-3653. The Allegations: Rosen Law Firm is Investigating the Allegations that A.",
      "source": "businesswire.com",
      "rawDate": "2025-06-24 15:00:00",
      "date": "24/06/2025",
      "time": "15:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.businesswire.com/news/home/20250624333844/en/Rosen-Law-Firm-Urges-Apple-Inc.-NASDAQ-AAPL-Stockholders-with-Large-Losses-to-Contact-the-Firm-for-Information-About-Their-Rights/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 28.38888888888889
    },
    {
      "title": "Prediction: 2 Stocks That'll Be Worth More Than Apple 5 Years From Now",
      "content": "With a market capitalization of just a tad under $3 billion, Apple (AAPL -1.43%) is one of the largest companies in the world. However, its revenue growth over the past few years has been modest, while much of its stock gains have come from multiple expansions, as its price-to-earnings (P/E) ratio has been increasing.",
      "source": "fool.com",
      "rawDate": "2025-06-18 03:45:00",
      "date": "18/06/2025",
      "time": "03:45",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/18/prediction-stocks-worth-more-than-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 24.00732323232323
    },
    {
      "title": "Not expecting the Fed to cut rates this year, says Morgan Stanley's Andrew Sheets",
      "content": "Andrew Sheets, Morgan Stanley global head of corporate credit research, joins 'Squawk Box' to discuss the latest market trends, state of the economy, what to expect from inflation data this week, the Fed's rate path outlook, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 07:05:38",
      "date": "09/06/2025",
      "time": "07:05",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=PhYDKm7tBhU",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 23.104545454545455
    },
    {
      "title": "Apple: Quiet After WWDC",
      "content": "Apple is lagging on its AI strategy, and funds are most likely rotating capital elsewhere in the Mag 7 group. Momentum is clearly not on Apple's side post WWDC 2025. That said, I'm projecting upside for Q2 earnings after a strong 15% jump in global iPhone sales during April and May. I'm also keeping a close eye on the upcoming iPhone 17 launch. If it beats expectations, I believe sentiment will improve quickly and the share price will reflect it.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-18 15:03:15",
      "date": "18/06/2025",
      "time": "15:03",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795775-apple-quiet-after-wwdc",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.946969696969695
    },
    {
      "title": "Trump Says He'll Choose a Fed Chair Who Wants to Cut Rates",
      "content": "President Donald Trump calls Federal Reserve Chair Jerome Powell a \"stubborn mule\" and says he would choose a successor who wants to cut interest rates during remarks with reporters at the Oval Office. Sign up for the Washington Edition newsletter to find out how the worlds of money and politics intersect in the US capital: https://bloom.bg/3KkEimO -------- More on Bloomberg Television and Markets Like this video?",
      "source": "youtube.com",
      "rawDate": "2025-06-27 18:17:53",
      "date": "27/06/2025",
      "time": "18:17",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=60bYNDPG0Ro",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.915909090909093
    },
    {
      "title": "War Interrupts Irrational Exuberance And There's More Bad News Coming",
      "content": "The Iran and Israel conflict is threatening to expand and cause an energy shock that is inflationary and can disrupt global credit. President Trump's tariff wildcard could further disrupt supply chains and add to a potential \"mini-stagflation\" scenario.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-16 05:28:42",
      "date": "16/06/2025",
      "time": "05:28",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795086-war-interrupts-irrational-exuberance-more-bad-news-coming",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.79368686868687
    },
    {
      "title": "Rick Rieder: Fed's window to cut is there in July but they won't",
      "content": "Rick Rieder, BlackRock global fixed income CIO, joins 'Closing Bell' to discuss the recent action in equity markets, where the interest rates are most effective and much more.",
      "source": "youtube.com",
      "rawDate": "2025-06-26 16:21:28",
      "date": "26/06/2025",
      "time": "16:21",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=fgzhXoBPlt4",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.425505050505052
    },
    {
      "title": "Stock Market This Week: AAPL WWDC 2025, META Scale AI Investment, ORCL Rallies",
      "content": "Markets closed in the red after geopolitical tensions between Iran and Israel swelled on Friday. Apple (AAPL) struggled in the Mag 7 after its Worldwide Developers Conference largely disappointed investors.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 17:00:29",
      "date": "13/06/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Txu28F-sL0M",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.435858585858586
    },
    {
      "title": "Trump Toys with idea of replacing Fed Chair Powell Early",
      "content": "Michael McKee, International Economics & Policy Correspondent for Bloomberg News, discusses pressure on the Fed from President Trump and potential candidates for Fed Chair after Jay Powell's term. The dollar fell and US Treasuries rallied after a report that President Donald Trump is considering naming Federal Reserve Chair Jerome Powell's successor well before the incumbent's term is scheduled to end next May.",
      "source": "youtube.com",
      "rawDate": "2025-06-26 15:50:35",
      "date": "26/06/2025",
      "time": "15:50",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=f_r3Sz8K6Kg",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.346969696969698
    },
    {
      "title": "The Biggest Bully in Town: The Bond Market!",
      "content": "A warning sign we have been observing at 3EDGE is the rise in global long bond yields – the interest rates investors demand to buy bonds with a maturity of 20 years or more. In this video, Fritz Folts, 3EDGE Chief Investment Strategist, and Steve Cucchiaro, CEO/CIO, discuss: The sharp increase in U.S.",
      "source": "etftrends.com",
      "rawDate": "2025-06-17 18:32:30",
      "date": "17/06/2025",
      "time": "18:32",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.etftrends.com/etf-strategist-channel/biggest-bully-town-bond-market/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.141919191919193
    },
    {
      "title": "Apple says its App Store helped generate $1.3T in billings and sales, most without a commission",
      "content": "Ahead of its Worldwide Developer Conference on June 9, Apple on Thursday offered a new update on its global App Store business, sharing that developers generated $1.3 trillion in billings and sales in 2024. The company stressed that 90% of those billings and sales did not involve paying Apple a commission.",
      "source": "techcrunch.com",
      "rawDate": "2025-06-05 09:52:41",
      "date": "05/06/2025",
      "time": "09:52",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://techcrunch.com/2025/06/05/apple-says-its-app-store-helped-generate-1-3t-in-billings-and-sales-most-without-a-commission/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.231565656565657
    },
    {
      "title": "Prediction: This Unstoppable Stock Will Be the World's First $5 Trillion Company. (Hint: It's Not Apple.",
      "content": "While Apple historically wins the race to various valuation milestones, I think a different company will beat it to the punch to the $5 trillion level, and no, it isn't Microsoft either. I believe that Nvidia (NVDA 0.51%) will win this race, and thanks to its unwavering growth, it will leave both of these two in the dust in the march toward $5 trillion.",
      "source": "fool.com",
      "rawDate": "2025-06-05 06:15:00",
      "date": "05/06/2025",
      "time": "06:15",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/05/prediction-this-unstoppable-stock-will-be-the-worl/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 17.98611111111111
    },
    {
      "title": "Energy Intelligence: Conflict escalation could pressure global energy markets",
      "content": "Alex Schindelar, President of Energy Intelligence, discusses what to watch out for in the midst of Israel-Iran conflict, and he says the closure of the Straits of Hormuz would be the biggest disruption to the world.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 03:16:42",
      "date": "16/06/2025",
      "time": "03:16",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Dgc8sUL3Vb0",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.930555555555557
    },
    {
      "title": "Warren Buffett's AI Bets: 22% of Berkshire Hathaway's $282 Billion Stock Portfolio Is in These 2 Artificial Intelligence Stocks",
      "content": "At the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway's CEO. Buffett has built an incredible track record of success since taking over the business in 1965 and using it as the foundation for an investment conglomerate that would go on to become one of the world's largest and most successful companies.",
      "source": "fool.com",
      "rawDate": "2025-06-08 07:30:00",
      "date": "08/06/2025",
      "time": "07:30",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/08/warren-buffetts-ai-bets-22-of-berkshire-hathaways/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.922222222222224
    },
    {
      "title": "How To Build A $1,000,000 Dividend Portfolio That Could Yield 11%+ In 15 Years",
      "content": "The Dividend Income Accelerator Portfolio balances income, growth, and capital appreciation, now enhanced by the global diversification from Allianz and LVMH. We focus on financially healthy companies with sustainable dividends and strong competitive advantages, optimizing risk-reward through sector and geographic diversification. The portfolio's Weighted Average Dividend Yield [FWD] of 4.05% and 5-Year Weighted Average Dividend Growth Rate [CAGR] of 7.06% project a Yield on Cost above 11% in 15 years.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-24 11:00:00",
      "date": "24/06/2025",
      "time": "11:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4796732-building-global-1000000-dividend-portfolio-to-yield-11-percent-15-years",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.7719696969697
    },
    {
      "title": "Asia credit remains resilient with limited direct exposure to tariffs: JP Morgan",
      "content": "Soo Chong Lim of JP Morgan joins Squawk Box Asia to discuss the recovery in Asia's credit market amid the global trade war, the outlook for U.S. Treasuries, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-02 00:36:01",
      "date": "02/06/2025",
      "time": "00:36",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=HsiImww_Tt0",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.385353535353534
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Will Be Worth More Than Apple By the End of 2025",
      "content": "So far, Apple's (AAPL 0.83%) efforts in artificial intelligence (AI) have underwhelmed investors, and it's fair to say that no one thinks it's taking the world by storm with this particular technology. Its Apple Intelligence initiatives are not getting nearly the buzz that competitors' products are receiving, and it seems that its other AI-related products (advanced AI chips, for example) are still in development or getting little fanfare.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:20:00",
      "date": "04/06/2025",
      "time": "04:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/04/predict-artificial-intelligence-ai-stock-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 16.730555555555554
    },
    {
      "title": "ROSEN, A GLOBAL AND LEADING LAW FIRM, Encourages Apple Inc. Investors to Secure Counsel Before Important Deadline in Securities Class Action – AAPL",
      "content": "NEW YORK, June 25, 2025 (GLOBE NEWSWIRE) -- WHY: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”). A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than August 19, 2025.",
      "source": "globenewswire.com",
      "rawDate": "2025-06-25 17:18:00",
      "date": "25/06/2025",
      "time": "17:18",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.globenewswire.com/news-release/2025/06/25/3105483/673/en/ROSEN-A-GLOBAL-AND-LEADING-LAW-FIRM-Encourages-Apple-Inc-Investors-to-Secure-Counsel-Before-Important-Deadline-in-Securities-Class-Action-AAPL.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 16.21666666666667
    },
    {
      "title": "Unpacked 2025: Samsung's AI Ecosystem Is Coming For Apple, Google, And Other Rivals",
      "content": "Samsung's July 9 Unpacked event is more than a product launch—it's a strategic statement about AI and ecosystem leadership. Samsung is uniquely positioned, building not just devices but also the critical chips and infrastructure powering global tech, with strong financials and a fortress balance sheet. The company is aggressively integrating AI across all product categories, outpacing Apple and Google in ecosystem cohesion and innovation.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-25 10:54:11",
      "date": "25/06/2025",
      "time": "10:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4797199-unpacked-2025-samsung-ai-ecosystem-coming-for-apple-google-other-rivals",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.742929292929293
    },
    {
      "title": "Tech could be a safe haven amid geopolitical uncertainty, say ETF experts",
      "content": "Dan Ives, Wedbush Securities global head of technology research, and Todd Rosenbluth, VettaFi director of research, join CNBC's Dom Chu on ETF Edge to debate where the tech trade goes amid the geopolitical uncertainty and if there are areas of the market sheltered from the changing situation.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 17:58:51",
      "date": "16/06/2025",
      "time": "17:58",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=voUD_HKtggU",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.5260101010101
    },
    {
      "title": "AAPL Investors Have Opportunity to Lead Apple Inc. Securities Fraud Lawsuit",
      "content": "NEW YORK , June 24, 2025 /PRNewswire/ -- Why: Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of securities of Apple Inc. (NASDAQ: AAPL) between June 10, 2024 and June 9, 2025, both dates inclusive (the \"Class Period\"). A class action lawsuit has already been filed.",
      "source": "prnewswire.com",
      "rawDate": "2025-06-24 18:15:00",
      "date": "24/06/2025",
      "time": "18:15",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.prnewswire.com/news-releases/aapl-investors-have-opportunity-to-lead-apple-inc-securities-fraud-lawsuit-302490142.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.217171717171718
    },
    {
      "title": "\"Long-Term\" Normal: Takeaways from Grocery Inflation Survey",
      "content": "Duncan Angove (@BlueYonderAI) breaks down the takeaways from Blue Yonder's 2025 Global Consumer Sentiment on Grocery Inflation survey. He notes that consumers are pulling back “entirely” from some categories and says that they are very deal-driven.",
      "source": "youtube.com",
      "rawDate": "2025-06-24 17:30:03",
      "date": "24/06/2025",
      "time": "17:30",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=6Vn0cpq1Cv0",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.976767676767675
    },
    {
      "title": "The Great Rotation out of the U.S. toward other markets is still in motion, says strategist",
      "content": "Currencies and earnings momentum favour international markets",
      "source": "marketwatch.com",
      "rawDate": "2025-06-27 05:30:00",
      "date": "27/06/2025",
      "time": "05:30",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://www.marketwatch.com/story/the-great-rotation-out-of-the-u-s-toward-other-markets-is-still-in-motion-says-strategist-63dc4434",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.927020202020202
    },
    {
      "title": "Is It Time to Buy 2 of the Worst-Performing Dow Jones Stocks This Year?",
      "content": "The Dow Jones Industrial Average tracks the performance of 30 blue chip stocks. These are some of the world's strongest companies.",
      "source": "fool.com",
      "rawDate": "2025-06-24 09:45:00",
      "date": "24/06/2025",
      "time": "09:45",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/24/time-to-buy-2-of-the-worst-performing-dow-jones/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 14.512626262626263
    },
    {
      "title": "Tariffs And Free Trade By Wade",
      "content": "Tariffs and trade have dominated the media headlines since the beginning of the year, creating a volatile rollercoaster ride in the financial markets and the broader economy. Just this week, a federal court ruled that the president's tariff policies were illegal, citing misuse of emergency powers under the International Emergency Economic Powers Act of 1977.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-03 03:15:00",
      "date": "03/06/2025",
      "time": "03:15",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4791874-tariffs-free-trade-by-wade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.409090909090908
    },
    {
      "title": "How To Earn $500 A Month From Apple Stock",
      "content": "Apple Inc. AAPL shares closed lower on Wednesday as investors continued to digest announcements from this week's Worldwide Developers Conference.",
      "source": "benzinga.com",
      "rawDate": "2025-06-12 08:20:03",
      "date": "12/06/2025",
      "time": "08:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.benzinga.com/trading-ideas/dividends/25/06/45902340/how-to-earn-500-a-month-from-apple-stock-7",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.14520202020202
    }
  ],
  "events": [
    {
      "title": "Fed Goolsbee Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Dallas Fed Manufacturing Index (Jun)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Jul/02)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bostic Speech",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "ISM Non-Manufacturing Prices (Jun)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Unemployment Rate (Jun)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Continuing Jobless Claims (Jun/21)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "U-6 Unemployment Rate (Jun)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Jobless Claims 4-Week Average (Jun/28)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Non Farm Payrolls (Jun)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Nonfarm Payrolls Private (Jun)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Initial Jobless Claims (Jun/28)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "ADP Employment Change (Jun)",
      "date": "02/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q3)",
      "date": "01/07/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Hit Co Ltd (378A.T)",
      "date": "03/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Vendome Acquisition Corporation I Unit (VNMEU)",
      "date": "02/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": 230000000,
      "status": "Expected"
    },
    {
      "title": "IPO: CapsoVision, Inc (CV)",
      "date": "01/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "5.00 - 5.50",
      "marketCap": 28900000,
      "status": "Priced"
    },
    {
      "title": "IPO: ETF Opportunities Trust (HECA)",
      "date": "01/07/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Scage Future American Depositary Shares (SCAG)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Spinnaker ETF Series (ODHY)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: First Trust Exchange-Traded Fund VIII (FBDC)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Globe Civil Projects Ltd (GLOV.BO)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "BSE",
      "priceRange": "67.00 - 71.00",
      "marketCap": 1200000000,
      "status": "Priced"
    },
    {
      "title": "IPO: EGH Acquisition Corp. Rights (EGHAR)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Scage Future Warrants (SCAGW)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: EGH Acquisition Corp. Class A Ordinary Shares (EGHA)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: J.P. Morgan Exchange-Traded Fund Trust (JMTG)",
      "date": "30/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Rent Corp (372A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Lipps Co Ltd (373A.T)",
      "date": "29/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "M&A: DICK'S SPORTING GOODS, INC. acquires Foot Locker, Inc.",
      "date": "23/06/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1089063/000114036125023387/ny20050218x1_s4.htm",
      "symbol": "DKS",
      "targetedSymbol": "FL"
    },
    {
      "title": "M&A: MetroCity Bankshares, Inc. acquires First IC Corporation",
      "date": "23/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1747068/000110465925052461/tm2515540-2_s4.htm",
      "symbol": "MCBS",
      "targetedSymbol": "FIEB"
    },
    {
      "title": "M&A: RadNet, Inc. acquires iCAD, Inc.",
      "date": "06/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790526/000168316825003180/radnet_s4.htm",
      "symbol": "RDNT",
      "targetedSymbol": "ICAD"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Mr. Cooper Group Inc.",
      "date": "29/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925041422/tm2513302-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "COOP"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKPF",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKKQ",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNK",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "21/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925036921/alms-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO-PA",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APOS",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Redfin Corporation",
      "date": "07/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925032694/tm2511408-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "RDFN"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: FLYEXCLUSIVE INC. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZW",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZ",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    }
  ]
}