{
  "lastUpdated": "2025-06-21T04:21:13.229873",
  "us": [
    {
      "title": "Apple supplier Jabil raises annual forecast as data center appetite remains strong",
      "content": "Electronics component maker Jabil raised full-year profit and revenue forecast on Tuesday, betting on strong infrastructure services demand for data centers.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 08:54:03",
      "date": "17/06/2025",
      "time": "08:54",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/technology/apple-supplier-jabil-raises-annual-forecast-data-center-appetite-remains-strong-2025-06-17/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 50.920959595959594
    },
    {
      "title": "Effort to strip Fed of interest paying power seen likely to bring upheaval to markets",
      "content": "A Republican senator's plan to take away the Federal Reserve's power to pay banks interest on cash they park on central bank books could cause chaos for monetary policy implementation if it were implemented, market participants said.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 17:15:25",
      "date": "12/06/2025",
      "time": "17:15",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/effort-strip-fed-interest-paying-power-seen-likely-bring-upheaval-markets-2025-06-12/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 50.722979797979804
    },
    {
      "title": "Swiss inflation turns negative for first time since COVID pandemic",
      "content": "Swiss inflation turned negative in May, marking the first decline in consumer prices for more than four years and adding pressure on the Swiss National Bank to cut its interest rate steeply later this month.",
      "source": "reuters.com",
      "rawDate": "2025-06-03 03:13:43",
      "date": "03/06/2025",
      "time": "03:13",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/retail-consumer/swiss-inflation-turns-negative-first-time-since-covid-pandemic-2025-06-03/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 50.075
    },
    {
      "title": "Fed 'Beige Book' economic report cites declining growth, rising prices and slow hiring",
      "content": "The U.S. economy contracted over the past six weeks as hiring slowed and consumers and businesses worried about tariff-related price increases, the Fed reported. On inflation, the report described prices as rising \"at a moderate pace and \" widespread reports of contacts expecting costs and prices to rise at a faster rate going forward.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 14:36:39",
      "date": "04/06/2025",
      "time": "14:36",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/fed-beige-book-economic-report-cites-declining-growth-rising-prices-and-slow-hiring.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession",
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 48.04217171717172
    },
    {
      "title": "Australia retail sales dip 0.1% in April, miss forecasts",
      "content": "Australian retail sales dipped unexpectedly in April as warm weather hit spending on winter clothing, while department stores suffered from a dearth of discounting events in further evidence of a subdued consumer.",
      "source": "reuters.com",
      "rawDate": "2025-05-29 21:44:28",
      "date": "29/05/2025",
      "time": "21:44",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/retail-consumer/australia-retail-sales-dip-01-april-miss-forecasts-2025-05-30/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "consumer"
        ],
        "regions": [
          "australia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.288636363636364
    },
    {
      "title": "U.S. Treasury yields slide after retail sales tumbled in May, raising recession fears",
      "content": "U.S. Treasury yields fell after retail sales fell more than Wall Street expected last month, pushing up fixed income prices and lifting concern over a slowdown.",
      "source": "cnbc.com",
      "rawDate": "2025-06-17 17:30:25",
      "date": "17/06/2025",
      "time": "17:30",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/17/us-treasury-yields-trump-hints-israel-iran-conflict-escalation.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession"
        ],
        "sectors": [
          "technology",
          "finance",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 45.52020202020202
    },
    {
      "title": "Wall Street, Main Street push for foreign tax rethink in US budget bill",
      "content": "Industry groups representing sectors including real estate, finance and multinational companies are pushing for the reduction or exclusion of a retaliatory tax targeting foreign investors in the U.S. in the Republican tax bill, as they see it as a threat to their businesses and to the broader markets and economy.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:29:38",
      "date": "09/06/2025",
      "time": "06:29",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/wall-street-main-street-push-foreign-tax-rethink-us-budget-bill-2025-06-09/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "crypto"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 43.02373737373737
    },
    {
      "title": "Trump rips into 'too late' Jerome Powell after Fed holds rates steady",
      "content": "President Donald Trump criticized Federal Reserve Chair Jerome Powell after the central bank kept rates steady for a fourth time. Trump called Powell a \"real dummy\" in a late night Truth Social post.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 11:04:14",
      "date": "19/06/2025",
      "time": "11:04",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/19/trump-powell-fed-interest-rates.html",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.64368686868687
    },
    {
      "title": "Apple executives held internal talks about buying Perplexity, Bloomberg News reports",
      "content": "Apple executives have held internal talks about potentially bidding for artificial intelligence startup Perplexity, Bloomberg News reported on Friday, citing people with knowledge of the matter.",
      "source": "reuters.com",
      "rawDate": "2025-06-20 17:31:55",
      "date": "20/06/2025",
      "time": "17:31",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-executives-held-internal-talks-about-buying-perplexity-bloomberg-news-2025-06-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.58434343434344
    },
    {
      "title": "Trump says he may have to change his mind about firing Fed chair Powell",
      "content": "U.S. President Donald Trump said on Friday he may have to change his mind about firing Federal Reserve Chairman Jerome Powell.",
      "source": "reuters.com",
      "rawDate": "2025-06-20 18:11:03",
      "date": "20/06/2025",
      "time": "18:11",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/trump-says-he-may-have-change-his-mind-about-firing-fed-chair-powell-2025-06-20/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.50151515151515
    },
    {
      "title": "WWDC: Apple faces AI, regulatory challenges as it woos software developers",
      "content": "Apple is facing an unprecedented set of technical and regulatory challenges as some of its key executives are set to take the stage on Monday at the company's annual software developer conference.",
      "source": "reuters.com",
      "rawDate": "2025-06-09 06:06:09",
      "date": "09/06/2025",
      "time": "06:06",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/wwdc-apple-faces-ai-regulatory-challenges-it-woos-software-developers-2025-06-09/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.28686868686869
    },
    {
      "title": "These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines",
      "content": "Key Points A &#8220;more is better&#8221; approach can help you diversify your portfolio while generating passive income. Five fascinating funds will tempt income seekers with potent yields and strong growth prospects. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Stock picking is fine, but exchange traded funds (ETFs) can enable immediate diversification without sacrificing growth and income opportunities. By selecting multiple funds instead of just one, you can achieve an extra measure of safety while also turning your portfolio into a veritable income-generating machine. The idea is to pick out ETFs with notable distribution yields (i.e., annualized cash payment percentages), but also to focus on a wide variety of funds with share-price growth potential. Now, let&#8217;s drill down on five fabulous ETFs so you can start accumulating shares for your income-machine portfolio today. NEOS NASDAQ-100 High Income ETF (QQQI) The name of the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) might lead you to assume that this fund only offers a hefty yield. There&#8217;s more to the story, though, as the QQQI ETF also enables investors to participate in strong technology-focused growth opportunities. Based on the NASDAQ 100 stock index with approximately 100 holdings, the NEOS NASDAQ-100 High Income ETF includes many large-cap tech names you&#8217;ll surely recognize. Some examples are NVIDIA (NASDAQ:NVDA), Apple (NASDAQ:AAPL), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Broadcom (NASDAQ:AVGO). There&#8217;s no denying that technology giants like Apple and NVIDIA are robust revenue generators. Consequently, the NEOS NASDAQ-100 High Income ETF share price could grow substantially over the long term. At the same time, many investors flock to the QQQI ETF for its eye-catching 13.92% distribution yield. Granted, the fund subtracts an annualized management fee (also known as the expense ratio) of 0.68% from the share price. Still, even after the expense ratio is taken out, investors can look forward to outstanding annual income with the QQQI ETF. Along with that, you&#8217;ll get to participate in the growth prospects of terrific tech titans when you hold the NEOS NASDAQ-100 High Income ETF. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) There&#8217;s another passive income machine that&#8217;s similar to QQQI, but it&#8217;s not identical. Brought to you by famous financier JPMorgan Chase (NYSE:JPM), the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) squeezes extra income from a range of high-confidence technology leaders. Much like the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100 and includes around 100 stocks (108, to be exact). From Microsoft to Apple, Amazon, and many more, you&#8217;ll find plenty of high-growth tech names in JEPQ. There&#8217;s a trade-off with the JPMorgan Nasdaq Equity Premium Income ETF when compared to the NEOS NASDAQ-100 High Income ETF. On the negative side, JEPQ has a rolling 12-month dividend yield of 11.01%, which isn’t as impressive as QQQI&#8217;s 13.92% distribution yield. On the positive side, however, the JPMorgan Nasdaq Equity Premium Income ETF has an annualized expense ratio of 0.35%. This is lower than the NEOS NASDAQ-100 High Income ETF&#8217;s 0.68% annual management fee. Perhaps most importantly, you&#8217;ll have the reassurance that comes with well-established fund management by JPMorgan Chase. Thus, for an interesting alternative to the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF is absolutely worth considering. Schwab U.S. Dividend Equity ETF (SCHD) Maybe you&#8217;re seeking a passive income machine that&#8217;s not as technology-heavy as QQQI and JEPQ. In that case, you&#8217;ll want to check out the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This fund includes has 103 stocks in its portfolio, but SCHD doesn&#8217;t track the NASDAQ 100 index. Instead, the Schwab U.S. Dividend Equity ETF tracks the Dow Jones U.S. Dividend 100 Index. Take a look at the fund’s top 10 holdings and you’ll find some technology firms, such as Cisco Systems (NASDAQ:CSCO) and Texas Instruments (NASDAQ:TXN). Yet, you&#8217;ll also see names from other sectors, including Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), Lockheed Martin (NYSE:LMT), and Conoco Phillips (NYSE:COP). Moreover, the Schwab U.S. Dividend Equity ETF offers a trailing 12-month distribution yield of 3.72% with an annual expense ratio of just 0.06%. The ultra-low management fees allow investors to grow their accounts steadily with the SCHD ETF. Two More Picks for Low Volatility To cap off this list of passive income machine picks, I&#8217;ve got two relatively low-risk funds to show you. First, there&#8217;s an ETF that concentrates on dividend-growing businesses instead of gigantic yield. The Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO) features a 4.81% annual distribution rate but also a 0.56% expense ratio, so the income opportunities are good but not jaw-dropping. On the other hand, DIVO tends to be low-volatility as it holds a diverse array of safe names, such as Home Depot, Visa (NYSE:V), Caterpillar (NYSE:CAT), Microsoft, and Goldman Sachs (NYSE:GS). The Amplify CWP Enhanced Dividend Income ETF emphasizes &#8220;high-quality large cap companies with a history of dividend and earnings growth.&#8221; This approach will typically reduce share-price volatility, so investors can sleep well at night while collecting passive income with DIVO. In a similar vein, the NEOS S&amp;P 500 High Income ETF (BATS:SPYI) is de-risked because it holds well-known large-cap stocks in multiple sectors. Indeed, SPYI might be the least risky fund on this list as it includes approximately 500 stocks in its holdings. Because the NEOS S&amp;P 500 High Income ETF generates income from the S&amp;P 500 index, it is a widely diversified fund. So, there&#8217;s a safety factor built into the SPYI ETF. In addition, the NEOS S&amp;P 500 High Income ETF is an enticing passive income machine with a 12.11% annual distribution rate. The fund&#8217;s 0.68% annual expense ratio isn&#8217;t super-low, but the fees may be justified as SPYI brings high yield and instant diversification to the table. All in all, I like DIVO and SPYI for reduced volatility, SCHD for low management fees, and QQQI and JEPQ for technology-sector exposure.The post These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 13:30:07",
      "date": "03/06/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/03/these-5-etfs-qqqi-jepq-schd-divo-spyi-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.151515151515156
    },
    {
      "title": "Apple eyes using AI to design its chips, technology executive says",
      "content": "Apple is interested in tapping generative artificial intelligence to help speed up the design of the custom chips at the heart of its devices, its top hardware technology executive said in private remarks last month.",
      "source": "reuters.com",
      "rawDate": "2025-06-18 19:16:41",
      "date": "18/06/2025",
      "time": "19:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-eyes-using-ai-design-its-chips-technology-executive-says-2025-06-18/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.1
    },
    {
      "title": "US consumer prices rise moderately; tariffs seen fanning inflation",
      "content": "Inflation is expected to accelerate in the coming months on the back of the Trump administration's import tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-06-11 08:38:04",
      "date": "11/06/2025",
      "time": "08:38",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/us/us-consumer-prices-rise-moderately-may-2025-06-11/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 41.81666666666667
    },
    {
      "title": "Court battle over Trump tariffs prolongs shipper uncertainty as holiday season nears",
      "content": "Importer uncertainty ahead of the vital holiday ocean shipping season remains high, the executive director of the busiest port in the U.S. said on Thursday, as a court battle broke out over President Donald Trump's trade tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-05-29 18:56:34",
      "date": "29/05/2025",
      "time": "18:56",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/business/autos-transportation/court-battle-over-trump-tariffs-prolongs-shipper-uncertainty-holiday-season-2025-05-29/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.68156565656566
    },
    {
      "title": "Apple's stock falls as Trump makes a tariff threat on iPhones. Here's why it's misguided.",
      "content": "President Donald Trump said Apple must pay a 25% tariff if it doesn't rely on domestic production of iPhones for the U.S. market",
      "source": "marketwatch.com",
      "rawDate": "2025-05-23 08:46:00",
      "date": "23/05/2025",
      "time": "08:46",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-falls-as-trump-makes-a-tariff-threat-on-iphones-heres-why-its-misguided-502c7fce",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.55252525252525
    },
    {
      "title": "Apple plans smart glasses launch in 2026, Bloomberg News reports",
      "content": "Apple plans to release smart glasses at the end of next year, Bloomberg News reported on Thursday, in the iPhone maker's latest push to diversify its product lineup and boost demand for its artificial intelligence devices.",
      "source": "reuters.com",
      "rawDate": "2025-05-22 16:01:43",
      "date": "22/05/2025",
      "time": "16:01",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-plans-smart-glasses-launch-2026-bloomberg-news-reports-2025-05-22/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.556060606060605
    },
    {
      "title": "Why Wall Street downgrades of Apple stock are about to pile up",
      "content": "Most company analysts play it safe rather than risk their reputation — and possibly their career.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-29 07:45:00",
      "date": "29/05/2025",
      "time": "07:45",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/why-wall-street-downgrades-of-apple-stock-are-about-to-pile-up-241a2978",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.14823232323232
    },
    {
      "title": "Inflation reports are encouraging, but the rest of the year remains uncertain: Former Fed official",
      "content": "The Federal Reserve will hold its June meeting on Tuesday, where Fed Chair Jerome Powell will announce the central bank's latest interest rate decision. US President Trump has been vocal in his criticism of Powell for not cutting rates, recently calling him a \"numbskull.",
      "source": "youtube.com",
      "rawDate": "2025-06-12 17:21:01",
      "date": "12/06/2025",
      "time": "17:21",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=iA6ASAixU40",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.72247474747475
    },
    {
      "title": "Court denies Apple appeal in Epic Games case, keeping App Store changes in place",
      "content": "A panel of judges denied Apple's emergency application to halt changes to its App Store that resulted from the company's legal battle with Epic Games. The ruling in the case means Apple can no longer charge a commission on payment links inside its apps nor tell developers how the links should look.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 17:40:52",
      "date": "04/06/2025",
      "time": "17:40",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/apple-appeal-epic-games-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.754797979797985
    },
    {
      "title": "Consumer confidence for May was much stronger than expected on optimism for trade deals",
      "content": "Consumer confidence for May was much stronger than expected on optimism for trade deals",
      "source": "cnbc.com",
      "rawDate": "2025-05-27 10:15:31",
      "date": "27/05/2025",
      "time": "10:15",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/05/27/consumer-confidence-for-may-was-much-stronger-than-expected-on-optimism-for-trade-deals.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.3780303030303
    },
    {
      "title": "U.S. inflation rises 0.1% in May from prior month, less than expected",
      "content": "The consumer price index was expected to rise 0.2% in May, with a 12-month inflation rate of 2.4%.",
      "source": "cnbc.com",
      "rawDate": "2025-06-11 08:32:21",
      "date": "11/06/2025",
      "time": "08:32",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/11/cpi-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.86313131313131
    },
    {
      "title": "Apple: Much, Much Cheaper Than It Looks (Rating Upgrade)",
      "content": "With more than $100 billion in annual sales and gross margins around the 75% mark, Apple's services segment is being categorically undercounted by the market. If this segment can produce ~5% revenue growth in each of the next three years, then estimates appear too low. This makes the stock appear much cheaper than previously thought. Trading at roughly 19x 2028 earnings, we think shares of AAPL appear highly attractive, and deserve an upgrade to 'Buy'.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-28 13:28:44",
      "date": "28/05/2025",
      "time": "13:28",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4790550-apple-much-much-cheaper-than-it-looks-rating-upgrade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.96363636363636
    },
    {
      "title": "Apple's stock has been in a slump — and these analysts don't see an easy way out",
      "content": "Needham analysts say the stock looks pricey, while Apple faces growing threats from its tech rivals.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 11:16:00",
      "date": "04/06/2025",
      "time": "11:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-has-been-in-a-slump-and-these-analysts-dont-see-an-easy-way-out-6906acd0",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.20202020202021
    }
  ],
  "france": [
    {
      "title": "QQQI vs. JEPQ: Which ETF is the True Dividend King?",
      "content": "Key Points The NASDAQ-100 is a volatile index that offers considerable long term upside amidst its intraday turbulence. Use of financial derivatives for both risk mitigation and for potentially larger leveraged gains has become routine in the financial world, especially for QQQI and JEPQ. To qualify as a “Dividend King”, a stock must have a track record of 50 or more consecutive years of dividend increases due to the underlying issuing company’s intrinsic growth. ETF “dividend kings” are metaphorical, but may reference a head to head comparison. Are you ahead or behind on your retirement goals? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted and must act in your best interests. Don’t waste another minute – get started by clicking here.(Sponsor) Seven of the top largest S&amp;P 500 stocks by market cap are tech industry companies that have been dubbed “The Magnificent 7” due to their remarkable tandem bull run over the past several years. These stocks are:: Apple, Amazon, Alphabet (Google), Microsoft, Meta Platforms (Facebook), Nvidia, and Tesla. In order to give better focus on the tech and other higher growth sectors, which tend to be listed on NASDAQ, the NASDAQ-100 index was created to track the top 100 NASDAQ listed companies that are not in the financial sector, as the tech emphasis also purports to emphasize innovation and new products instead of financial companies, which ostensibly do not. The launch of Exchange Traded Funds (ETFs) that track the NASDAQ-100 index was a foregone conclusion, and several of them already vie for investor dollars on a daily basis. Two that have exhibited sizable growth but have been able to augment their gains in the form of dividends, are: The NEOS Nasdaq-100 High Income ETF (NASDAQ: QQQI), and the JP Morgan Nasdaq Equity Premium Income ETF (NASDAQ: JEPQ). Ironically, both indexes generate their high yields through strategic innovations that rival those in the tech sector, in terms of their potential to deliver performance enhancements for their assigned tasks. How QQQI and JEPQ Compare &#8211; An Overview Both QQQI and JEPQ track the NASDAQ 1oo ETF, which is very volatile, due to its heavy weighting in the technology sector. Both ETFs are still relatively young. QQQI only launched in January, 2024 and JEPQ began in May, 2022. The following details are based on market price at the time of this writing: Category QQQI JEPQ Yield 14.55% 11.28% Net Assets $1.76 billion $26.27 billion Average Daily Volume 970,269 shares 7.29 million shares Expense Ratio 0.68% 0.35% Beta 0.00 0.83 52-week range 41.17-54.47 44.31-58.54 1-year return 14.37% 7.69% 1-year trailing return 15.24% 8.49% 3-year return n/a 14.40% Largest Hedge Fund Holder Second Half Financial Ptnrs Fisher Asset Mgmt. Sector Weighting #1 Technology &#8211; 52.41% Technology &#8211; 51.41% Sector Weighting #2 Communication Svc &#8211; 16.09% Communication Svc &#8211; 15.90% Sector Weighting #3 Consumer Cyclical &#8211; 12.85% Consumer Cyclical &#8211; 14.60% JEPQ Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 7.49% NVDA Nvidia Corp 7.35% AAPL Apple, Inc. 6.47% AMZN Amazon 4.92% GOOG Alphabet Class C 3.99% QQQI Top 5 Holdings Symbol/Exchange Company Percentage MSFT Microsoft Corp. 8.61% NVDA Nvidia Corp 8.30% AAPL Apple, Inc. 7.59% AMZN Amazon 4.87% AVGO Broadcom 4.74% Strategic Differences Although they both utilize covered call options for creating dividends, JEPQ&#8217;s use of ELNs is more conservative than QQQI&#8217;s direct trading of out of the money calls in addition to its portfolio covered call writing. Both JEPQ and QQQI utilize option strategies to artificially create dividends for their shareholders. However there are both mechanical and risk/reward differences in their respective approaches. JEPQ uses Equity Linked Notes (ELNs), which are synthetic financial products created by financial institutions, and are linked to a particular index or stock. ELNs usually have a call option attached to a principal protection component, and can be likened to a short-term zero-coupon bond with a maturity of no longer than a few months. The returns on the ELN are linked to the underlying index or stock. Additionally, most, if not all ELNs are purchased directly from the issuer and held to maturity. There is no secondary market for ELNs. JEPQ manager Hamilton Reiner staggers one-month calls into multiple weekly buckets, then diversifies the expiration dates and strike prices. However, Reiner conducts this strategy with purchases of ELNs that give the JEPQ exposure to the profits on those call options, without the risk of any of the top tech stock holdings being subject to calls if the market takes off and the calls go in-the-money. Conversely, QQQI also utilizes a covered call strategy, in addition to out of the money call purchases to augment upside gains. QQQI writes their covered calls directly against the NASDAQ-100 index up to 100% of the equity value of total QQQI holdings. The fund then uses a portion of their covered call premium income to purchase out of the money call options. This give it the following result scenarios: If the market ends relatively flat, QQQI has kept the premium income minus the cost of the out of the money options. If the market jumps up, the underwritten covered call is already hedged against stocks, but QQQI can take profit on the out of the money call that ostensibly would be in the money due to the jump. Overall Analysis and The King of the Hill In This Competition For 1 year&#8217;s yield comparison, QQQI wins the &#8220;King of the Hill&#8221; contest against JEPQ, but has 49 years to go of upping the yield ante annually before being able to claim a &#8220;Dividend King&#8221; title. Selling covered calls is considered a viable strategy to mitigate volatility and take advantage of market volatility, which usually means increased delta and subsequently larger premiums. However, there is a reason why there is a sizable enough market on the buy side &#8211; there are enough people who think the option will increase in value. However, selling calls can limit interim upside, especially if the goal is for the option to expire worthless so the same underlying securities can cover another call writing opportunity next month. President Thomas Jefferson was once quoted, “ With risk comes great reward.” QQQI’s superior yield is a testament to the reward from being more aggressive and taking on more risk than JEPQ. However, with only slightly over 1 years’ worth of trading history and returns from which to judge, QQQI may be the dividend “king of the hill” only for the moment. Whether a consistent track record can be built or not on the QQQI strategy model, which needs to be actively managed by their presumably disciplined managers, remains to be seen. Since both companies’ dividends are artificially created through trading against market volatility, as opposed to intrinsic enhanced value through a business, the ability for JEPQ and QQQI rests solely on skill and knowledge of its managers. If they can first reach Dividend Aristocrat status (25 or more years of consecutive, annual dividend increases), then perhaps a hypothetical Dividend King discussion (50 consecutive years or more of dividend increases) can be had. The post QQQI vs. JEPQ: Which ETF is the True Dividend King? appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "crypto",
      "impact": "positive",
      "country": "france",
      "url": "https://247wallst.com/investing/2025/06/10/qqqi-vs-jepq-which-etf-is-the-true-dividend-king/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 44.54545454545455
    },
    {
      "title": "Expectations are for higher inflation and lower growth, says RBC's Frances Donald",
      "content": "CNBC's Steve Liesman, Morgan Stanley's Jim Caron, JPMorgan's David Kelly and RBC's Frances Donald join 'Power Lunch' to discuss the expectations for interest rates, the Federal Reserve and much more.",
      "source": "youtube.com",
      "rawDate": "2025-06-18 14:37:13",
      "date": "18/06/2025",
      "time": "14:37",
      "category": "economy",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=OEA0yECXyoY",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.00732323232323
    },
    {
      "title": "OECD Slashes Global Economic Forecasts Amid Tariffs, Trade Uncertainty",
      "content": "OECD Chief Economist Alvaro Santos Pereira discusses the Paris-based organization's decision to slash its global economic growth forecast to 2.9% this year, down from 3.3% in 2024. \"There's been a huge increase in trade and economic policy uncertainty,\" he tells Bloomberg Television.",
      "source": "youtube.com",
      "rawDate": "2025-06-03 05:40:39",
      "date": "03/06/2025",
      "time": "05:40",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=E-sUVQdcV3A",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.91010101010101
    },
    {
      "title": "Tariffs Are Challenging the Cachet of Luxury Goods From Europe",
      "content": "The trade war has turned a spotlight on the artisanal clusters behind glamorous goods, inviting fresh scrutiny of one of the industry's key selling points.",
      "source": "wsj.com",
      "rawDate": "2025-05-24 23:00:00",
      "date": "24/05/2025",
      "time": "23:00",
      "category": "markets",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.wsj.com/business/retail/tariffs-are-challenging-the-cachet-of-luxury-goods-from-europe-a7258c5f",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 14.809343434343434
    },
    {
      "title": "OECD chops U.S. growth forecasts, cites risks to the downside as tariffs bite",
      "content": "The Paris-based global policy forum now sees U.S. growth at just 1.6% this year, and global growth at 2.9%.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-03 05:02:00",
      "date": "03/06/2025",
      "time": "05:02",
      "category": "economy",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/oecd-chops-u-s-growth-forecasts-cites-risks-to-the-downside-as-tariffs-bite-42be736c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 10.130555555555556
    }
  ],
  "uk": [
    {
      "title": "As China’s Dominance Dims, India Begins to Shine – The Time to Consider Investment Opportunities is Now",
      "content": "Key Points As US tariffs hit, China&#8217;s manufacturing sector feels the bite Geopolitics began the slide, many multinationals have been looking for a new low cost country/region Risks are still present, but India&#8217;s advancements over the past 30 years have them well positioned Are you ahead, or behind on retirement? SmartAsset&#8217;s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don&#8217;t waste another minute; get started by clicking here.(Sponsor) A seismic shift has transformed global manufacturing in recent years, with US and EU companies increasingly moving production from China to India. Accelerated by President Trump’s use of tariffs as trade weapons, this movement began a few years ago as geopolitical tensions and economic pressures began to raise concerns about supply chain resilience. India’s proactive policies have served to drive this trend toward supply chain diversification. While India has made remarkable progress over the past three decades, and holds vast potential as a manufacturing hub, infrastructure gaps and regulatory complexities present challenges. The primary driver is escalating friction with China. U.S.-China trade wars have imposed steep tariffs on Chinese goods, pushing companies to seek alternatives. From 2018 to 2022, U.S. goods imports from China dropped 10% (inflation-adjusted), while imports from India soared 44%, per trade data. Concerns over intellectual property theft and supply chain risks exposed during COVID-19 further fueled this shift. China’s rising labor and production costs have also eroded its edge in labor-intensive sectors like textiles and electronics, prompting companies to explore cost-competitive alternatives. India has emerged as a prime destination, propelled by initiatives like “Make in India” and Production Linked Incentive (PLI) schemes. These offer tax breaks (e.g., a 17% corporate tax rate for new manufacturing firms), subsidies to attract foreign direct investment (FDI), and a stable legal system rooted in British common law, safeguarding intellectual property. India’s youthful workforce (median age 28) and 1.4 billion-strong consumer market enhance its appeal. Apple, for example, has ramped up iPhone production in India, with Foxconn investing $1.5 billion in Tamil Nadu to supply the U.S. market. India’s share of Apple’s iPhone output grew from 2% to 5% between 2021 and 2022, with goals to hit 25%. Other giants like Dell, Nike, Intel, and Nippon Steel are also shifting production, with over 90% of North American manufacturers surveyed by BCG reporting some relocation from China in the past five years. Yet despite India’s appeal, challenges do remain. India’s infrastructure lags, with only 5% of roads classified as highways, causing logistical bottlenecks. Regulatory red tape hinders operations, with just 55% of companies reporting seamless production shifts. Manufacturing costs in India can also run 5–10% higher than in China due to import duties on components. India faces competition from Vietnam, a leader in electronics, and Mexico, advantaged by its proximity to the U.S. Companies and investors must navigate these hurdles to ensure profitability. This shift opens doors for entrepreneurs and businesses. Investors can target Indian firms or ETFs in booming sectors like electronics and semiconductors, which attracted $16 billion in manufacturing FDI from 2020 to 2023. Content creators can monetize blogs or videos on India’s manufacturing surge through ads or sponsorships. Consulting services offer another path, providing market research or regulatory guidance for firms entering India. Businesses can also develop logistics or compliance solutions to address operational challenges. The pivot from China to India reflects geopolitical, economic, and logistical realities. India’s policies and demographic strengths position it as a rising manufacturing powerhouse, but infrastructure and regulatory hurdles require careful strategy. Opportunities in investment, content creation, and consulting abound for those who can navigate India’s complexities with precision. Investors can explore top Indian companies listed on U.S. exchanges, such as HDFC Bank (NYSE: HDB), Infosys (NYSE: INFY), or MakeMyTrip (NASDAQ: MMYT). For broader exposure, the iShares MSCI India ETF (NASDAQ: INDA) tracks the MSCI India Index, covering roughly 85% of India’s large and mid-cap equity market. The post As China’s Dominance Dims, India Begins to Shine – The Time to Consider Investment Opportunities is Now appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-09 14:03:19",
      "date": "09/06/2025",
      "time": "14:03",
      "category": "crypto",
      "impact": "positive",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/08/as-chinas-dominance-dims-india-begins-to-shine-the-time-to-consider-investment-opportunities-is-now/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.0
    },
    {
      "title": "Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector",
      "content": "Live Updates Live Coverage Has Ended Apple Pipeline 12:47 pm by Gerelyn Terzo Apple&#8217;s (Nasdaq: AAPL) Worldwide Developers Conference (WWDC) will spotlight announcements from CEO Tim Cook relating to updates to the company&#8217;s operating systems for iPhones, iPads, Macs, etc. Apple is also expected to provide updates on AI software Apple Intelligence, including changes and improvements. The unveiled software and features are expected to be available for legacy hardware in the fall, coinciding with the next iPhone launch. The Nasdaq Composite is now up 0.40%, while Apple stock is gaining 0.35%. Easing Inflation 11:08 am by Gerelyn Terzo Inflation showed signs of easing in May, with the New York Fed Survey of Consumer Expectations index falling to 3.2%—a 0.4 percentage point drop from April levels. This improvement follows progress made by the Trump administration with U.S. trade partners. The Nasdaq Composite is up 0.43%. Wall Street Cautious on MCD 10:02 am by Gerelyn Terzo Morgan Stanley has turned more cautious on fast-food giant McDonald&#8217;s (NYSE: MCD), downgrading shares to an &#8220;equal weight&#8221; rating from &#8220;overweight,&#8221; citing &#8220;structural pressures on fast food.&#8221; The Wall Street firm lowered the price target by $5 to $324 per share. MCD stock is down 2% today. This article will be updated throughout the day, so check back often for more daily updates. Technology stocks are mostly higher today, setting a positive tone for the broader markets. U.S. and Chinese officials are expected to restart trade discussions today in Europe. Big Tech stock Apple (Nasdaq: AAPL) is gearing up for its developer conference, called WWDC, today, featuring a keynote speech from CEO Tim Cook. The markets will be listening for any advancements on AI innovation. The three major stock market averages are higher out of the gate, with the Dow Jones Industrial Average, Nasdaq Composite and S&amp;P 500 all posting gains. All sectors of the economy are higher as sentiment looks up to start the week. The S&amp;P 500 is trading back above the psychologically important 6,000 level, powered in part by chip stocks including Advanced Micro Devices (Nasdaq: AMD), which is tacking on 3.4% today. While tech as a sector is moving higher, one Magnificent 7 stock being left out of the gains is Tesla (Nasdaq: TSLA), which is down 3.9%. Wall Street analysts downgraded the EV stock due to the distraction of tensions between CEO Elon Musk and President Trump. On the economic front, the latest inflation data is expected mid-week when the latest Consumer Price Index and Producer Price Index results for May will be revealed. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 39 (+0.09%) Nasdaq Composite: Up 23.50 (+0.11%) S&amp;P 500: Up 9 (+0.15) Market Movers Meta Platforms (Nasdaq: META) is in discussions to potentially back AI startup Scale AI with a $10 billion-plus investment, according to a Bloomberg report. Archer Aviation (NYSE: ACHR) is gaining 5% today as its piloted flight program gains momentum in the U.S. and UAE markets. Quantum computing stock IonQ (NYSE: IONQ) is gaining 3% after announcing a deal to acquire London’s Oxford Ionics in a billion-dollar transaction. The post Live Nasdaq Composite: Markets Stay Hopeful in Big Week for Tech Sector appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-11 04:04:43",
      "date": "11/06/2025",
      "time": "04:04",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/06/09/live-nasdaq-composite-markets-stay-hopeful-in-big-week-for-tech-sector/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 43.151515151515156
    },
    {
      "title": "British carmaker JLR trims FY26 margin forecast to 5%-7% as US tariffs cast shadow",
      "content": "British luxury carmaker Jaguar Land Rover cut its fiscal 2026 earnings before interest and taxes margins forecast to 5%-7% on Monday from 10% earlier, citing uncertainty in the global auto industry as U.S. tariffs loom.",
      "source": "reuters.com",
      "rawDate": "2025-06-15 23:50:50",
      "date": "15/06/2025",
      "time": "23:50",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.reuters.com/world/india/indias-tata-motors-expects-5-7-fy26-ebit-margins-luxury-unit-jlr-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.09318181818182
    },
    {
      "title": "Live Nasdaq Composite: Markets in Freefall Amid EU Tariff Tussle",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Interest Rate Cuts in Flux 9:56 am by Gerelyn Terzo Chicago Fed President Austan Goolsbee stated Friday that President Donald Trump&#8217;s recent tariff actions have thrown a wrench into monetary policy likely delaying any adjustments to interest rates. He told CNBC: &#8220;Everything’s always on the table. But I feel like the bar for me is a little higher for action in any direction while we’re waiting to get some clarity.&#8221; This article will be updated throughout the day, so check back often for more daily updates. The markets are in freefall on Friday, with all three of the major stock market averages lower by at least 1%. The markets are poised to end the week on a negative note after President Trump threatened to impose a steep 50% tariff on the EU, which could take effect in the coming days. The Dow Jones Industrial Average is reeling by over 400 points, while the Nasdaq Composite and S&amp;P 500 are similarly down 1% today. Most sectors of the economy are trading lower, with the worst declines seen in consumer discretionary and technology stocks. Treasury yields are falling as the trade war reignites, capping off a roller coaster week for the bond market. Volatility has also returned to the stock market, as evidenced by a 25% increase in the CBOE Volatility Index (VIX). Additionally, Apple (Nasdaq: AAPL) has a target on its back after President Trump also cautioned that iPhones made outside of the U.S. could be subject to heavy tariffs. Apple stock is down 2% today. In a bright spot for the Magnificent Seven stocks, influential Wedbush analyst Dan Ives is bullish on Tesla (Nasdaq: TSLA), lifting his price target on the EV maker to $500, reflecting 49% upside potential, with an &#8220;outperform&#8221; rating attached. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 400.50 (-0.96%) Nasdaq Composite: Down 309.43 (-1.6%) S&amp;P 500: Down 66.80 (-1.1%) Market Movers Nuclear stocks are bucking the downward trend today and gaining ground as the Trump administration looks to implement favorable conditions for the industry. Stocks including Oklo (NYSE: OKLO), NuScale (NYSE: SMR) and Constellation Energy (Nasdaq: CEG) are all advancing today, led by a double-digit percentage gain for OKLO. Quantum computing stock IonQ (NYSE: IONQ) fell as much as 4.7% today, following yesterday&#8217;s rally that saw the share price close above $45. The post Live Nasdaq Composite: Markets in Freefall Amid EU Tariff Tussle appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-23 10:00:52",
      "date": "23/05/2025",
      "time": "10:00",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/05/23/live-nasdaq-composite-markets-in-freefall-amid-eu-tariff-tussle/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 31.439393939393938
    },
    {
      "title": "S&P and Nasdaq sit in the red ahead of CPI data and Wall Street opening bell",
      "content": "US stock futures were pointing to a small decline on Wednesday morning, while traders awaited key inflation data ahead of the opening bell. Investors also were digesting the limited progress from US-China trade talks in London.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-06-11 08:24:08",
      "date": "11/06/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.proactiveinvestors.com/companies/news/1072779",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.433585858585857
    },
    {
      "title": "U.S.-China trade talks will allow deliberate management of bilateral relationship: Dewardric McNeal",
      "content": "Dewardric McNeal, Longview Global managing director, joins 'Squawk Box' to discuss the resumption of U.S.-China trade talks in London, the focus on rate earths, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 08:33:09",
      "date": "09/06/2025",
      "time": "08:33",
      "category": "companies",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=MxSXraYcWxI",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.972222222222221
    },
    {
      "title": "Trade Focus This Week: U.S. and China Talks in London",
      "content": "Kevin Green kicks off the week providing a road map for what investors might and might not expect to happen from this week's trade talks between the U.S. and China. He examines the potential \"good cop, bad cop\" setup with Howard Lutnick and Scott Bessent joining the negotiations.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 08:28:19",
      "date": "09/06/2025",
      "time": "08:28",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=bbKZouqrXbU",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 14.883838383838384
    }
  ],
  "germany": [
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Apple in Crosshairs 2:11 pm by Gerelyn Terzo Apple (Nasdaq: AAPL) stock has a target on its back. Wall Street firm Needham has downgraded shares of the Big Tech stock to &#8220;hold&#8221; from &#8220;buy,&#8221; arguing the stock is hovering at frothy levels. Needham also pulled its $225 price target, noting a $170-$180 range would be an acceptable entry point. Apple shares were largely unchanged today, while the SPY ETF is up 0.26%. Citi Takes Aim at CEG 11:35 am by Gerelyn Terzo Wall Street analyst firm Citi has reduced its rating on Constellation Energy (NYSE: CEG) shares in response to the utility&#8217;s long-term power agreement with Mag 7 stock Meta (Nasdaq: META). Analysts at Citi now classify CEG stock as high-risk, arguing that the company will forgo the opportunity for premium pricing on its nuclear-generated electricity. They have set a price target of $318. CEG shares are falling 3% today after yesterday&#8217;s rock-star performance. The SPY ETF is up 0.16% as of mid-morning trading. S&amp;P Outlook Looking Up 10:05 am by Gerelyn Terzo With the first half of 2025 almost behind us, Wall Street analysts are actively revising their year-end market forecasts. Most recently, Barclays has adjusted its S&amp;P 500 year-end outlook upward by nearly 3% to 6,050, a notable increase from its previous target of 5,900. Beyond Barclays, other prominent analyst firms like Deutsche Bank and RBC have also recently elevated their 2025 S&amp;P 500 targets, signaling a positively shifting consensus for the broader market&#8217;s direction. This article will be updated throughout the day, so check back often for more daily updates. Market optimism is overriding underwhelming labor market data, with all three major stock averages climbing higher as of morning trading. Yesterday, equities staged a turnaround, as the Dow Jones Industrial Average notched its fourth consecutive winning session, while the tech-heavy Nasdaq Composite and S&amp;P 500 also advanced. Today, most economic sectors are in positive territory, with technology leading the charge with a 1.48% gain. The SPDR S&amp;P 500 ETF (SPY) is up 0.11%) Nvidia (Nasdaq: NVDA) has surpassed Microsoft (Nasdaq: MSFT) to reclaim its position as the world&#8217;s most valuable company, now boasting a market capitalization of $3.45 trillion. Traders and investors are betting whether NVDA stock can clinch new highs soon. Private Payrolls Slow, Sparking Rate Cut Calls Private sector hiring lost significant momentum in May, with payrolls expanding by a mere 37,000 jobs. These results not only fell short of April&#8217;s 60,000 gain but also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. Following this weaker-than-expected private sector jobs data, President Trump is increasing pressure on Jerome Powell to lower interest rates, asserting that the Fed chairman should have already taken this action. Discount Retailers Rally, ON Semi Recovers Dollar General (NYSE: DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on the back of a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is also gaining 6% today, buoyed by similarly upbeat guidance. ON Semi (Nasdaq: ON) is climbing 2.7% today, recouping some recently lost ground. This comes after Morgan Stanley analysts recently indicated that much of the negative sentiment is already factored into ON&#8217;s stock price. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/sp-500-nysearca-spy-live-markets-show-resilience-in-face-of-sputtering-economy/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 59.015151515151516
    },
    {
      "title": "Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Sour Apple 2:05 pm by Gerelyn Terzo One Wall Street analyst firm is taking aim at Big Tech stock Apple (Nasdaq: AAPL). Needham analysts believe AAPL shares are too frothy, downgrading shares to &#8220;hold&#8221; from &#8220;buy.&#8221; The analyst firm also withdrew its price target of $225 per share, saying that the $170-$180 range reflects a more reasonable entry point. AAPL shares are relatively flat today. The Nasdaq Composite is holding onto a gain of 0.43%. Citi Downgrades This Nuclear Stock 11:30 am by Gerelyn Terzo Wall Street firm Citi has downgraded shares of Constellation Energy (NYSE: CEG) on the heels of the utility&#8217;s long-term power arrangement with Big Tech company Meta (Nasdaq: META). Citi analysts attached a high-risk label to CEG stock, saying that it will miss out on premium pricing for its nuclear power, with a price target of $318. After yesterday&#8217;s rally, CEG shares are falling 2.8% today. The Nasdaq Composite is up 0.25% as of mid-morning trading. Wall Street Improves Market Outlook 9:51 am by Gerelyn Terzo With the first half of 2025 nearly in the rearview mirror, Wall Street analysts are coming out in droves to revise their year-end forecasts. Most recently, Barclays has updated its S&amp;P 500 year-end outlook by close to 3% to 6,050 compared with a previous target of below 6,000. In addition to Barclays, other analysts firms that have lifted their 2025 S&amp;P 500 targets of late include Deutsche Bank and RBC. This article will be updated throughout the day, so check back often for more daily updates. The markets appear to be shrugging off some lackluster labor market data, with all three of the major stock market averages higher as of early morning trading. Yesterday, the markets managed to turn things around, with the Dow Jones Industrial Average tacking on its fourth-straight winning session while the tech-heavy Nasdaq Composite and S&amp;P 500 also gained ground. Today, most sectors of the economy are higher, led by technology with a 1.48% advance. Nvidia&#8217;s (Nasdaq: NVDA) muscled Microsoft (Nasdaq: MSFT) out of the way to reclaim the top of the most valuable company in the world rankings, with a market capitalization of $3.45 trillion. Traders are debating whether NVDA stock will see new highs in the near future. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 62.83 (+0.22%) Nasdaq Composite: Up 50.28 (+0.26%) S&amp;P 500: Up 14.10 (+0.24%) Economic Headwinds Private sector hiring lost momentum in May, with payrolls expanding by a mere 37,000 jobs. Results fell short of April&#8217;s 60,000 gain and also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. President Trump is increasing pressure on Jerome Powell to lower interest rates following the weaker-than-expected private sector jobs data, saying the Fed chairman should have already taken this action. Market Movers Dollar General (NYSE:DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is gaining 6% on the day on similarly upbeat guidance. ON Semi (Nasdaq: ON) is gaining 2.7% today, recouping some recently lost ground. Morgan Stanley analysts recently said that negativity is already priced into ON stock. The post Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/live-nasdaq-composite-markets-look-to-extend-gains-despite-economic-headwinds/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 56.36363636363637
    },
    {
      "title": "ECB relaxed about euro strength, risk of too low inflation, de Guindos says",
      "content": "Tariffs will weigh on euro zone economic growth and prices for years, but there is little risk of inflation falling too low, and even the euro's surge against the dollar is not a major worry, European Central Bank Vice President Luis de Guindos said.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 01:05:08",
      "date": "16/06/2025",
      "time": "01:05",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ecb-relaxed-about-euro-strength-risk-too-low-inflation-de-guindos-says-2025-06-16/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 54.967171717171716
    },
    {
      "title": "Euro zone inflation falls to cooler-than-expected 1.9% in May, below ECB target",
      "content": "Economists polled by Reuters had been expecting the May reading to come in at 2%, which is the European Central Bank's target.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 05:04:56",
      "date": "03/06/2025",
      "time": "05:04",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/03/euro-zone-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.74393939393939
    },
    {
      "title": "Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Bonds on Sale 1:19 pm The Treasury&#8217;s auction of 5-year notes has concluded. Paying 4% interest, the $70 billion in notes sold at an average yield of 4.07%, indicating a small 1.7% discount to face value. At the Right Price, Investors Still Love T-Bills 11:52 am $70 billion worth of 5-year Treasury notes are about to go on auction, and demand looks healthy even as yields rise. (Which makes sense. Higher yields imply lower prices, and everybody likes a bargain, even when we&#8217;re talking about U.S. government debt). 2-year Treasuries went on sale yesterday, and demand was described similarly as &#8220;solid.&#8221; The Dow is still down 0.3%. Apple and iPhones in Focus 11:17 am Dow component company Apple (Nasdaq: APPL) is in focus today as Loop Capital analyst Ananda Baruah reiterates a hold rating and $215 price target on the tech stock. &#8220;Tariff actions&#8221; are pulling demand for iPhones forward into the March and June quarters as investors hedge against the risk President Trump is serious about imposing 25% tariffs on imported iPhones. Further out, the analyst is looking ahead to the expected iPhone 17 launch. Apple has raised its estimates for iPhone 17 shipments in Q4, and iPhone average selling prices are also moving higher. Apple stock is up about 0.5% today. But the Dow Jones Industrial Average has turned red, now down 0.3%. This article will be updated throughout the day, so check back often for more daily updates. President Trump alarmed investors last week when he threatened to impose a 50% tariff on imports from the European Union as early as June 1. On Monday, the President backtracked, saying the tariffs won&#8217;t actually go into effect until July 9. Even more optimistically, he confirmed efforts are afoot to &#8220;quickly establish meeting dates&#8221; with EU negotiators to lower tariff barriers and &#8220;open up the European Nations for Trade with the United States of America.&#8221; In more troubling news, there&#8217;s trouble brewing at the White House today as Elon Musk, who spearheaded President Trump&#8217;s Department of Government Efficiency (DOGE) efforts, says he&#8217;s &#8220;disappointed&#8221; with &#8220;the massive spending bill&#8221; that the President sent to Congress last week, and that the House of Representatives has now passed. The bill, says Musk, &#8220;increases the budget deficit&#8221; and &#8220;undermines the work that the Doge team is doing.&#8221; Not good. Nevertheless, after soaring 700 points yesterday, the Dow Jones Industrial Average (DJINDICES: ^DJI) is up another 65 points today for a nearly 0.2 % gain. Earnings Abercrombie &amp; Fitch (NYSE: ANF) reported an earnings beat today, $1.59 per share earned in Q1, which was $0.20 better than expected. The retail clothing chain stock is up nearly 27% currently. Macy&#8217;s (NYSE: M) &#8220;beat earnings by a penny,&#8221; reporting $0.16 per share in Q1 profit. Macy&#8217;s stock is down almost 4%. Both companies cut guidance after reporting their beats. Abercrombie predicts it will earn between $9.50 and $10.50 this year. Macy&#8217;s says full year earnings will range from $1.60 to $2. Both earnings ranges are broadly below analyst forecasts, implying no more earnings beats this year. Dick&#8217;s Sporting Goods (NYSE: DKS) meanwhile reported $3.37 per share this morning. The number beat analyst forecasts. Even better, guidance at Dick&#8217;s calls for $13.80 to $14.40 per share earned this year. At the midpoint, that&#8217;s less than Wall Street&#8217;s forecast $14.34, but the &#8220;$14.40&#8221; number at least implies there&#8217;s a chance Dick&#8217;s will beat estimates this year. The post Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-28 14:06:21",
      "date": "28/05/2025",
      "time": "14:06",
      "category": "crypto",
      "impact": "positive",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/05/28/dow-jones-live-update-may-28-dow-jones-industrial-average-dji-opens-higher/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.333333333333336
    },
    {
      "title": "Ireland sells final AIB shares 15 years after banking crisis",
      "content": "The Irish government said on Tuesday that it had sold its remaining shares in AIB Group , one of the country's two dominant lenders it effectively nationalised 15 years ago as part of the euro zone's biggest state rescue.",
      "source": "reuters.com",
      "rawDate": "2025-06-17 02:22:07",
      "date": "17/06/2025",
      "time": "02:22",
      "category": "crypto",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/ireland-sells-final-aib-shares-15-years-after-banking-crisis-2025-06-17/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.43207070707071
    },
    {
      "title": "Polish stocks fall as eurosceptic Nawrocki elected president",
      "content": "Polish equities slipped on Monday after nationalist opposition candidate Karol Nawrocki won the second round of the country's presidential election.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 03:21:38",
      "date": "02/06/2025",
      "time": "03:21",
      "category": "companies",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/business/finance/polish-stocks-fall-eurosceptic-nawrocki-elected-president-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.229292929292924
    },
    {
      "title": "Trump says EU call to set up trade meetings is positive",
      "content": "U.S. President Donald Trump on Tuesday said the EU's move to set up talks was positive and that he hoped Europe would \"open up\" to trade with the U.S. even as he reiterated his threat to unilaterally impose trade terms if no agreement emerges.",
      "source": "reuters.com",
      "rawDate": "2025-05-27 10:16:09",
      "date": "27/05/2025",
      "time": "10:16",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/business/autos-transportation/trump-says-eu-call-set-up-trade-meetings-is-positive-2025-05-27/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 36.84166666666667
    },
    {
      "title": "World's biggest sovereign wealth fund says EU markets need single regulator",
      "content": "The European Union needs a single regulatory framework and to break down fragmentation across its business, tax, debt issuance and securities law systems, according to Norges Bank Investment Management. \"European markets over time have fallen behind in terms of business dynamism and the provision of new investment opportunities to institutional investors,\" NBIM will tell the European Commission in a letter this week.",
      "source": "cnbc.com",
      "rawDate": "2025-06-09 07:39:25",
      "date": "09/06/2025",
      "time": "07:39",
      "category": "markets",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/09/worlds-biggest-sovereign-wealth-fund-eu-markets-need-single-regulator.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 33.43939393939394
    },
    {
      "title": "Dax Index News: Inflation, PMI, and Fed Outlook to Guide DAX Forecast This Week",
      "content": "DAX steadies as investors weigh ECB rate cut bets, PMI outlook, and renewed US-China trade tensions after Trump's rare earth minerals accusation.",
      "source": "fxempire.com",
      "rawDate": "2025-06-02 01:00:12",
      "date": "02/06/2025",
      "time": "01:00",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-inflation-pmi-and-fed-outlook-to-guide-dax-forecast-this-week-1523083",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.296717171717173
    },
    {
      "title": "Magnificent 7 check-in: Nvidia earnings expectations, Trump takes aim at Apple",
      "content": "While also threatening 50% tariffs against the European Union, President Trump also hinted that he could hit Apple with a 25% tariff if it doesn't begin manufacturing iPhones within the US. Laffer Tengler Investments CEO and CIO Nancy Tengler weighs in on these headlines and her outlook on investing in Apple and Nvidia ahead of the chipmaker's earnings release.",
      "source": "youtube.com",
      "rawDate": "2025-05-23 11:38:40",
      "date": "23/05/2025",
      "time": "11:38",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.youtube.com/watch?v=X7OTE_XOodk",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 23.871969696969696
    },
    {
      "title": "ECB Shouldn't Rush Into Further Rate Cuts, Bundesbank's Nagel Says",
      "content": "The Bundesbank president said he supports a cautious approach given that inflation in the eurozone has reached its target level.",
      "source": "wsj.com",
      "rawDate": "2025-06-16 03:58:00",
      "date": "16/06/2025",
      "time": "03:58",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.wsj.com/articles/ecb-shouldnt-rush-into-further-rate-cuts-bundesbanks-nagel-says-02ed4d4e",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.355555555555554
    },
    {
      "title": "Top Stock Movers Now: Apple, Deckers Outdoor, Intuit, and More",
      "content": "U.S. equities slumped at midday after President Donald Trump threatened tariffs on Apple (AAPL) iPhones and European Union (EU) products. The Nasdaq slipped 1%, and the Dow Jones Industrial Average and S&P 500 were down as well.",
      "source": "investopedia.com",
      "rawDate": "2025-05-23 12:20:38",
      "date": "23/05/2025",
      "time": "12:20",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.investopedia.com/top-stock-movers-now-apple-deckers-outdoor-intuit-and-more-11740912",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.51212121212121
    },
    {
      "title": "Global Markets Mostly Lower on Continued Trade Tensions; Eurozone CPI Data In Focus",
      "content": "Markets and U.S. futures were down on continued trade tensions, and ahead of Eurozone flash CPI data Tuesday and an ECB rate decision later this week.",
      "source": "wsj.com",
      "rawDate": "2025-06-03 04:09:00",
      "date": "03/06/2025",
      "time": "04:09",
      "category": "markets",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.wsj.com/economy/central-banking/global-markets-mostly-lower-on-continued-trade-tensions-eurozone-cpi-data-in-focus-60dcfafd",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.431818181818182
    }
  ],
  "china": [
    {
      "title": "Apple raises trade-in prices for iPhones in China to spur demand in key market",
      "content": "Apple on Friday raised the amount of money people can get off their next iPhone in China by trading in their old device. The move signals Apple's desire to spur more sales in China, where it has faced falling market share and declining sales amid tougher competition from Xiaomi and Huawei.",
      "source": "cnbc.com",
      "rawDate": "2025-05-23 03:45:03",
      "date": "23/05/2025",
      "time": "03:45",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/23/apple-raises-trade-in-prices-for-iphones-in-china-as-amid-competition.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 40.66919191919192
    },
    {
      "title": "Apple's iPhone sales capture top spot in Chinese market in May, Counterpoint Research says",
      "content": "Apple's iPhone sales rose to the top spot in China in May, with global sales growing 15% year-on-year during April and May in the tech giant's strongest performance for the two-month period since the COVID-19 pandemic, data from Counterpoint Research showed.",
      "source": "reuters.com",
      "rawDate": "2025-06-13 02:29:18",
      "date": "13/06/2025",
      "time": "02:29",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apples-iphone-sales-capture-top-spot-chinese-market-may-counterpoint-research-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.443939393939395
    },
    {
      "title": "U.S.-China talks 'a bit stalled' and need Trump and Xi to weigh in, Treasury Secretary Bessent says",
      "content": "U.S.-China trade talks \"are a bit stalled,\" requiring the two countries' leaders to speak directly, Treasury Secretary Scott Bessent told Fox News. After a rapid escalation in trade tensions last month, Bessent helped the world's two largest economies reach a breakthrough agreement in Switzerland on May 12.",
      "source": "cnbc.com",
      "rawDate": "2025-05-29 21:39:47",
      "date": "29/05/2025",
      "time": "21:39",
      "category": "markets",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/30/us-china-talks-bit-stalled-and-need-trump-and-xi-to-weigh-in-treasury-secretary-bessent-says.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 36.355555555555554
    },
    {
      "title": "Apple and Alibaba's AI rollout in China delayed by Trump's trade war, FT reports",
      "content": "Apple and Alibaba's rollout of artificial intelligence services in China is being delayed by a Beijing regulator, the Financial Times reported on Wednesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 11:56:07",
      "date": "04/06/2025",
      "time": "11:56",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apple-alibabas-ai-rollout-china-delayed-by-trumps-trade-war-ft-reports-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.35757575757576
    },
    {
      "title": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture",
      "content": "China's tech giant Alibaba has launched new Qwen3 artificial intelligence models for Apple's MLX architecture, Alibaba said in a statement on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-06-16 10:36:35",
      "date": "16/06/2025",
      "time": "10:36",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/alibaba-launches-new-qwen3-ai-models-apples-mlx-architecture-2025-06-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.88358585858586
    },
    {
      "title": "Exclusive: Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
      "content": "Nearly all the iPhones exported by Foxconn from India went to the United States between March and May, customs data showed, far above the 2024 average of 50% and a clear sign of Apple's efforts to bypass high U.S. tariffs imposed on China.",
      "source": "reuters.com",
      "rawDate": "2025-06-12 23:01:58",
      "date": "12/06/2025",
      "time": "23:01",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/foxconn-sends-97-india-iphone-exports-us-apple-tackles-trumps-tariffs-2025-06-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.42146464646464
    },
    {
      "title": "Apple offers additional trade-in discounts for new iPhones in China",
      "content": "Apple is offering additional trade-in discounts for new iPhones in China until June 18, according to its website on Friday.",
      "source": "reuters.com",
      "rawDate": "2025-05-23 01:25:34",
      "date": "23/05/2025",
      "time": "01:25",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/apple-offers-additional-trade-in-discounts-new-iphones-china-2025-05-23/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.3719696969697
    },
    {
      "title": "China expectedly keeps key lending rates steady after May cut",
      "content": "China expectedly kept its benchmark lending rates unchanged Friday. The People's Bank of China held the 1-year loan prime rate at 3.0% and 5-year LPR at 3.5%.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 21:02:19",
      "date": "19/06/2025",
      "time": "21:02",
      "category": "companies",
      "impact": "negative",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/20/china-june-lpr-unchanged-after-may-cut.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.28737373737374
    },
    {
      "title": "Samsung aims to catch up to Chinese rivals for thin foldable phones as Apple said to enter the fray",
      "content": "Samsung is set to launch its next foldable smarpthone, likely called the Galaxy Fold7, at an event next month. Chinese players in particular Honor and Oppo, have aggressively released foldables that are thinner and lighter than Samsung's offerings.",
      "source": "cnbc.com",
      "rawDate": "2025-06-19 07:34:22",
      "date": "19/06/2025",
      "time": "07:34",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/06/19/samsung-aims-to-catch-up-chinese-rivals-for-thin-foldable-phones.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 31.18888888888889
    }
  ],
  "japan": [
    {
      "title": "Trump delays 50% tariffs on EU to July 9",
      "content": "Trump's post came after Von der Leyen said that she had a \"good call\" with Trump, but needed until July 9 to \"reach a good deal.\"",
      "source": "cnbc.com",
      "rawDate": "2025-05-25 18:39:24",
      "date": "25/05/2025",
      "time": "18:39",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 26.570454545454545
    },
    {
      "title": "Rising Rates And Japan Spell Trouble For Stocks This Summer",
      "content": "The Big, Beautiful Bill will significantly increase government debt, pushing long-term interest rates higher as investors demand fiscal responsibility. Rising Treasury yields above 4.5% make stocks less attractive compared to bonds, likely triggering further stock market corrections.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-27 09:24:42",
      "date": "27/05/2025",
      "time": "09:24",
      "category": "economy",
      "impact": "positive",
      "country": "japan",
      "url": "https://seekingalpha.com/article/4790104-rising-rates-and-japan-spell-trouble-for-stocks-this-summer",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.576767676767677
    },
    {
      "title": "S&P 500: New Highs Likely In June",
      "content": "Japan aims to cap the rising long-term yields; this eliminates the major liquidity shock risk for now. The EU tariff delay brings back the trade war de-escalation theme, while soft data is improving based on consumer confidence data.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-28 10:20:41",
      "date": "28/05/2025",
      "time": "10:20",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://seekingalpha.com/article/4790469-sp500-new-highs-likely-in-june",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.147222222222222
    },
    {
      "title": "Tariffs Are Ruled Illegal, Prepare For More Uncertainty",
      "content": "The court's ruling against Trump-era tariffs increases market uncertainty, as the president still has multiple tools to impose trade barriers. Rising Treasury yields and weak Japanese debt demand signal ongoing pressure on long-term rates, which could weigh on equity markets.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-29 09:13:59",
      "date": "29/05/2025",
      "time": "09:13",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://seekingalpha.com/article/4790813-tariffs-are-ruled-illegal-prepare-for-more-uncertainty",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 16.933333333333334
    }
  ],
  "emerging_markets": [
    {
      "title": "India markets regulator bars ex-IndusInd Bank top executives from securities trading",
      "content": "India markets regulator on Wednesday restrained former IndusInd Bank CEO, deputy CEO and three others from trading in securities until further orders over alleged insider trading.",
      "source": "reuters.com",
      "rawDate": "2025-05-28 10:01:20",
      "date": "28/05/2025",
      "time": "10:01",
      "category": "tech",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/world/india/india-markets-regulator-restrains-ex-indusind-bank-top-executives-interim-order-2025-05-28/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.04267676767677
    },
    {
      "title": "Apple gives Tata India iPhone repair business as partnership expands, sources say",
      "content": "Apple has brought in Tata Group to handle repairs for iPhones and MacBook devices in its fast-growing Indian market, signalling the Indian conglomerate's deepening role in the U.S. tech giant's supply chain, two people familiar with the matter said.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 06:34:54",
      "date": "05/06/2025",
      "time": "06:34",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/business/media-telecom/apple-gives-tata-india-iphone-repair-business-partnership-expands-sources-say-2025-06-05/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.646212121212116
    },
    {
      "title": "Russia fines Apple for violating 'LGBT propaganda' law, TASS reports",
      "content": "A Russian court on Tuesday fined U.S. tech giant Apple six million roubles ($76,510) for violating Russian rules on what Moscow calls \"LGBT propaganda,\" the state TASS news agency reported.",
      "source": "reuters.com",
      "rawDate": "2025-06-10 11:25:03",
      "date": "10/06/2025",
      "time": "11:25",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/sustainability/society-equity/russia-fines-apple-violating-lgbt-propaganda-law-tass-reports-2025-06-10/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.58560606060606
    },
    {
      "title": "Turkey Inflation Keeps Falling in Boost to Central Bank",
      "content": "Consumer prices were 35.4% higher on year in May, easing from 37.9% in April, after the central bank lifted its key interest rate in response to recent political turmoil and market jitters.",
      "source": "wsj.com",
      "rawDate": "2025-06-03 03:18:00",
      "date": "03/06/2025",
      "time": "03:18",
      "category": "economy",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.wsj.com/economy/turkey-inflation-keeps-falling-in-boost-to-central-bank-9db96e43",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 24.691666666666666
    },
    {
      "title": "Apple's 25% Tariff Threat: Expect An About-Turn Soon",
      "content": "Apple Inc.'s current tariff headwinds are temporary, with the Trump 2.0 administration's threats unlikely to materialize into significant long-term impact. Apple is skillfully managing supply chain risks by diversifying production to India and Vietnam, mitigating potential tariff exposure. AAPL stock remains undervalued at 25x FY 2026 earnings, offering ~18% upside to a $232 price target as earnings growth accelerates.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-27 09:05:48",
      "date": "27/05/2025",
      "time": "09:05",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://seekingalpha.com/article/4790096-apple-25-percent-tariff-threat-expect-an-about-turn-soon",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.2479797979798
    }
  ],
  "global": [
    {
      "title": "Oil, war and tariffs tear up markets' central bank roadmap",
      "content": "Investor unease about an increasingly uncertain environment is rising, as Norway's shock rate cut on Thursday highlights how U.S. tariffs, Middle East conflict and a shaky dollar make global monetary policy and inflation even harder to predict.",
      "source": "reuters.com",
      "rawDate": "2025-06-19 11:31:22",
      "date": "19/06/2025",
      "time": "11:31",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/oil-war-tariffs-tear-up-markets-central-bank-roadmap-2025-06-19/",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 59.935353535353535
    },
    {
      "title": "The World’s Richest Don’t Have to Be Tech Founders, Look at Steve Ballmer",
      "content": "The sixth richest person in the world is former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer. He has a net worth of $164 billion, below that of his former boss Bill Gates, the founder of Microsoft, at $177 billion. Ballmer left the CEO’s job at Microsoft in 2013. He wisely did not sell most of his shares when he left the company. He owns 4% of the massive tech company, which makes him Microsoft&#8217;s largest private owner. His dividends alone make him $1 billion a year. 24/7 Wall St. Key Points: Former Microsoft Corp. (NASDAQ: MSFT) CEO Steve Ballmer is the sixth richest person in the world. Those on the list above him all founded huge tech companies. Take this quiz to see if you’re on track to retire. (sponsored) The people on the list above Ballmer all started huge tech companies. These include Tesla&#8217;s Elon Musk at $368 billion, Meta’s Mark Zuckerberg at $241 billion, Oracle’s Larry Ellison at $234 billion, and Amazon’s Jeff Bezos at $233 billion. Ballmer joined Microsoft in 1980 and became chief executive in 2000. During his 14-year tenure, Microsoft’s revenue tripled. As Ballmer left, Eric Jackson at the hedge fund Ironfire Capital told Reuters, “I don’t see anybody else on the management team at Microsoft that I think would be much better than Ballmer.” However, he received criticism for not launching popular products like the rival Steve Jobs did at Apple. Ballmer kept 333 million shares despite leaving, about triple the number Gates has kept. Ballmer has become a major philanthropist. While not as visible as Gates and the Bill &amp; Melinda Gates Foundation, according to Forbes, “He has ramped up his philanthropy since 2014; to date the Ballmers have given away more than $4 billion.” Microsoft Stock Price Prediction and Forecast 2025-2030 The post The World&#8217;s Richest Don&#8217;t Have to Be Tech Founders, Look at Steve Ballmer appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-17 12:02:36",
      "date": "17/06/2025",
      "time": "12:02",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://247wallst.com/investing/2025/06/16/the-worlds-richest-dont-have-to-be-tech-founders-look-at-steve-ballmer/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 50.031565656565654
    },
    {
      "title": "TRADING DAY On weekend war-watch again",
      "content": "Making sense of the forces driving global markets. Cautious optimism around a possible de-escalation in the week-long war between Israel and Iran helped foster a relatively positive tone across world markets on Friday, lifting most stock markets and sealing oil's biggest decline in over a month.",
      "source": "reuters.com",
      "rawDate": "2025-06-20 16:36:05",
      "date": "20/06/2025",
      "time": "16:36",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/autos-transportation/global-markets-trading-day-graphic-2025-06-20/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.97373737373738
    },
    {
      "title": "Apple and Samsung smartphone growth to take hit from tariff uncertainty: Counterpoint Research",
      "content": "Counterpoint Research research outfit said it had revised down its overall 2025 global smartphone shipment growth forecast to 1.9% year-on-year from 4.2%, citing \"renewed uncertainties surrounding U.S. tariffs.\" Apple shipments are expected to grow 2.5% year-on-year in 2025, while Samsung shipments are expected to be flat.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 07:35:12",
      "date": "04/06/2025",
      "time": "07:35",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/04/apple-samsung-smartphone-growth-cut-due-to-tariffs-analysts.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.24848484848485
    },
    {
      "title": "HEDGE FLOW Hedge funds buy stocks at quickest pace since Nov 2024, Goldman Sachs says",
      "content": "Hedge funds bought global equities last week at the quickest pace since November 2024, Goldman Sachs said in a note, just as stock markets ended the month with their most positive May performance in decades.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:54:07",
      "date": "02/06/2025",
      "time": "06:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-funds-buy-stocks-quickest-pace-since-nov-2024-goldman-sachs-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.150757575757574
    },
    {
      "title": "IDC cuts global smartphone shipments forecast on tariff volatility",
      "content": "International Data Corp slashed its 2025 global smartphone shipment growth forecast to 0.6% from 2.6% on Thursday, citing tariff-driven economic uncertainty and a pullback in consumer spending.",
      "source": "reuters.com",
      "rawDate": "2025-05-29 09:04:29",
      "date": "29/05/2025",
      "time": "09:04",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/media-telecom/idc-cuts-global-smartphone-shipments-forecast-tariff-volatility-2025-05-29/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.03611111111111
    },
    {
      "title": "Morning Bid: Dollar slides on trade and tax fears",
      "content": "A look at what matters in U.S. and global markets today from Mike Dolan, Editor-At-Large, Finance and Markets",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:39:47",
      "date": "02/06/2025",
      "time": "06:39",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.28762626262626
    },
    {
      "title": "U.S. growth forecast cut sharply by OECD as Trump tariffs sour global outlook",
      "content": "The Organisation for Economic Co-operation and Development on Tuesday downgraded its growth forecasts for both the U.S. and global economy. The U.S. growth outlook was revised to just 1.6% this year and 1.5% in 2026.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 03:00:04",
      "date": "03/06/2025",
      "time": "03:00",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/us-growth-forecast-cut-further-by-oecd-as-trump-tariffs-sour-outlook.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.93333333333334
    },
    {
      "title": "Jim Cramer says Trump is making it hard for the market to value stocks accurately",
      "content": "CNBC's Jim Cramer said President Donald Trump's actions bring out short sellers and lead investors to make misguided market moves. \"When you examine the market's mistakes, they share a common theme: the president's distorting pretty much everything, especially with his tariffs and his jingoistic approach to the rest of the world, and it's continually confounding traders and investors alike,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 18:59:31",
      "date": "03/06/2025",
      "time": "18:59",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/jim-cramer-trump-market-stocks-correctly-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.073989898989897
    },
    {
      "title": "Slok: Even with ruling, inflation likely moves up toward 3%",
      "content": "Torsten Slok, Chief Economist at Apollo Global Management, said the court ruling on tariffs reduces stagflation risk and may slightly raise inflation, keeping interest rates higher for longer.",
      "source": "youtube.com",
      "rawDate": "2025-05-29 07:14:38",
      "date": "29/05/2025",
      "time": "07:14",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=adtSYY7qGkM",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 27.321212121212124
    },
    {
      "title": "US economy shrinks 0.2% in Q1 as trade tensions bite, momentum falters",
      "content": "The US economy contracted at an annualised rate of 0.2% in the March quarter, the first quarterly decline since mid-2022, as gains in business investment, consumer activity and exports only partly offset a jump in imports and reduced government spending. While the gross domestic product (GDP) reading, updated on Thursday by the US Bureau of Economic Analysis, is a slight upward revision from the government's initial -0.3% estimate, it is a stark reversal from the 2.4% expansion recorded in the final quarter of 2024 – reinforcing concerns about waning economic momentum in the world's largest economy.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-05-29 23:06:07",
      "date": "29/05/2025",
      "time": "23:06",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.proactiveinvestors.com/companies/news/1072122",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 25.804545454545455
    },
    {
      "title": "Prediction: 2 Stocks That'll Be Worth More Than Apple 5 Years From Now",
      "content": "With a market capitalization of just a tad under $3 billion, Apple (AAPL -1.43%) is one of the largest companies in the world. However, its revenue growth over the past few years has been modest, while much of its stock gains have come from multiple expansions, as its price-to-earnings (P/E) ratio has been increasing.",
      "source": "fool.com",
      "rawDate": "2025-06-18 03:45:00",
      "date": "18/06/2025",
      "time": "03:45",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/18/prediction-stocks-worth-more-than-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 24.00732323232323
    },
    {
      "title": "Not expecting the Fed to cut rates this year, says Morgan Stanley's Andrew Sheets",
      "content": "Andrew Sheets, Morgan Stanley global head of corporate credit research, joins 'Squawk Box' to discuss the latest market trends, state of the economy, what to expect from inflation data this week, the Fed's rate path outlook, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-09 07:05:38",
      "date": "09/06/2025",
      "time": "07:05",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=PhYDKm7tBhU",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 23.104545454545455
    },
    {
      "title": "Fed's Barkin on Path for Economy Amid Tariff Uncertainty",
      "content": "Federal Reserve Bank of Richmond President Tom Barkin discusses the outlook for the US economy and current business and consumer sentiment with Matt Miller, Katie Greifeld and Mike McKee on \"Bloomberg Open Interest.\" Sign up for the Economics Daily newsletter to discover what's driving the global economy and what it means for policy makers, businesses, investors and you: https://bloom.bg/4535pfS -------- More on Bloomberg Television and Markets Like this video?",
      "source": "youtube.com",
      "rawDate": "2025-05-27 10:19:19",
      "date": "27/05/2025",
      "time": "10:19",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=69IwJfAWRaU",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.988636363636363
    },
    {
      "title": "Apple: Quiet After WWDC",
      "content": "Apple is lagging on its AI strategy, and funds are most likely rotating capital elsewhere in the Mag 7 group. Momentum is clearly not on Apple's side post WWDC 2025. That said, I'm projecting upside for Q2 earnings after a strong 15% jump in global iPhone sales during April and May. I'm also keeping a close eye on the upcoming iPhone 17 launch. If it beats expectations, I believe sentiment will improve quickly and the share price will reflect it.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-18 15:03:15",
      "date": "18/06/2025",
      "time": "15:03",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795775-apple-quiet-after-wwdc",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.946969696969695
    },
    {
      "title": "War Interrupts Irrational Exuberance And There's More Bad News Coming",
      "content": "The Iran and Israel conflict is threatening to expand and cause an energy shock that is inflationary and can disrupt global credit. President Trump's tariff wildcard could further disrupt supply chains and add to a potential \"mini-stagflation\" scenario.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-16 05:28:42",
      "date": "16/06/2025",
      "time": "05:28",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4795086-war-interrupts-irrational-exuberance-more-bad-news-coming",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 22.79368686868687
    },
    {
      "title": "Apple finally got good news about the iPhone this week",
      "content": "The iPhone 16 was the best-selling smartphone globally in Q1 2025, Counterpoint Research reported. Despite topping sales, Apple's iPhone revenue missed fiscal Q1 targets, an analyst said.",
      "source": "businessinsider.com",
      "rawDate": "2025-05-29 17:48:03",
      "date": "29/05/2025",
      "time": "17:48",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.businessinsider.com/apple-dominates-the-global-best-selling-smartphones-list-2025-5",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 21.15580808080808
    },
    {
      "title": "Stock Market This Week: AAPL WWDC 2025, META Scale AI Investment, ORCL Rallies",
      "content": "Markets closed in the red after geopolitical tensions between Iran and Israel swelled on Friday. Apple (AAPL) struggled in the Mag 7 after its Worldwide Developers Conference largely disappointed investors.",
      "source": "youtube.com",
      "rawDate": "2025-06-13 17:00:29",
      "date": "13/06/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Txu28F-sL0M",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.435858585858586
    },
    {
      "title": "If I Could Only Buy 2 Dividend Stocks: June's Top Picks For Global Diversification",
      "content": "I added Allianz and LVMH to The Dividend Income Accelerator Portfolio for their blend of dividend yield, growth, and financial strength. Both companies offer strong dividend growth potential—Allianz with a Dividend Yield [FWD] of 4.31%, and LVMH with a Dividend Yield [FWD] of 3.19%—plus robust long-term growth prospects. These additions improve our portfolio's potential risk-adjusted returns, valuation, and global diversification, aligning with our strategy of balancing income and growth.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-20 14:00:00",
      "date": "20/06/2025",
      "time": "14:00",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4796006-if-i-could-only-buy-2-dividend-stocks-junes-top-picks-for-global-diversification",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 20.354292929292928
    },
    {
      "title": "Wall Street's focus has shifted from tariffs to geopolitics",
      "content": "For several weeks, Wall Street was keeping a close eye on every move made by trade negotiators. Now, the focus is on increasing geopolitical tensions, WisdomTree Global chief investment officer Jeremy Schwartz says.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 14:32:32",
      "date": "20/06/2025",
      "time": "14:32",
      "category": "companies",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=ddLxKOQFkPc",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.88510101010101
    },
    {
      "title": "The Biggest Bully in Town: The Bond Market!",
      "content": "A warning sign we have been observing at 3EDGE is the rise in global long bond yields – the interest rates investors demand to buy bonds with a maturity of 20 years or more. In this video, Fritz Folts, 3EDGE Chief Investment Strategist, and Steve Cucchiaro, CEO/CIO, discuss: The sharp increase in U.S.",
      "source": "etftrends.com",
      "rawDate": "2025-06-17 18:32:30",
      "date": "17/06/2025",
      "time": "18:32",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.etftrends.com/etf-strategist-channel/biggest-bully-town-bond-market/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.141919191919193
    },
    {
      "title": "Apple says its App Store helped generate $1.3T in billings and sales, most without a commission",
      "content": "Ahead of its Worldwide Developer Conference on June 9, Apple on Thursday offered a new update on its global App Store business, sharing that developers generated $1.3 trillion in billings and sales in 2024. The company stressed that 90% of those billings and sales did not involve paying Apple a commission.",
      "source": "techcrunch.com",
      "rawDate": "2025-06-05 09:52:41",
      "date": "05/06/2025",
      "time": "09:52",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://techcrunch.com/2025/06/05/apple-says-its-app-store-helped-generate-1-3t-in-billings-and-sales-most-without-a-commission/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.231565656565657
    },
    {
      "title": "Prediction: This Unstoppable Stock Will Be the World's First $5 Trillion Company. (Hint: It's Not Apple.",
      "content": "While Apple historically wins the race to various valuation milestones, I think a different company will beat it to the punch to the $5 trillion level, and no, it isn't Microsoft either. I believe that Nvidia (NVDA 0.51%) will win this race, and thanks to its unwavering growth, it will leave both of these two in the dust in the march toward $5 trillion.",
      "source": "fool.com",
      "rawDate": "2025-06-05 06:15:00",
      "date": "05/06/2025",
      "time": "06:15",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/05/prediction-this-unstoppable-stock-will-be-the-worl/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 17.98611111111111
    },
    {
      "title": "Energy Intelligence: Conflict escalation could pressure global energy markets",
      "content": "Alex Schindelar, President of Energy Intelligence, discusses what to watch out for in the midst of Israel-Iran conflict, and he says the closure of the Straits of Hormuz would be the biggest disruption to the world.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 03:16:42",
      "date": "16/06/2025",
      "time": "03:16",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=Dgc8sUL3Vb0",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.930555555555557
    },
    {
      "title": "Warren Buffett's AI Bets: 22% of Berkshire Hathaway's $282 Billion Stock Portfolio Is in These 2 Artificial Intelligence Stocks",
      "content": "At the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway's CEO. Buffett has built an incredible track record of success since taking over the business in 1965 and using it as the foundation for an investment conglomerate that would go on to become one of the world's largest and most successful companies.",
      "source": "fool.com",
      "rawDate": "2025-06-08 07:30:00",
      "date": "08/06/2025",
      "time": "07:30",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/08/warren-buffetts-ai-bets-22-of-berkshire-hathaways/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.922222222222224
    },
    {
      "title": "Fallout From the Fed Decision | Real Yield 6/20/2025",
      "content": "Sonali Basak highlights the market-moving news you need to know. Today's guests: Columbia Threadneedle Global Rates Strategist Ed Al-Hussainy, Guggenheim Fixed Income CIO Steven Brown, BNP Paribas Head of US Credit Strategy Meghan Robson, and PIMCO Portfolio Manager of Multi-Sector Credit Sonali Pier.",
      "source": "youtube.com",
      "rawDate": "2025-06-20 15:15:13",
      "date": "20/06/2025",
      "time": "15:15",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=0L_efU1-MSA",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.414646464646466
    },
    {
      "title": "Asia credit remains resilient with limited direct exposure to tariffs: JP Morgan",
      "content": "Soo Chong Lim of JP Morgan joins Squawk Box Asia to discuss the recovery in Asia's credit market amid the global trade war, the outlook for U.S. Treasuries, and more.",
      "source": "youtube.com",
      "rawDate": "2025-06-02 00:36:01",
      "date": "02/06/2025",
      "time": "00:36",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=HsiImww_Tt0",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.385353535353534
    },
    {
      "title": "Jobless claims jump to 5-week high — but not because layoffs are rising",
      "content": "Several months after the Trump White House triggered the biggest global trade wars in decades, there's little sign U.S. businesses are laying off more workers and preparing for bad times.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-29 08:54:00",
      "date": "29/05/2025",
      "time": "08:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.marketwatch.com/story/jobless-claims-jump-to-5-week-high-but-not-because-layoffs-are-rising-a7891a22",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.170959595959594
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Will Be Worth More Than Apple By the End of 2025",
      "content": "So far, Apple's (AAPL 0.83%) efforts in artificial intelligence (AI) have underwhelmed investors, and it's fair to say that no one thinks it's taking the world by storm with this particular technology. Its Apple Intelligence initiatives are not getting nearly the buzz that competitors' products are receiving, and it seems that its other AI-related products (advanced AI chips, for example) are still in development or getting little fanfare.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:20:00",
      "date": "04/06/2025",
      "time": "04:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/04/predict-artificial-intelligence-ai-stock-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 16.730555555555554
    },
    {
      "title": "Polsinelli's Deanna Okun: We tell our clients to ignore the noise around tariffs, look at details",
      "content": "Deanna Okun, former U.S. International Trade Commission commissioner and chair, and Jon Cowley, Baker McKenzie partner, join CNBC's 'Squawk on the Street' to discuss how lawyers are advising corporate clients on how to navigate tariffs, how companies are positioning, and more.",
      "source": "youtube.com",
      "rawDate": "2025-05-27 11:13:01",
      "date": "27/05/2025",
      "time": "11:13",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=hNv4CSDUyQM",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 16.208838383838383
    },
    {
      "title": "United Parcel Service, Inc. (NYSE:UPS) Overview and Financial Analysis",
      "content": "<ul>\n<li>Andrew Steinerman from J.P. Morgan set a price target of <strong>$47</strong> for <a href=\"https://site.financialmodelingprep.com/financial-summary/UPS\">NYSE:UPS</a>, significantly lower than its current price of <strong>$99.37</strong>, suggesting potential overvaluation.</li>\n<li>UPS remains attractive for dividend-seeking investors, thanks to its substantial free cash flows and significant dividend payouts.</li>\n<li>The company's market capitalization is approximately <strong>$84.14 billion</strong>, with a trading volume of <strong>2,690,937</strong> shares, indicating strong investor interest despite market volatility.</li>\n</ul>\n\n<p>United Parcel Service, Inc. (<a href=\"https://site.financialmodelingprep.com/financial-summary/UPS\">NYSE:UPS</a>) is a global leader in logistics and package delivery services. The company operates in over 220 countries and territories, providing a wide range of services including transportation, distribution, and supply chain management. UPS competes with other major players in the logistics industry, such as FedEx and DHL.</p>\n\n<p>On June 20, 2025, Andrew Steinerman from J.P. Morgan set a price target of <strong>$47</strong> for UPS. At that time, the stock price was <strong>$99.37</strong>, indicating a significant difference from the target. The current price is approximately <strong>52.7%</strong> higher than the target, suggesting a potential overvaluation according to Steinerman's analysis.</p>\n\n<p>Despite this, UPS remains attractive to investors, especially those seeking dividend-yielding stocks. In times of market turbulence, investors often prefer companies with substantial free cash flows that offer significant dividend payouts. UPS fits this profile, making it appealing for stable returns amidst market volatility.</p>\n\n<p>The current stock price of UPS is <strong>$99.37</strong>, reflecting a slight increase of <strong>0.16%</strong> or <strong>$0.16</strong>. Today, the stock has fluctuated between a low of <strong>$99.12</strong> and a high of <strong>$100.50</strong>. Over the past year, UPS has seen a high of <strong>$148.15</strong> and a low of <strong>$90.55</strong>, showcasing its volatility in the market.</p>\n\n<p>UPS's market capitalization stands at approximately <strong>$84.14 billion</strong>, indicating its substantial size in the industry. Today's trading volume for UPS is <strong>2,690,937</strong> shares on the NYSE, reflecting active investor interest. Despite the price target set by J.P. Morgan, UPS continues to be a significant player in the logistics sector.</p>",
      "source": "Financial Modeling Prep",
      "rawDate": "2025-06-20 17:00:10",
      "date": "20/06/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://financialmodelingprep.com/market-news/united-parcel-service-ups-financial-overview-analysis",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "fmp_articles",
      "importance_score": 16.12121212121212
    },
    {
      "title": "The U.S. court ruling that invalidated almost all of Trump's tariffs has sowed fresh confusion. But the bottom line, say experts, is that the global trade war is far from over.",
      "content": "Trade experts say the president is unlikely to abandon levies as the principal tool in his quest to rewrite the rules of global commerce.",
      "source": "wsj.com",
      "rawDate": "2025-05-29 07:49:00",
      "date": "29/05/2025",
      "time": "07:49",
      "category": "companies",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.wsj.com/economy/trade/tariff-ruling-is-a-setback-for-trump-but-doesnt-end-trade-war-b1e83c73",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.880555555555556
    },
    {
      "title": "Apple sued by shareholdrs, accues of lying about AI progress — causing iPhone sales, stock to slump",
      "content": "Shareholders said the truth began to emerge on March 7 when Apple delayed some Siri upgrades to 2026, and continued through this year's Worldwide Developers Conference when Apple's assessment of its AI progress disappointed analysts.",
      "source": "nypost.com",
      "rawDate": "2025-06-20 18:36:39",
      "date": "20/06/2025",
      "time": "18:36",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://nypost.com/2025/06/20/business/apple-sued-by-shareholders-for-allegedly-overstating-ai-progress/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.647222222222222
    },
    {
      "title": "Apple iPhone Shipment Could Decline In 2025 As Tariff, Competition Play Spoil Sport: IDC",
      "content": "International Data Corporation (IDC) Worldwide Quarterly Mobile Phone Tracker expects global smartphone shipments to grow 0.6% year over year to 1.24 billion in 2025.",
      "source": "benzinga.com",
      "rawDate": "2025-05-29 14:49:55",
      "date": "29/05/2025",
      "time": "14:49",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.benzinga.com/media/25/05/45679204/apple-iphone-shipment-could-decline-in-2025-as-tariff-competition-play-spoil-sport-idc",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "energy",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.627777777777776
    },
    {
      "title": "Tech could be a safe haven amid geopolitical uncertainty, say ETF experts",
      "content": "Dan Ives, Wedbush Securities global head of technology research, and Todd Rosenbluth, VettaFi director of research, join CNBC's Dom Chu on ETF Edge to debate where the tech trade goes amid the geopolitical uncertainty and if there are areas of the market sheltered from the changing situation.",
      "source": "youtube.com",
      "rawDate": "2025-06-16 17:58:51",
      "date": "16/06/2025",
      "time": "17:58",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=voUD_HKtggU",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.5260101010101
    },
    {
      "title": "Trump tariffs can stay in place for now - as president rages at 'country threatening decision'",
      "content": "A federal appeals court has ruled that Donald Trump's sweeping international tariffs can remain in place for now, a day after three judges ruled the president exceeded his authority.",
      "source": "news.sky.com",
      "rawDate": "2025-05-29 21:36:35",
      "date": "29/05/2025",
      "time": "21:36",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://news.sky.com/story/federal-judges-rule-trump-tariffs-can-stay-in-place-for-now-as-president-rages-at-trade-courts-country-threatening-decision-13376709",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.354040404040404
    },
    {
      "title": "Trump Vs. Apple: We Know How This One Ends (Rating Upgrade)",
      "content": "I think Apple Inc. stock dips are buying opportunities, and Friday's pullback is a chance to reload, not panic-sell. I don't think Apple's global supply chain can be replicated in the U.S. overnight, and I think uncertainty should subside in the near term. AAPL stock's valuation is attractive: the forward P/E has compressed, and risk is already priced in compared to the Mag 7.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-27 13:15:00",
      "date": "27/05/2025",
      "time": "13:15",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4790137-trump-vs-apple-we-know-how-this-one-ends-rating-upgrade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.840656565656564
    },
    {
      "title": "Consumer confidence improves, but there's still risks",
      "content": "Consumer confidence unexpectedly jumped to 98 in May, well above forecasts of 87.1, The Conference Board reports. Eric Winograd, AllianceBernstein chief economist, joins Catalysts host Julie Hyman and ProShares global investment strategist Simeon Hyman to explain how this surprise reading contrasts with weaker trends in other surveys.",
      "source": "youtube.com",
      "rawDate": "2025-05-27 11:13:17",
      "date": "27/05/2025",
      "time": "11:13",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=salgb2Rg5Kc",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.539393939393939
    },
    {
      "title": "Tariffs And Free Trade By Wade",
      "content": "Tariffs and trade have dominated the media headlines since the beginning of the year, creating a volatile rollercoaster ride in the financial markets and the broader economy. Just this week, a federal court ruled that the president's tariff policies were illegal, citing misuse of emergency powers under the International Emergency Economic Powers Act of 1977.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-03 03:15:00",
      "date": "03/06/2025",
      "time": "03:15",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4791874-tariffs-free-trade-by-wade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.409090909090908
    },
    {
      "title": "How To Earn $500 A Month From Apple Stock",
      "content": "Apple Inc. AAPL shares closed lower on Wednesday as investors continued to digest announcements from this week's Worldwide Developers Conference.",
      "source": "benzinga.com",
      "rawDate": "2025-06-12 08:20:03",
      "date": "12/06/2025",
      "time": "08:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.benzinga.com/trading-ideas/dividends/25/06/45902340/how-to-earn-500-a-month-from-apple-stock-7",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.14520202020202
    }
  ],
  "events": [
    {
      "title": "Fed Bank Stress Test Results",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q2)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Jun)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Hammack Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Spending MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index YoY (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Personal Income MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core PCE Price Index MoM (May)",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Williams Speech",
      "date": "27/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Jun/25)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Kansas Fed Composite Index (Jun)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Kansas Fed Manufacturing Index (Jun)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Hammack Speech",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Jefferson Capital, Inc. / DE (JCAP)",
      "date": "26/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "15.00 - 17.00",
      "marketCap": 195500000,
      "status": "Expected"
    },
    {
      "title": "IPO: A Tie Co Ltd (369A.T)",
      "date": "25/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Kandal M Venture Limited (FMFC)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "4 - 4.45",
      "marketCap": 8000000,
      "status": "Priced"
    },
    {
      "title": "IPO: Caocao Inc (2643.HK)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "HKSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Sambhv Steel Tubes Ltd (SMBV.BO)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "BSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: X J Electrics Co Ltd (2619.HK)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "HKSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Sambhv Steel Tubes Ltd (SMBV.NS)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Arisinfra Solutions Ltd (ARIR.BO)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "BSE",
      "priceRange": "210.00 - 222.00",
      "marketCap": 5000000000,
      "status": "Priced"
    },
    {
      "title": "IPO: Arisinfra Solutions Ltd (ARIR.NS)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NSE",
      "priceRange": "210.00 - 222.00",
      "marketCap": 5000000000,
      "status": "Priced"
    },
    {
      "title": "IPO: Kitazato Corp (368A.T)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Armada Acquisition Corp. I (AACIW)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Cartesian Growth Corporation III Warrant (CGCTW)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Cartesian Growth Corporation III (CGCT)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Armada Acquisition Corp. I (AACI)",
      "date": "24/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLST)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Republic Digital Acquisition Company Class A Ordinary Shares (RDAG)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BINT)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: CID HoldCo, Inc. Warrants (DAICW)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLGR)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BDBT)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Gores Holdings X, Inc. (GTEN)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lakeshore Acquisition III Corp. (LCCC)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Gores Holdings X, Inc. Warrants (GTENW)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lakeshore Acquisition III Corp. Rights (LCCCR)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Cal Redwood Acquisition Corp. Class A Ordinary Shares (CRAQ)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Cal Redwood Acquisition Corp. Right (CRAQR)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Primo Global Holdings Co (367A.T)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLTD)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLUC)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLUI)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Exchange Traded Concepts Trust (BLUX)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Republic Digital Acquisition Company Warrants (RDAGW)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Brand Value ETF (BVAL)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: CID HoldCo, Inc. Common Stock (DAIC)",
      "date": "23/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Wellness Comm Corp (366A.T)",
      "date": "22/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "JPX",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Zhejiang Sanhua Intelligent Controls Co. Ltd (2050.HK)",
      "date": "22/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "HKSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Transthera Sciences Inc (2617.HK)",
      "date": "22/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "HKSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "IPO: Bayzed Health Group Inc (2609.HK)",
      "date": "22/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "HKSE",
      "priceRange": null,
      "marketCap": null,
      "status": "Priced"
    },
    {
      "title": "M&A: MetroCity Bankshares, Inc. acquires First IC Corporation",
      "date": "23/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1747068/000110465925052461/tm2515540-2_s4.htm",
      "symbol": "MCBS",
      "targetedSymbol": "FIEB"
    },
    {
      "title": "M&A: RadNet, Inc. acquires iCAD, Inc.",
      "date": "06/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790526/000168316825003180/radnet_s4.htm",
      "symbol": "RDNT",
      "targetedSymbol": "ICAD"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Mr. Cooper Group Inc.",
      "date": "29/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925041422/tm2513302-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "COOP"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKKQ",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNK",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKPF",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "21/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925036921/alms-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO-PA",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APOS",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Redfin Corporation",
      "date": "07/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925032694/tm2511408-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "RDFN"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: FLYEXCLUSIVE INC. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZW",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZ",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires Vyome",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "RSLS",
      "targetedSymbol": "HIND"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    }
  ]
}