{
  "lastUpdated": "2025-04-05T20:15:54.690902",
  "us": [
    {
      "title": "Fed rate cuts could ward off a serious recession, Jim Cramer says",
      "content": "CNBC's Jim Cramer analyzed Wednesday's market action, saying new economic data could pave the way for the Federal Reserve to cut interest rates. \"We're most likely not going to go into a serious recession, because the Fed can take action to prevent that,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-03-12 18:51:56",
      "date": "12/03/2025",
      "time": "18:51",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/12/fed-rate-cuts-recession-jim-cramer.html",
      "themes": {
        "macroeconomics": [
          "recession",
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 57.7030303030303
    },
    {
      "title": "5 Things to Know Before the Stock Market Opens on Wednesday",
      "content": "Close U.S. stock futures are pointing lower as investors ready for today's tariffs announcement expected from President Donald Trump after markets close; Tesla (TSLA) is slated to report first-quarter deliveries amid a downturn for its stock; Visa (V) reportedly is offering a payment of roughly $100 million to get Apple's (AAPL) credit card payment network business; and USDC stablecoin issuer Circle files for an IPO. Here's what investors need to know today. 1. US Stock Futures Dip as Investors Await Tariffs Updates U.S. stock futures are pointing lower following a volatile trading session as investors await White House tariff plans expected to be announced later today. Market watchers are also following today's private sector payrolls release ahead of Friday's job report. Nasdaq futures are 0.8% lower after the tech-focused index gained 0.9% Tuesday. Dow Jones Industrial Average and S&P 500 futures are lower by about 0.5%. Bitcoin (BTCUSD) is down slightly at around $85,000. The yield on the 10-year Treasury note is down below 4.15%. Oil futures are down. Gold futures are slightly higher. 2. Investors Brace for Trump Tariffs Announcement After Markets Close President Donald Trump is set to unveil his latest tariffs proposal at a White House event slated to start at the close of markets at 4 p.m. ET. Trump's advisers continue to hash out the details surrounding the new tariffs he plans to implement ahead of the \"Liberation Day\" event, Bloomberg reported. While Trump has said he was seeking reciprocal tariffs to match import taxes on U.S.-made products, a report in The Washington Post indicated that advisers were also mulling a 20% tariff on nearly all imported products. 3. Tesla Stock Slips Ahead of Quarterly Deliveries Data Tesla (TSLA) shares are down 2.5% in premarket trading ahead of the electric vehicle maker's expected release of its first-quarter deliveries data this morning. Analysts expect Tesla to report 393,000 deliveries, up less than 2% year-over-year but fewer than last quarter's 495,570 vehicles. The data comes as analysts have raised concerns that CEO Elon Musk's work with the Trump administration is creating distractions and impacting Tesla's business. Tesla shares have shed one-third of their value in 2025. 4. Visa Offers Apple $100M to Take Over Credit Card Network, Report Says Visa (V) is offering a payment of roughly $100 million to get Apple's (AAPL) credit card network business, according to The Wall Street Journal. The report said that Apple would select a payment provider before selecting a bank to take over its credit card from Goldman Sachs (GS), and that Visa is competing with Mastercard (MA)—which is \"fiercely trying to keep its role as the network on this card\"—and American Express (AXP). The Journal previously reported that JPMorgan Chase (JPM), Synchrony Financial (SYF), Capital One (COF) and American Express were in the running to take over as the issuer of the credit card. 5. USDC Stablecoin Issuer Circle Files for IPO Circle, the company behind the dollar-backed USDC stablecoin, has filed for a U.S. initial public offering (IPO). In its prospectus filed with the Securities and Exchange Commission (SEC), Circle said it plans to list on the New York Stock Exchange (NYSE) under ticker symbol \"CRCL.\" Circle, which had previously announced plans to go public in 2021 via a SPAC merger, said its 2024 net income was $155.7 million, down from $267.6 million a year earlier. Do you have a news tip for Investopedia reporters? Please email us at tips@investopedia.com",
      "source": "https://www.investopedia.com",
      "rawDate": "2025-04-02 11:11:43",
      "date": "02/04/2025",
      "time": "11:11",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-april-02-2025-11707430",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 56.78787878787879
    },
    {
      "title": "Live Nasdaq Composite: NVDA, TSLA Rise as Markets Lick Wounds",
      "content": "The markets are recovering from yesterday&#8217;s massive sell-off by starting today as a mixed bag. After the worst performances from the Nasdaq Composite and S&amp;P 500 in several years, both indexes are showing fractional movement in either direction while the Dow Jones Industrial Average slides a bit further. Wall Street&#8217;s AI darling and a Mag 7 stock Nvidia (Nasdaq: NVDA) is helping sentiment today, rising 2.6% at last check and lifting some of its tech peers. NVDA stock as well as Broadcom (Nasdaq: AVGO) were helped by analysts at Bernstein, who reiterated their &#8220;outperform&#8221; ratings on both stocks, advising investors to pounce on any dip. Tesla (Nasdaq: TSLA) shares are also popping with a 3.6% gain after yesterday&#8217;s double-digit-percentage drop. President Trump has come out swinging against Tesla boycotters, announcing he would be buying an EV for himself in support of Elon Musk, whose net worth was slashed by $29 billion in yesterday&#8217;s market sell-off. Morgan Stanley analysts have reiterated their overweight rating on Tesla stock, calling the pullback in the stock a &#8220;buying opportunity.&#8221; With the exception of Apple (Nasdaq: AAPL) stock, which is falling about 2%, each of the Mag 7 stocks started the day in the green. Southwest Airlines (NYSE: LUV) is gaining 2.5% on the day after revealing it would begin charging customers for checked bags in a first for the airline. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 303.11 (-0.74%) Nasdaq Composite: Up 23.62 (+0.11%) S&amp;P 500: Down 20.02 (-0.34%) Key Points The markets are licking their wounds after yesterday&#8217;s historic sell-off. Nvidia&#8217;s gains are lifting tech boats. Tesla is also recovering with gains after a Wall Street endorsement. Market Movers Meta Platforms (Nasdaq: META) is testing an in-house chip for AI systems, sending the stock about 2% higher on the day. Netflix (Nasdaq: NFLX) is gaining 2.6% on the day after growing subscribers by 24 million in H2 2024. Kohl&#8217;s (NYSE: KSS) stock is among the biggest losers today, falling over 16% on a disappointing profit and revenue outlook. Athletic apparel company Nike (NYSE: NKE) stock is falling 2% today despite a positive analyst note. Barclays analysts consider NKE stock an &#8220;equal weight&#8221; rating, saying that the &#8220;fundamental bottom&#8221; is near. Nike reports its quarterly results later this month. The post Live Nasdaq Composite: NVDA, TSLA Rise as Markets Lick Wounds appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-03-12 12:32:23",
      "date": "12/03/2025",
      "time": "12:32",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/market-news/2025/03/11/live-nasdaq-composite-nvda-tsla-rise-as-markets-lick-wounds/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.84848484848485
    },
    {
      "title": "U.S. households are running out of emergency funds as pandemic cash runs out, inflation takes its toll",
      "content": "The latest survey from the New York Federal Reserve shows just 62.7% of Americans can come up with $2,000 for an emergency.",
      "source": "cnbc.com",
      "rawDate": "2025-03-20 12:12:58",
      "date": "20/03/2025",
      "time": "12:12",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/20/us-households-are-running-out-of-emergency-funds-as-pandemic-cash-runs-out-inflation-takes-its-toll.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 43.34166666666667
    },
    {
      "title": "CNBC Daily Open: The effect of Trump policies will sway Fed's interest rate moves",
      "content": "U.S. President Donald Trump's policies to reshape the U.S. and its economy are so drastic that the Federal Reserve is taking note.",
      "source": "cnbc.com",
      "rawDate": "2025-03-09 21:22:56",
      "date": "09/03/2025",
      "time": "21:22",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/10/cnbc-daily-open-trump-policies-will-sway-feds-interest-rate-moves.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.81565656565657
    },
    {
      "title": "Summers on Recession Risks, Inflation, Trade War, Tariffs, Fed Outlook",
      "content": "Former US Treasury Secretary and Bloomberg Wall Street Week contributor Lawrence H. Summers talks about the risk of a recession in the US this year, President Donald Trump's trade war and the impact on the economy and the manufacturing sector.",
      "source": "youtube.com",
      "rawDate": "2025-03-11 11:28:59",
      "date": "11/03/2025",
      "time": "11:28",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=a1c9zbh5HqI",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession",
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.79621212121212
    },
    {
      "title": "Why Apple's stock is leading the ‘Magnificent Seven' toward a $1 trillion wipeout",
      "content": "Technology stocks are under pressure Thursday, but some members of the “Magnificent Seven” are getting punished more than others as the group collectively tracks toward a $1 trillion loss of market capitalization.",
      "source": "marketwatch.com",
      "rawDate": "2025-04-03 11:37:00",
      "date": "03/04/2025",
      "time": "11:37",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/why-apples-stock-is-leading-the-magnificent-seven-toward-a-1-trillion-wipeout-7fc6d2ce",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.54621212121212
    },
    {
      "title": "Dot Plot, Inflation Expectations: What to Watch in FOMC Announcement",
      "content": "Ahead of the Fed's latest interest rate decision, Kevin Green maps out a watch list for investors to look for in the central bank's comments and Jerome Powell's speech. He points to the Trump administration's tariff policy as a potential talking point, as the Fed may be wary to cut too soon.",
      "source": "youtube.com",
      "rawDate": "2025-03-19 08:35:48",
      "date": "19/03/2025",
      "time": "08:35",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=QD8wD3AntMo",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.37171717171717
    },
    {
      "title": "Fed's Powell warns tariffs fallout likely ‘significantly larger than expected'",
      "content": "Federal Reserve Chair Jerome Powell issued a stark warning on Friday, stating that the economic impact of recently announced tariffs would likely be larger than expected, fueling inflationary pressures and slowing economic growth. “Higher tariffs will be working their way through our economy and are likely to raise inflation in incoming quarters,” Powell said.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-04-04 12:20:02",
      "date": "04/04/2025",
      "time": "12:20",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.proactiveinvestors.com/companies/news/1069165",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.36919191919192
    },
    {
      "title": "Trump tells NBC he 'couldn't care less' if car makers hike prices due to tariffs",
      "content": "U.S. President Donald Trump said on Saturday he did not warn car industry executives against raising prices as tariffs on foreign-made autos come into force, telling NBC News he \"couldn't care less\" if they do.",
      "source": "reuters.com",
      "rawDate": "2025-03-29 20:06:12",
      "date": "29/03/2025",
      "time": "20:06",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/world/us/trump-tells-nbc-he-couldnt-care-less-if-car-makers-hike-prices-due-tariffs-2025-03-30/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.00757575757576
    },
    {
      "title": "Hedge funds cut risk in stocks at largest amount in two years, Goldman Sachs says",
      "content": "Hedge funds reduced their exposure to stocks on Friday at the largest amount in more than two years, according to a Goldman Sachs note released on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-03-10 16:36:46",
      "date": "10/03/2025",
      "time": "16:36",
      "category": "markets",
      "impact": "negative",
      "country": "us",
      "url": "https://www.reuters.com/markets/wealth/hedge-funds-cut-risk-stocks-largest-amount-two-years-goldman-sachs-says-2025-03-10/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.88232323232323
    },
    {
      "title": "Mag 7 relinquishes more than $800 billion as tech drives stock market nosedive",
      "content": "As a whole, Magnificent Seven stocks were on pace to drop more than $800 billion in market cap. That reflects how tech stocks have led the broader market amid Thursday's steep sell-off.",
      "source": "cnbc.com",
      "rawDate": "2025-04-03 13:36:07",
      "date": "03/04/2025",
      "time": "13:36",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/04/03/mag-7-relinquishes-more-than-800-billion-as-tech-drives-stock-market-nosedive.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.87752525252525
    },
    {
      "title": "Apple's stock may see its worst day since since 2022. Here are 2 major worries.",
      "content": "Investors are concerned about delayed AI features and the looming threat of tariffs.",
      "source": "marketwatch.com",
      "rawDate": "2025-03-10 14:02:00",
      "date": "10/03/2025",
      "time": "14:02",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-may-see-its-worst-day-since-since-2022-here-are-2-major-worries-42fe0edb",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.627272727272725
    },
    {
      "title": "Meet the 'Dirty 15' countries that could be hit hardest by Trump's tariffs",
      "content": "Trump is set to launch \"reciprocal tariffs\" against all other countries that have their own duties on U.S. goods or other trade barriers. Treasury Secretary Scott Bessent has singled out what he called the \"Dirty 15\" — the 15% of countries that trade heavily with the U.S. and have high tariffs.",
      "source": "cnbc.com",
      "rawDate": "2025-03-31 15:25:28",
      "date": "31/03/2025",
      "time": "15:25",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/31/trump-tariffs-dirty-15-reciprocal-retaliation.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.561868686868685
    },
    {
      "title": "Apple leads drop in tech stocks after Trump tariff announcement",
      "content": "Tech stocks fell in late trading on Wednesday after President Trump announced new tariffs of between 10% and 49% on imported goods. Apple had the largest drop among technology companies, falling nearly 6% in extended trading.",
      "source": "cnbc.com",
      "rawDate": "2025-04-02 17:18:06",
      "date": "02/04/2025",
      "time": "17:18",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/04/02/-apple-leads-drop-in-tech-stocks-after-trump-tariff-announcement.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.53409090909091
    },
    {
      "title": "Qualcomm: A \"Buy\" Despite The Risk Of Losing Apple",
      "content": "Qualcomm's diversification into Automotive and IoT segments shows high growth potential, mitigating risks from potential revenue loss due to Apple's in-house modem development. Q1 2025 results show strong performance with 17.5% revenue growth and 15% EPS growth, beating expectations and outperforming the S&P 500. Despite potential revenue loss from Apple, Qualcomm's growth in Automotive, IoT, and PC markets, along with share buybacks, supports a positive long-term outlook.",
      "source": "seekingalpha.com",
      "rawDate": "2025-03-18 10:30:36",
      "date": "18/03/2025",
      "time": "10:30",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4768425-qualcomm-a-buy-despite-the-risk-of-losing-apple",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.34015151515152
    },
    {
      "title": "Inflation rate hits 2.8% in February, less than expected",
      "content": "The consumer price index was expected to increase 0.3% in February and 3.2% from a year ago.",
      "source": "cnbc.com",
      "rawDate": "2025-03-12 08:30:59",
      "date": "12/03/2025",
      "time": "08:30",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/12/cpi-inflation-report-february-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.45252525252525
    },
    {
      "title": "Before buying Apple's stock, know that chances of a tariff exemption are slim",
      "content": "The smartphone maker's supply chain is in the spotlight after President Donald Trump's tariff announcements late Wednesday. Its stock AAPL has since fallen by more than 14% as of Friday's close.",
      "source": "marketwatch.com",
      "rawDate": "2025-04-04 17:00:00",
      "date": "04/04/2025",
      "time": "17:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/before-buying-apples-stock-know-that-chances-of-a-tariff-exemption-are-slim-a58ab62e",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.37222222222222
    },
    {
      "title": "Powell sees tariffs raising inflation and says Fed will wait before further rate moves",
      "content": "Federal Reserve Chair Jerome Powell said Friday that he expects President Donald Trump's tariffs to raise inflation and lower growth, and indicated that the central bank won't move on interest rates until it gets a clearer picture on the ultimate impacts.",
      "source": "youtube.com",
      "rawDate": "2025-04-04 12:00:58",
      "date": "04/04/2025",
      "time": "12:00",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=bxvshUl2NZs",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.31439393939394
    },
    {
      "title": "Canada will react to Trump's 'attack' soon, could impose tariffs, says Carney",
      "content": "Canada will soon respond to new tariffs on imported vehicles announced by U.S. President Donald Trump and could impose retaliatory measures against the United States, Prime Minister Mark Carney said on Wednesday.",
      "source": "reuters.com",
      "rawDate": "2025-03-26 18:00:27",
      "date": "26/03/2025",
      "time": "18:00",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/americas/ontario-premier-fully-backs-canadian-tariff-response-trump-move-2025-03-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "canada"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.92222222222222
    },
    {
      "title": "3 Cheap Vanguard ETFs I’d Buy In 2025",
      "content": "Vanguard has some of the best ETFs that are known for their low expense ratios. Lower costs allow you to keep more of the profits that your ETFs generate. Vanguard offers close to 100 ETFs that give investors access to major benchmarks, popular investment strategies, and sectors. Buying Vanguard ETFs during dips can lead to meaningful profits in the long run, especially if you can hold onto your shares for many years. Another great thing about their ETFs is that you don&#8217;t have to know much about the stock market to generate positive returns. A fund manager oversees the positions to ensure they align with the ETF&#8217;s stated goals. Investors who are looking for bargains and the potential for promising long-term returns may want to consider these three Vanguard ETFs. Key Points Vanguard has some of the best ETFs with low expense ratios. Discover some of the top Vanguard ETFs to buy that can increase your wealth. Vanguard Growth Index Fund ETF (VUG) The Vanguard Growth Index Fund ETF (NYSEARCA:VUG) has historically been an outperformer. It&#8217;s up by more than 170% over the past five years while the S&amp;P 500 has rallied by 145% during the same stretch. Despite the long-term gains, VUG looks promising due to its recent dip. The ETF is in the middle of a correction and has shed approximately 8% of its value year-to-date. VUG has 180 holdings and prioritizes large-cap stocks like the Magnificent Seven. Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT), and Nvidia (NASDAQ:NVDA) are the top three holdings, and they make up more than one-third of the fund&#8217;s total assets. VUG is a tech-heavy ETF. More than half of its capital is in the sector, and this high allocation is a common theme among ETFs that outperform the stock market. Vanguard Utilities ETF (VPU) Not every investor wants to deal with high market volatility, especially as they get closer to retirement. The Vanguard Utilities ETF (NYSEARCA:VPU) can give investors positive returns without the dramatic price movements of growth stocks in the tech sector. The fund has delivered respectable returns as well. It&#8217;s up by 24% over the past year and has delivered a 64% gain over the past five years. The fund has a reasonable 0.09% expense ratio and places a strong emphasis on electric utilities. A focus on utility stocks has resulted in a lofty 30-day SEC yield of 2.85%. You can earn solid cash flow from this ETF while growing your money. Utilities are essential, and they are one of the last expenses consumers and businesses will cut. The fund also has a 20.2 P/E ratio which trails the S&amp;P 500&#8217;s 28.2 P/E ratio. Vanguard S&amp;P 500 ETF (VOO) The Vanguard S&amp;P 500 ETF (NYSEARCA:VOO) tracks the S&amp;P 500 and looks more attractive after a correction. The fund gives investors exposure to tech giants like Apple, Microsoft, and Nvidia while they are still recovering from corrections. A market rally can send these stocks soaring and reward VOO investors. However, the S&amp;P 500 isn&#8217;t just about tech stocks. Almost 70% of its total capital is allocated to sectors outside of tech. This diversification results in less volatility than the tech-heavy Nasdaq Composite. VOO has a 0.03% expense ratio and a 1.21% 30-day SEC yield. Unsurprisingly, Apple, Microsoft, and Nvidia are the top three positions. However, they only make up about 19% of the fund&#8217;s total assets. That&#8217;s less concentration than VUG. VOO is still down year-to-date, but its 146% rally over the past five years indicates the types of returns this fund can get when the stock market rebounds. The post 3 Cheap Vanguard ETFs I&#8217;d Buy In 2025 appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-03-18 10:33:30",
      "date": "18/03/2025",
      "time": "10:33",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/personal-finance/2025/03/17/3-cheap-vanguard-etfs-id-buy-in-2025/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 34.621212121212125
    },
    {
      "title": "In risky market, Wall Street wants to privatize more of your stock and bond money",
      "content": "Major banks and fund managers from JPMorgan Chase to BlackRock are creating more ETF products that tap into areas of the market typically associated with private banking and reserved for high-net-worth clients, such as private credit. Main Street investors are seeking new ways to insulate their money and grow it at the same time, which has led to more asset flows into premium income and buffered equity trading strategies in an ETF wrapper.",
      "source": "cnbc.com",
      "rawDate": "2025-03-30 09:51:29",
      "date": "30/03/2025",
      "time": "09:51",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/30/wall-street-wants-privatize-stock-bond-money-market-correction.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.68510101010101
    },
    {
      "title": "Reactions to Trump auto tariffs",
      "content": "U.S. President Donald Trump on Wednesday unveiled a 25% tariff on imported cars and light trucks starting next week, widening the upon regaining the White House this year in a move auto industry experts expect will drive up prices and stymie production.",
      "source": "reuters.com",
      "rawDate": "2025-03-26 20:01:45",
      "date": "26/03/2025",
      "time": "20:01",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/autos-transportation/reactions-trump-auto-tariffs-2025-03-27/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.64217171717172
    },
    {
      "title": "Visa bids $100 million to replace Mastercard as Apple's new credit card partner, WSJ reports",
      "content": "Visa has offered Apple roughly $100 million to take over the tech giant's credit card partnership from Mastercard , the Wall Street Journal reported on Tuesday, citing sources familiar with the matter.",
      "source": "reuters.com",
      "rawDate": "2025-04-01 18:23:28",
      "date": "01/04/2025",
      "time": "18:23",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/visa-bids-100-million-replace-mastercard-apples-new-credit-card-partner-wsj-2025-04-01/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 33.34621212121212
    },
    {
      "title": "Exclusive: EU likely to impose modest fines on Apple, Meta over DMA breaches, sources say",
      "content": "EU antitrust regulators are expected to hand out modest fines to Apple and Meta Platforms for allegedly breaching landmark rules aimed at reining in their power, people with direct knowledge of the matter said on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-03-10 13:46:25",
      "date": "10/03/2025",
      "time": "13:46",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/technology/eu-likely-impose-modest-fines-apple-meta-over-dma-breaches-sources-say-2025-03-10/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.3080808080808
    },
    {
      "title": "Exclusive: EU set to close investigation into Apple's browser options, sources say",
      "content": "EU antitrust regulators are set to close their year-long investigation into Apple's browser options on iPhones after the company made changes to comply with the requirements set out in landmark rules, people with direct knowledge of the matter said on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-03-25 07:21:30",
      "date": "25/03/2025",
      "time": "07:21",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/technology/eu-set-close-investigation-into-apples-browser-options-sources-say-2025-03-25/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.207070707070706
    },
    {
      "title": "Trump economic advisor Kevin Hassett warns of more uncertainty over tariffs",
      "content": "National Economic Council director Kevin Hassett warned of \"some uncertainty\" in the coming weeks related to President Donald Trump's tariff policies. But Hassett predicted that things will clear up when the Trump administration implements its plan to impose \"reciprocal tariffs\" next month.",
      "source": "cnbc.com",
      "rawDate": "2025-03-17 10:16:40",
      "date": "17/03/2025",
      "time": "10:16",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/03/17/trump-hassett-tariff-uncertainty-reciprocal.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.0810606060606
    },
    {
      "title": "US business equipment borrowings down more than 7% y/y in February, ELFA says",
      "content": "U.S. companies borrowed 7.4% less to finance equipment investments in February compared with the same period a year earlier, the Equipment Leasing and Finance Association (ELFA) said on Monday.",
      "source": "reuters.com",
      "rawDate": "2025-03-24 15:03:09",
      "date": "24/03/2025",
      "time": "15:03",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/markets/us/us-business-equipment-borrowings-down-more-than-7-yy-february-elfa-says-2025-03-24/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 32.86944444444444
    },
    {
      "title": "Apple preparing for a major software overhaul, Bloomberg News reports",
      "content": "Apple is preparing a major overhaul of its software, due later this year, which will change the look of the operating systems and the interface of the iPhone, iPad and Mac, Bloomberg News reported on Monday, citing people familiar with the effort.",
      "source": "reuters.com",
      "rawDate": "2025-03-10 15:17:20",
      "date": "10/03/2025",
      "time": "15:17",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/technology/apple-preparing-major-software-overhaul-bloomberg-news-reports-2025-03-10/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.777020202020196
    },
    {
      "title": "Fed will likely cut rates this year: Economist",
      "content": "The bond market is seeing rising yields, with the 10-year (^TNX) yield hitting 4.3%, partly due to a better-than-expected CPI print suggesting a slight deceleration in inflation. Tom Porcelli, PGIM Fixed Income chief US economist, joins Morning Brief hosts Brad Smith and Madison Mills to discuss the bond market's (^TYX, ^TNX, ^FVX) reaction to inflation data and recession concerns, and what this signals for the Federal Reserve's future actions.",
      "source": "youtube.com",
      "rawDate": "2025-03-12 19:59:40",
      "date": "12/03/2025",
      "time": "19:59",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=IfAfQ4eeK9M",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.63838383838384
    },
    {
      "title": "Fed's March dot plot: What FOMC members are forecasting",
      "content": "The Federal Reserve held interest rates at the central bank's March FOMC meeting on Wednesday, officials indicating they still expect two rate cuts in 2025. Yahoo Finance Senior Reporter Alexandra Canal takes a closer look at the latest dot plot, which shows Fed officials' expectations for rates throughout the year and into 2026, 2027, and beyond.",
      "source": "youtube.com",
      "rawDate": "2025-03-19 19:01:20",
      "date": "19/03/2025",
      "time": "19:01",
      "category": "economy",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=GqFH-KaIUtI",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.63611111111111
    }
  ],
  "france": [
    {
      "title": "France fines Apple €150 million over app tracking violations, EU probes follow",
      "content": "Apple has been hit with a €150 million ($162 million) fine by France’s competition authority over its App Tracking Transparency (ATT) framework, a move that adds pressure from multiple fronts as investigations in other EU countries gain traction. The penalty, announced on Monday, stems from how the iPhone maker rolled out the ATT feature, which critics argue undermines competition by limiting third-party advertising while boosting Apple’s own ad services.The fine reflects growing concern in the European Union about how dominant tech companies enforce privacy standards that may also act as commercial barriers. In Apple’s case, regulators found that ATT, introduced in 2021, unfairly impacted rival app developers and publishers by making user consent harder for third parties to obtain.ATT rollout triggers EU probesFrench regulators said Apple’s ATT rollout was neither necessary nor proportionate to the company’s stated goal of protecting user privacy. Although the tool asks users whether they want apps to track their activity across other apps and websites, the French Competition Authority found that the system was designed in a way that placed a heavier burden on third-party developers than on Apple itself.One major issue was the number of consent pop-ups users encountered. While third-party apps were required to display the ATT prompt, Apple’s own advertising services were integrated in a way that required less user effort to accept. Users had to opt out of ad tracking twice in Apple’s own settings, which the French watchdog said undermined the feature’s neutrality.Apple has also been ordered to publish the decision on its website for seven days, a standard measure in France for competition-related rulings.The French investigation originated from industry complaints filed in 2021. While emergency action was denied at the time, the regulator pursued a full-scale probe that has now led to financial penalties.Smaller publishers lose ad revenueIn its ruling, France’s authority emphasised the disproportionate economic impact ATT had on smaller app developers and ad service providers. These smaller players typically rely on third-party data collection for revenue generation through targeted advertising. Apple’s changes disrupted these practices, cutting off access to Apple&#8217;s Identifier for Advertisers (IDFA) if users declined consent via the ATT prompt.This restriction effectively altered the dynamics of the mobile advertising market, where Apple&#8217;s rivals found themselves operating under stricter conditions. Apple, on the other hand, retained certain capabilities for its own ads within the App Store and other services.The competition body argued that ATT&#8217;s dual opt-out process placed unnecessary hurdles in front of users and made it more likely that they would remain in Apple&#8217;s ecosystem, giving the company an edge in the mobile ad space.Investigations spread to 4 countriesThe fine is part of broader scrutiny in Europe. Competition authorities in Germany, Italy, Romania, and Poland have each launched similar investigations into ATT, reflecting concerns that Apple may be favouring its own services in ways that violate local and EU-wide competition laws.These investigations focus not only on ATT’s technical implementation but also on the market power Apple holds through its control of iOS, the App Store, and user access to device-level data.While the French authority acted independently, any eventual findings from these additional countries could fuel coordinated EU action or raise the possibility of further fines and regulatory measures.Apple’s privacy tool under fireApple introduced ATT in April 2021 as part of iOS 14.5, presenting it as a privacy-focused feature aimed at giving users control over how apps track their online behaviour. The move was widely welcomed by privacy advocates, but triggered immediate backlash from advertisers and app developers.Since the rollout, Apple’s ad business has grown significantly, driven in part by increased reliance on the App Store’s native ad network. Critics argue that Apple’s design choices favour its own ecosystem while making it harder for competitors to maintain viable advertising models.Although the ATT framework technically applies to all apps, the French Competition Authority said Apple was not held to the same standard as others when it came to gaining user consent, thus violating the principle of fair access and harming competition.The post France fines Apple €150 million over app tracking violations, EU probes follow appeared first on Invezz",
      "source": "https://invezz.com",
      "rawDate": "2025-03-31 10:35:39",
      "date": "31/03/2025",
      "time": "10:35",
      "category": "crypto",
      "impact": "negative",
      "country": "france",
      "url": "https://invezz.com/news/2025/03/31/france-fines-apple-e150-million-over-app-tracking-violations-eu-probes-follow/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 36.36363636363636
    },
    {
      "title": "French antitrust regulator fines Apple 150 million euros over privacy tool",
      "content": "France's antitrust regulator on Monday fined Apple 150 million euros ($162.36 million) for abusing its dominant position in mobile app advertising on iOS and iPadOS devices between 2021 and 2023 via a privacy control tool called ATT.",
      "source": "reuters.com",
      "rawDate": "2025-03-31 04:03:27",
      "date": "31/03/2025",
      "time": "04:03",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.reuters.com/technology/french-antitrust-regulator-fines-apple-150-million-euros-over-privacy-tool-2025-03-31/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.88964646464646
    },
    {
      "title": "Apple Fined $162 Million in France Over App Tracking Transparency",
      "content": "France's competition regulator fined Apple over concerns the company abused its dominant position in mobile apps through its iPhone and iPad's operating system.",
      "source": "wsj.com",
      "rawDate": "2025-03-31 05:30:00",
      "date": "31/03/2025",
      "time": "05:30",
      "category": "tech",
      "impact": "negative",
      "country": "france",
      "url": "https://www.wsj.com/tech/french-competition-watchdog-fines-apple-162-4-million-over-app-tracking-transparency-2cd07cdc",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 14.914141414141415
    },
    {
      "title": "France's antitrust watchdog fines Apple for problems with App Tracking Transparency",
      "content": "France's antitrust watchdog fined Apple 150 million euros ($162 million) on Monday over a privacy feature protecting users from apps snooping on them because its introduction resulted in abuse of competition law.",
      "source": "techxplore.com",
      "rawDate": "2025-03-31 06:51:28",
      "date": "31/03/2025",
      "time": "06:51",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://techxplore.com/news/2025-03-france-antitrust-watchdog-fines-apple.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 10.604040404040404
    },
    {
      "title": "France Fines Apple $162 Million, Alleging Privacy Tool Violated Competition Law",
      "content": "France's competition regulator has fined Apple 150 million euros (about $162 million), alleging that the company's App Tracking Transparency (ATT) made the use of third-party applications in the iOS environment “excessively complex.",
      "source": "pymnts.com",
      "rawDate": "2025-03-31 11:50:13",
      "date": "31/03/2025",
      "time": "11:50",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.pymnts.com/apple/2025/france-fines-apple-162-million-alleging-privacy-tool-violated-competition-law/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 10.53838383838384
    }
  ],
  "uk": [
    {
      "title": "March BoE Meeting: Balancing Inflation And Growth Risks",
      "content": "The Bank of England kept its policy rate at 4.5% in March, with an 8 to 1 vote, signaling a cautious approach to monetary easing. Inflation remains a key concern, with recent data showing higher-than-expected CPI and core inflation, complicating the BoE's disinflation efforts.",
      "source": "seekingalpha.com",
      "rawDate": "2025-03-20 11:57:30",
      "date": "20/03/2025",
      "time": "11:57",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://seekingalpha.com/article/4769111-march-boe-meeting-balancing-inflation-and-growth-risks",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.93611111111111
    },
    {
      "title": "What to Expect After an Outperforming \"Fear Gauge\"",
      "content": "The current trade war rhetoric is impossible to escape on Wall Street, and has left investors mulling over subsequential volatility from major benchmarks. Options traders have been crowding into Cboe Market Volatility Index (VIX) bets, which has sent the market's \"fear gauge\" to two 2025 records this week alone, the most recent on Friday to 26.56.",
      "source": "schaeffersresearch.com",
      "rawDate": "2025-03-11 11:54:30",
      "date": "11/03/2025",
      "time": "11:54",
      "category": "markets",
      "impact": "positive",
      "country": "uk",
      "url": "https://www.schaeffersresearch.com/content/bgs/2025/03/11/what-to-expect-after-an-outperforming-fear-gauge",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 16.98459595959596
    },
    {
      "title": "UK competition probe of mobile browsers finds Apple-Google duopoly is ‘anti-innovation'",
      "content": "A U.K. competition authority investigation of Apple and Google's mobile browsers has concluded that the mobile duopoly's policies are “holding back innovation” and could also be limiting economic growth.",
      "source": "techcrunch.com",
      "rawDate": "2025-03-12 13:59:41",
      "date": "12/03/2025",
      "time": "13:59",
      "category": "tech",
      "impact": "positive",
      "country": "uk",
      "url": "https://techcrunch.com/2025/03/12/uk-competition-probe-of-mobile-browsers-finds-apple-google-duopoly-is-anti-innovation/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 12.700252525252527
    },
    {
      "title": "S&P 500 Rises as Boeing Soars, Apple and Google Face EU Scrutiny Ahead of Fed Decision",
      "content": "Wall Street rises as S&P 500, Nasdaq, and Dow gain ahead of the Fed's decision. Tech stocks rally despite EU scrutiny on Apple and Google, while Boeing jumps 6%.",
      "source": "fxempire.com",
      "rawDate": "2025-03-19 11:20:23",
      "date": "19/03/2025",
      "time": "11:20",
      "category": "tech",
      "impact": "positive",
      "country": "uk",
      "url": "https://www.fxempire.com/forecasts/article/sp-500-rises-as-boeing-soars-apple-and-google-face-eu-scrutiny-ahead-of-fed-decision-1505456",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 12.553282828282828
    }
  ],
  "germany": [
    {
      "title": "Taiwan Semiconductor (TSM) Price Prediction and Forecast (March 2025)",
      "content": "Due to efforts to bolster U.S. domestic chip production and reduce reliance on overseas supply chains, Taiwan Semiconductor Manufacturing Co. Ltd. (NYSE: TSM), AKA TSMC, plans to drastically increase its investment in U.S. semiconductor manufacturing, including new fabrication plants and advanced packaging facilities in Arizona. 24/7 Wall St. Key Points: Taiwan Semiconductor Manufacturing Co. Ltd. (NYSE: TSM) holds a crucial place in the semiconductor supply chain, commanding over 60% of global spending at chip foundries. Its ability to deliver cutting-edge manufacturing capabilities is essential for customers developing artificial intelligence (AI), high-performance computing, and other advanced technologies. Therefore, we see a more than 46% gain for the stock by the end of the decade. If you’re looking for some stocks with huge potential, make sure to grab a free copy of our “The Next NVIDIA” report. It features a software stock we’re confident has 10X potential. The stock hit an all-time high of $226.40 earlier this year but has been in retreat since then. In fact, the share price is 8.3% lower than at the start of the year. It is up 28.9% year over year, though, outperforming the broader markets in that time. Wall Street remains optimistic, and analysts see plenty of room for the stock to run, at least in the short term. Investors are of course concerned with future stock performance over the next 1, 5, to 10 years. Although most Wall Street analysts will calculate 12-month forward projections, it is clear that nobody has a consistent crystal ball, and plenty of unforeseen circumstances can render even near-term prognostications irrelevant. 24/7 Wall St. aims to present some farther-looking insights based on TSMC’s own numbers, along with business and market development information that may be of help with your own research. All Roads Lead to Taiwan Semiconductor Taiwan Semiconductor has control of roughly 62% of the global chip market. In the high-tech universe, there is a single common road that top-flight companies like Nvidia, AMD, Apple, Qualcomm, Broadcom, and many others must travel to get their chips made, no matter where they hail from. That road inevitably leads to TSMC, the largest semiconductor foundry on the planet. When a company like Nvidia Corp. (NASDAQ: NVDA) designs a new chip, it takes it to TSMC to actually print the design on a silicon wafer. TSMC is the top choice for Nvidia, AMD, and many other chip designers, thanks to its precision, quality control, and innovative technical capabilities. At the time of this writing, TSMC commands over 60% of global spending at chip foundries. The explosion of growth in the artificial intelligence and data center arenas have led to a commensurate demand acceleration for graphics processing unit (GPU) chips and a panoply of similar ones for those fields. By focusing on precision foundry work, TSMC has become the premier “go-to” player, for chip designers, even among those competing in various sectors. TSMC does face certain challenges, including: Despite its crucial place in the semiconductor supply chain, Taiwan Semiconductor is based in Taiwan. The Leadership of the People’s Republic of China claims that Taiwan is a part of China proper. Any overt military action on Taiwanese soil likely would result in a domino-effect of chip shortages. TSMC had raised prices for its 3-nanometer and 5-nm process products by up to 8%. However, Samsung is focusing on its 2-nm process to meet future technologies’ high-performance, low-power, and high-bandwidth requirements, and rival Intel has a 1.4-nm ultra-fine process slated to be unveiled in 2027. The semiconductor industry has historically been cyclical. While AI investment soars, TSMC has few rivals of significance. During slow periods, semiconductor companies have often been glutted with excess inventory. It remains to be seen how TSMC will handle a slowdown after ramping up production to such a high level. TSMC&#8217;s Performance The company experienced significant growth and transformation from 2014 to 2024, in that time solidifying its position as a global leader in semiconductor manufacturing. 2014 was the year that the TSMC-Apple cooperation began in earnest, with Apple’s A8 and A8X SoCss. Such has the cooperation expanded that Apple has gone to TSMC for nearly 100% of its chip requirements by 2024. Opposing patent infringement lawsuits with GlobalFoundries in 2019 eventually settled with a cross-licensing agreement, which ends in 2029. 2020 saw TSMC prudently decide to diversify its manufacturing by opening up new plants in Phoenix, Arizona, and Dresden, Germany. In July 2020, TSMC signed a 20-year deal with Ørsted to buy the entire production of two offshore wind farms under development off Taiwan&#8217;s west coast. At the time of its signing, it was the world&#8217;s largest corporate green energy order ever made. 2021 saw TSMC form joint ventures with Sony and Denso in Japan. Fiscal Year (DEC ) Price Total Revenues Net Income NYSE (TWD) (TWD) 2014 $22.38 $762.81 M $254.30 M 2015 $22.75 $843.49 M $302.85 M 2016 $28.75 $947.98 M $331.73 M 2017 $39.65 $977.95 M $344.99 M 2018 $36.91 $1.03 B $363.05 M 2019 $58.10 $1.07 B $353.95 M 2020 $109.04 $1.34 B $510.74 M 2021 $120.31 $1.59 B $596.54 M 2022 $74.49 $2.24 B $1.016,53 B 2023 $104.00 $2.16 B $838.50 M 2024 $197.49 $2.89 B $1.17 T Key Drivers for TSMC’s Future The surge in artificial intelligence (AI) is a primary driver for TSMC. The surge in artificial intelligence (AI) is a primary driver for TSMC, but its future growth is also heavily tied to strategic partnerships, geopolitical considerations, and the following: Technological Leadership: TSMC&#8217;s ongoing advancement in process technology, particularly in nodes like 3nm and beyond, allows them to command premium pricing and maintain a strong market share. The company&#8217;s ability to deliver cutting-edge manufacturing capabilities is essential for customers developing advanced technologies such as artificial intelligence (AI), high-performance computing, and advanced mobile devices. Demand from Key Sectors: The increasing demand for semiconductors in crucial fields like AI, high-performance computing (HPC), and 5G and advanced mobile devices. While the surge in AI applications drives a need for the powerful chips TSMC manufactures, data centers and other HPC applications also require high-end semiconductors. Furthermore, the evolution of 5G and the increasing sophistication of mobile devices contribute significantly to TSMC&#8217;s revenue. Supply Chain Dynamics: The importance of robust semiconductor supply chains is undeniable, and TSMC&#8217;s role in that chain is very crucial. This serves as an incentive for the international community to keep Taiwan out of Beijing’s control. Because of its uniquely advanced manufacturing capabilities, TSMC can easily scale for demand acceleration, and it holds close to a near monopoly on large graphics processing unit (GPU) chip contracts from major semiconductor designers for AI and data center use. Stock Price Prediction for 2025 TSMC’s work in quantum computing should pave the way for neuromorphic computing chips that can mimic many human brain functions. The consensus recommendation for TSMC stock from 17 Wall Street analysts is to buy shares. Three of those analysts have Strong Buy ratings. Their average price target in 12 months is $247.07, which is 37.5% above the current price. 24/7 Wall St.’s 12-month projection for TSMC’s price is $183.92 a share, which signals a gain of 2.4% in the coming year. While the company is set to start its 2-nm process this year, Samsung has a vested interest in developing its own niche advantage and support from the Korean government in that space. As a result, we do not anticipate as big of a 2025 surge from 2-nm as other analysts might. Outlook for the Next 5 Years Since TSMC consumes as much as 5% of Taiwan’s entire energy output, its Ørsted wind farm energy production should manifest tangible cost savings benefits. Therefore, we project 2026’s stock price to hit $186.00, a 5.8% year-over-year retreat. While its 2-nm process will likely compete favorably at the start against Samsung, the TSMC competitive advantage in other avenues of chip manufacturing will ultimately prove to be overwhelming. The anticipated surge of data center spending on chips should fuel larger contracts. Collaborations with research institutions and tech giants in developing next-generation AI chips could open new revenue streams and strengthen its position as an innovation leader in the industry. Our projection for 2027 is $206.80. 2028 should begin to see the rewards from the 2024 R&amp;D surge of $32 billion in advanced process technologies. New products from TSM investments in quantum computing research are expected to bear fruit by 2028, potentially revolutionizing certain computing applications. The company’s focus on developing ultra-low power consumption chips for IoT and edge computing devices could position it as a key player in the growing market for energy-efficient technologies. The 2028 24/7 Wall St. price target is $213.90. 2029 will mark the expiration of TSMC’s GlobalFoundries cross-licensing agreement, which should double up the revenues from that stream. Further developments in chips for quantum computing, healthcare, and other applications can open up more direct government contract opportunities. U.S. and German TSMC factories should be operating at full capacity by 2029. We anticipate a price jump to $245.99. By 2030, TSMC&#8217;s work in quantum computing should pave the way for neuromorphic computing chips at the forefront of AI applications. These would mimic human brain functions more closely than ever before. The company’s involvement in space exploration projects and renewable energy initiatives may also diversify its revenue streams and enhance its global technological influence. We expect a $254.59 stock price, representing a more than 46% gain over today&#8217;s stock price. Year P/E Ratio EPS Price Upside 2025 22 $8.36 $183.92 2.4% 2026 20 $9.30 $186.00 3.5% 2027 22 $9.40 $206.80 15.1% 2028 20 $10.70 $213.90 19.0% 2029 20 $12.30 $245.99 36.9% 2030 18 $14.14 $254.59 41.7% The post Taiwan Semiconductor (TSM) Price Prediction and Forecast (March 2025) appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-03-26 10:45:07",
      "date": "26/03/2025",
      "time": "10:45",
      "category": "crypto",
      "impact": "positive",
      "country": "germany",
      "url": "https://247wallst.com/forecasts/2025/03/25/taiwan-semiconductor-tsm-price-prediction-and-forecast/",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 54.09090909090909
    },
    {
      "title": "Exclusive: Some European officials weigh if they can rely on Fed for dollars under Trump",
      "content": "Some European central banking and supervisory officials are questioning whether they can still rely on the U.S. Federal Reserve to provide dollar funding in times of market stress, six people familiar with the matter said, casting some doubt over what has been a bedrock of financial stability.",
      "source": "reuters.com",
      "rawDate": "2025-03-22 05:15:47",
      "date": "22/03/2025",
      "time": "05:15",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/markets/some-european-officials-weigh-if-they-can-rely-fed-dollars-under-trump-2025-03-22/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 48.483333333333334
    },
    {
      "title": "Global rout in bank shares intensifies as recession fears mount",
      "content": "A global selloff in bank shares turned ominous with a collapse in Japanese bank stocks on Friday to their worst weekly loss in at least 40 years while U.S. and European lenders continued to decline, as fear of a global recession swept markets.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 05:33:19",
      "date": "04/04/2025",
      "time": "05:33",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.reuters.com/markets/global-rout-bank-shares-intensifies-recession-fears-mount-2025-04-04/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.58409090909091
    },
    {
      "title": "Apple loses German antitrust appeal, opening door for greater controls",
      "content": "Apple lost an appeal on Tuesday against a regulatory assessment that opens the iPhone maker up to stricter controls in Germany, the Federal Court of Justice ruled on Tuesday, following years of debate over the company's market position.",
      "source": "reuters.com",
      "rawDate": "2025-03-18 06:11:38",
      "date": "18/03/2025",
      "time": "06:11",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/technology/apple-loses-german-antitrust-appeal-opening-door-greater-controls-2025-03-18/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.276767676767676
    },
    {
      "title": "March Euro Area Inflation: Cool Report Shows Welcome Progress On Services Inflation",
      "content": "Euro area inflation cooled in March, with core inflation hitting its lowest rate in over three years, a positive sign for the ECB. Headline inflation was 2.2% YoY, driven down by falling energy prices, despite a strong monthly increase in March.",
      "source": "seekingalpha.com",
      "rawDate": "2025-04-01 11:51:29",
      "date": "01/04/2025",
      "time": "11:51",
      "category": "economy",
      "impact": "positive",
      "country": "germany",
      "url": "https://seekingalpha.com/article/4772259-march-euro-area-inflation-cool-report-shows-welcome-progress-on-services-inflation",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.695707070707073
    },
    {
      "title": "Apple and Google first to face action from EU for breaching Digital Markets Act",
      "content": "Apple Inc (NASDAQ:AAPL, ETR:APC) and Google parent Alphabet Inc (NASDAQ:GOOG) have been told by the European Union that they have both failed to operate with the bloc's Digital Markets Act. The pair are the first to be told by the EU's executive arm how they must comply with the new rules, which took effect last year.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-03-19 11:37:53",
      "date": "19/03/2025",
      "time": "11:37",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.proactiveinvestors.com/companies/news/1068165",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 20.280050505050504
    },
    {
      "title": "How the Trump Tariffs, Trade Wars Could Cost You",
      "content": "President Donald Trump's 25% tariffs on steel and aluminum imports came into force Wednesday, triggering concern across export-reliant Asia and immediate reprisals from the European Union and Canada as the global trade war enters a rocky phase. The latest US tariffs kicked in after a tumultuous day at the White House, when Trump threatened to double the metals tariffs on Canada to 50%.",
      "source": "youtube.com",
      "rawDate": "2025-03-12 18:00:05",
      "date": "12/03/2025",
      "time": "18:00",
      "category": "companies",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.youtube.com/watch?v=4uRHhM4vqc4",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.032323232323233
    },
    {
      "title": "Trump Auto Tariffs: Escalating Trade War in No One's Interest, Europe Lobby Group Chief Says",
      "content": "President Donald Trump has promised 25% levies on all cars not made in the US. The new tariffs will hit German automakers in particular.",
      "source": "youtube.com",
      "rawDate": "2025-03-30 01:00:44",
      "date": "30/03/2025",
      "time": "01:00",
      "category": "companies",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.youtube.com/watch?v=u2T6Gt5VFx0",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 15.665656565656567
    },
    {
      "title": "Apple loses appeal against Germany's special abuse control for Big Tech",
      "content": "Being a staggeringly successful big tech company does have some downsides: Apple has lost an appeal against a special abuse control regime that Germany's competition watchdog applied to it last year. The iPhone maker can expect to continue to face bespoke competition controls in a major European market, in addition to other similar laws (such as the EU's DMA).",
      "source": "techcrunch.com",
      "rawDate": "2025-03-18 08:00:22",
      "date": "18/03/2025",
      "time": "08:00",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://techcrunch.com/2025/03/18/apple-loses-appeal-against-germanys-special-abuse-control-for-big-tech/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 15.157070707070707
    }
  ],
  "china": [
    {
      "title": "China's central bank follows U.S. Fed in keeping rates steady as tariff threats pressure yuan",
      "content": "The People's Bank of China kept the 1-year loan prime rate at 3.1% and the 5-year LPR at 3.6%, where they have been since a quarter-percentage-point cut in October. The rate decision follows the U.S. Federal Reserve's move to hold benchmark interest rates.",
      "source": "cnbc.com",
      "rawDate": "2025-03-19 21:02:49",
      "date": "19/03/2025",
      "time": "21:02",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.cnbc.com/2025/03/20/china-keeps-lpr-steady-as-fed-hold-rates.html",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa",
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 53.52929292929293
    },
    {
      "title": "China's consumer inflation turns negative for the first time in 13 months",
      "content": "China's national consumer price index (CPI) in February fell into negative territory for the first time since January last year, according to data published Sunday by the National Bureau of Statistics. It comes as investors continue to look for signs that Beijing's stimulus measures can help to boost the country's struggling economic recovery.",
      "source": "cnbc.com",
      "rawDate": "2025-03-08 22:32:47",
      "date": "08/03/2025",
      "time": "22:32",
      "category": "economy",
      "impact": "positive",
      "country": "china",
      "url": "https://www.cnbc.com/2025/03/09/inflation-china-consumer-price-index-drops-below-zero-in-february.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.67045454545455
    },
    {
      "title": "Apple is welcome to expand investment in China, commerce minister tells CEO",
      "content": "China's commerce minister told Apple CEO Tim Cook on Monday that the company is welcome to expand investment in the country, a ministry statement showed.",
      "source": "reuters.com",
      "rawDate": "2025-03-24 11:24:54",
      "date": "24/03/2025",
      "time": "11:24",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/technology/apple-is-welcome-expand-investment-china-commerce-minister-tells-ceo-2025-03-24/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 37.19772727272727
    },
    {
      "title": "Apple announces $99 million new clean energy fund in China",
      "content": "Apple Inc said on Monday it will set up a new clean energy fund in China worth 720 million yuan ($99.22 million), coinciding with a Beijing visit of its CEO Tim Cook.",
      "source": "reuters.com",
      "rawDate": "2025-03-24 02:54:55",
      "date": "24/03/2025",
      "time": "02:54",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/technology/apple-announces-99-million-new-clean-energy-fund-china-2025-03-24/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 36.71868686868687
    },
    {
      "title": "Donald Trump Campaigned on Cutting Corporate Taxes – Where Does That Promise Stand Today?",
      "content": "President Donald J. Trump’s 2024 electoral campaign was buoyed by the hope that his leadership would return the economic prosperity of his previous term, which had been decimated by Bidenomics and rampant Congressional spending, fueling inflation to the worst levels in 40 years. Central to President Trump’s strong economic performance from 2016-2020 was the 2017 Tax Cuts and Jobs Act, which reduced corporate taxes from 35% to 21%. TCHA resulted in unprecedented business growth, new entrepreneurism, historically low unemployment among all ethnic groups, and consumer confidence soaring to an 18-year high. The 21% corporate rate is one of the few permanent aspects to TCJA not subject to expiration. President Trump has been adamant about the need to renew TCJA, as other key provisions expire in December, 2025. He is also proposing additional tax cuts, such as taxes on overtime, tips, Social Security payments, and has even proposed eliminating federal income tax altogether, to be replaced with revenues from a national consumption tax and tariffs. However, analysts have debated the merits of further tax cuts, the impact on the national debt, and whether or not Congress would ultimately be able to legislate these proposals into law. Key Points The 2017 Tax Cuts and Jobs Act (TCJA) delivered unprecedented business growth and entrepreneurism, in addition to additional retained money in the pockets of a majority of American citizens. President Trump campaigned on cutting taxes further on a number of fronts, including renewal of TCJA before its expiration in December, 2025. Many analysts who have debated over the effectiveness of further tax cuts fail to include the massive regulatory cuts, the large pending reductions in wasteful spending being identified by DOGE, and the resultant job creation, business growth, and fresh investment into US business as a result of the tariff policies. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here here.(Sponsor) Arguments Against Tax Cuts and The Truth Senator Nancy Pelosi (D-CA) is one of the main opponents to tax cuts and reduced spending that take away power from Democrats&#8217; pet projects. Not surprisingly, the entirety of elected Democrats, as well as left-leaning Republicans, have been the loudest voices against cutting taxes. Democrat leaders like Senators Chuck Schumer (D-NY), Nancy Pelosi (D-CA), and Elizabeth Warren (D-MA) have been among the more articulate critics, although their mantras about “tax cuts would only be for the top 1%” and that “the rich don’t pay their fair share” have been thoroughly debunked by genuine statistics and even left leaning Factcheck.org. In actuality, TCJA benefited over 75% of all US taxpayers, and it has been verified that the top 1%, in fact, pay 40% of the entirety of federal income tax. The Congressional Budget Office’s analysis projects that a TCJA extension would create increased deficits based on reduced tax revenues from present levels. It forecasts a $4.6 trillion shortfall over 10 years, accounting for interest on outstanding federal debt. The Tax Policy Center projected that economic growth would offset only 6% of the shortfall. One crucial point is that neither the CBO or TPC prognostications take into account any significant spending cuts nor how tariffs will accelerate cutting deficits, as well as other key policy ramifications already in effect in the Trump Administration: How tariffs are creating fresh US investment, new businesses, and more crucial private sector jobs. The impact of lower tax rates and the elimination of onerous Biden-imposed regulatory burdens are jump-starting new manufacturing and other major business creation. How ending potential trillions in fraudulent, misappropriated, and likely criminal spending waste from USAID and numerous other federal agencies uncovered by DOGE will accelerate the goal towards eliminating the trillions in federal debt overhang via drastically reduced spending. Why a national consumption tax effectively rebuts Democrat opponents’ claims of “unfairness” and “only favoring the rich”. Trump Fiscal Policy Results In The First 60+ Days Cutting the trillions of wasteful and criminal spending of taxpayer dollars uncovered by Elon Musk and DOGE could accelerate President Trump&#8217;s plans to fix the US economy and restore manufacturing and other critical businesses. Since taking office in January, the threat of Trump&#8217;s tariffs has already created a seismic shift in the corporate business environment. For example: In response to prospective 25% tariffs on products made in Taiwan, Taiwan Semiconductor, the maker of all of the GPUs from Nvidia and AMD required to run Artificial Intelligence, announced a $100 billion investment into new factories to be located in AZ for making GPUs and other semiconductor products expressly for the US market. SoftBank Group Corp. from Japan pledged to invest $50 billion in the US to create 50,000 new jobs. Apple announced it invested $500 billion for AI servers to be built in Michigan and Texas, creating 20,000 new jobs. Oracle, ChatGPT, and OpenAI announced its Stargate JV would invest up to $500 billion for AI infrastructure construction, creating hundreds of thousands of new jobs in various states, commencing with Texas. The revival of US-manufactured steel and copper is already underway, thanks to US tariffs to prevent dumping from China and other nations into the US market. Additionally, Elon Musk’s DOGE has been uncovering misappropriated taxpayer funds, payments to nonexistent recipients, and useless pork projects ostensibly designed to serve as political kickbacks and bribes to overseas entities, all of which are in the process of being cut. The anticipated spending cuts, something not factored into the CBO calculations, could drastically accelerate the rate of reducing the federal debt. A recent CBS poll found that 77% of the American public supports the work of DOGE. Lastly, a consumption tax, proposed as a 14-17% tax on all new goods except for food and medicine, would be a tax that visibly and unequivocally hits the wealthiest the hardest, thus debunking any accusations about unfairness. With no loopholes, a flat consumption tax is based on the value of the purchased item. Since expensive goods that are only affordable for the wealthy have a higher price tag, the commensurate tax revenues from those items will generate more tax revenues. President Trump was given a mandate by the electorate. While he has already enacted some of his plans to good effect, his tax and regulatory cutting proposals will still require much combating with Democrats, the predominant recipients of high taxes and big government spending. Over the next 4 years, the results of these battles will determine the extent of the initiatives’ full financial benefits. The post Donald Trump Campaigned on Cutting Corporate Taxes &#8211; Where Does That Promise Stand Today? appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-04-01 10:30:43",
      "date": "01/04/2025",
      "time": "10:30",
      "category": "crypto",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/personal-finance/2025/03/31/donald-trump-campaigned-on-cutting-corporate-taxes-where-does-that-promise-stand-today/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.696969696969695
    },
    {
      "title": "Trump tariffs, economic uncertainty fuel more settlements between CEOs and activists",
      "content": "Shares of Yeti Holdings tumbled in December and again in March when President Donald Trump threatened tariffs against China, where the company had some of its biggest factories.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 06:06:45",
      "date": "04/04/2025",
      "time": "06:06",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/trump-tariffs-economic-uncertainty-fuel-more-settlements-between-ceos-activists-2025-04-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.037121212121214
    },
    {
      "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
      "content": "Beijing measures comes in the wake of duties imposed by U.S. President Donald Trump's administration earlier this week",
      "source": "cnbc.com",
      "rawDate": "2025-04-04 06:22:32",
      "date": "04/04/2025",
      "time": "06:22",
      "category": "companies",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 27.57020202020202
    },
    {
      "title": "The Reason We Are Likely In A Crash",
      "content": "The current market downturn appears to be a crash, not a correction, making it unwise to buy SPY and QQQ at this moment. Tariffs and potential trade wars, particularly with China, could lead to stagflation, combining high inflation with low GDP growth.",
      "source": "seekingalpha.com",
      "rawDate": "2025-04-03 08:16:51",
      "date": "03/04/2025",
      "time": "08:16",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://seekingalpha.com/article/4772720-the-reason-we-are-likely-in-a-crash",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 26.26060606060606
    },
    {
      "title": "NVDA, TSLA & AAPL: Charting Mag 7 & Measuring Tariff Resistance",
      "content": "Nvidia (NVDA) gets 40% of its business from Asia, Tesla (TSLA) gets 22% of its revenue from China, and Apple (AAPL) added exposure to international markets. Jenny Horne talks about the potential for tariffs to etch more weakness into the stock market's leaders.",
      "source": "youtube.com",
      "rawDate": "2025-04-04 11:30:17",
      "date": "04/04/2025",
      "time": "11:30",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.youtube.com/watch?v=lBQ7WJzWUMI",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 22.134090909090908
    }
  ],
  "japan": [
    {
      "title": "Japan's Rapidus in talks with Apple, Google to mass-produce chips, Nikkei reports",
      "content": "Japanese chipmaker Rapidus is negotiating with Apple , Google and dozens of other potential clients to mass-produce advanced chips by 2027, the Nikkei business daily reported on Friday, citing the company's CEO Atsuyoshi Koike.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 11:55:20",
      "date": "04/04/2025",
      "time": "11:55",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/technology/japans-rapidus-talks-with-apple-google-mass-produce-chips-nikkei-reports-2025-04-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 37.585101010101006
    },
    {
      "title": "Japan says it is leaving all options open against Trump's tariffs",
      "content": "Japanese Trade Minister Yoji Muto said on Thursday that Japan is leaving all options open to respond to U.S. President Donald Trump's newly announced tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-04-02 22:40:44",
      "date": "02/04/2025",
      "time": "22:40",
      "category": "tech",
      "impact": "positive",
      "country": "japan",
      "url": "https://www.reuters.com/world/japan/japan-says-it-is-leaving-all-options-open-against-trumps-tariffs-2025-04-03/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 36.90858585858586
    },
    {
      "title": "GOOGL Antitrust Woes, AAPL A.I. Delay, ORCL Earnings",
      "content": "Last week's sea of red poured into markets to start this trading week. The Mag 7 leaders are responsible for a lot of the weakness due to Alphabet's (GOOGL) antitrust woes, while Apple (AAPL) pushed back A.I.",
      "source": "youtube.com",
      "rawDate": "2025-03-10 17:04:58",
      "date": "10/03/2025",
      "time": "17:04",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://www.youtube.com/watch?v=vpxU17WjHwE",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 21.653535353535354
    },
    {
      "title": "AMZN, AAPL and GOOGL Forecast – Major US Stocks Continue to Look Calm",
      "content": "The three major stocks that I watch on Tuesday will be Amazon, Apple, and Alphabet. These stocks all look a bit sluggish, but at the same time, I can make an argument that we are at least starting to see stability.",
      "source": "fxempire.com",
      "rawDate": "2025-03-18 08:24:56",
      "date": "18/03/2025",
      "time": "08:24",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.fxempire.com/forecasts/article/amzn-aapl-googl-major-us-stocks-continue-to-look-calm-1505043",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.685353535353535
    },
    {
      "title": "Apple Just Gave Taiwan Semiconductor Investors Great News",
      "content": "Over the last several weeks, technology companies have reported earnings for the fourth quarter and full calendar year for 2024. Among the biggest influencers in artificial intelligence (AI) are the \"Magnificent Seven\" companies: Nvidia, Microsoft, Meta Platforms, Amazon, Alphabet, Tesla, and Apple.",
      "source": "fool.com",
      "rawDate": "2025-03-17 12:15:00",
      "date": "17/03/2025",
      "time": "12:15",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.fool.com/investing/2025/03/17/apple-just-gave-taiwan-semiconductor-investors-gre/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.56060606060606
    },
    {
      "title": "Fed Chair Powell speaks at the Society for Advancing Business Editing and Writing",
      "content": "Fed Chair Jerome Powell makes first comments since President Trump's tariff announcement at the Society for Advancing Business Editing and Writing (SABEW) conference. About Yahoo Finance: Yahoo Finance provides free stock ticker data, up-to-date news, portfolio management resources, comprehensive market data, advanced tools, and more information to help you manage your financial life.",
      "source": "youtube.com",
      "rawDate": "2025-04-03 14:34:11",
      "date": "03/04/2025",
      "time": "14:34",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.youtube.com/watch?v=vwU7o5CZWy0",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 13.529545454545454
    }
  ],
  "emerging_markets": [
    {
      "title": "India's inflation rate dips to cooler-than-expected 3.61% in February, below central bank's target",
      "content": "The lower inflation reading could give the Reserve Bank of India room to cut rates and support its slowing economy.",
      "source": "cnbc.com",
      "rawDate": "2025-03-12 06:40:14",
      "date": "12/03/2025",
      "time": "06:40",
      "category": "economy",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.cnbc.com/2025/03/12/indias-cpi-inflation-eases-for-fourth-straight-month-lowest-since-august-2024-.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 43.28914141414141
    },
    {
      "title": "Trump tariffs on Venezuela crude buyers are a potent new tool of US pressure",
      "content": "A U.S. plan to slap tariffs on countries buying sanctioned Venezuelan oil marks an unprecedented, and potentially potent, mixture of punitive economic measures against a geopolitical foe that Washington could replicate against other countries like Russia and Iran, analysts said.",
      "source": "reuters.com",
      "rawDate": "2025-03-25 16:22:09",
      "date": "25/03/2025",
      "time": "16:22",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/business/energy/trump-tariffs-venezuela-crude-buyers-are-potent-new-tool-us-pressure-2025-03-25/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.0780303030303
    },
    {
      "title": "Indian pharma stocks defy market slump on US tariffs exemption",
      "content": "Shares of Indian drugmakers surged 4% on Thursday, in contrast to the drop in the broader stock market, after U.S. President Donald Trump's administration exempted pharmaceutical products from the list of imports hit by reciprocal tariffs.",
      "source": "reuters.com",
      "rawDate": "2025-04-02 23:53:46",
      "date": "02/04/2025",
      "time": "23:53",
      "category": "markets",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/world/india/indian-pharma-stocks-defy-market-slump-us-tariffs-exemption-2025-04-03/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "healthcare"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 37.54267676767677
    },
    {
      "title": "Live: Vanguard S&P 500 ETF (VOO) Plummets 4% as Nike (NKE) and Dell (DELL) Sink",
      "content": "A day following &#8220;Liberation Day,&#8221; the talk of the town is that investors have been liberated from capital gains taxes. The Dow Jones is down 3.72%, the Nasdaq is down more than 5%, and the Vanguard S&amp;P 500 ETF (NYSE: VOO) is down 3.93% as of 10:25 a.m. ET. Why is the market selling off? Tariffs announced by the Trump Administration are estimated to reduce trade by $900 billion this year. Almost every Wall Street bank is now pulling back economic growth estimates for the year. Tariff rates on other countries announced last night range from 10% to more than 50%. As of 2022, the United States had a weighted-average tariff rate of about 1.5%. However, after Trump&#8217;s tariff announcement yesterday the United States would have a weighted average tariff rate of 29%. Another issue driving stocks down today is the fact these tariffs appear to be less of a &#8216;negotiating tactic&#8217; and something that will be in place for a prolonged period of time. For example, both Vietnam and Israel announced large cuts to tariffs on U.S. goods, but saw reciprocal tariff rates of 46% and 17%, respectively. What Stocks Are Falling in the Vanguard S&amp;P 500 ETF? What stocks in the VOO are seeing the biggest declines today? Retailers and Clothing: Williams-Sonoma is down 18.1%, Deckers Outdoor down 16.9%, Ralph Lauren down 16.9%, and Nike down 13%. Each of these companies faces not only reduced consumer spending if a recession happens but also have overseas supply chains that would see significant tariff impacts if these tariffs take effect as presented on April 9th. Consumer Electronics: Dell is down 15.3%, HP is down 15.7%, and Best Buy is down 15.8%. Once again, these companies not only face reduced consumer demand but significant tariffs on their products. Apple was down 9% in early trading but has trimmed its losses to 7.9%. The post Live: Vanguard S&#038;P 500 ETF (VOO) Plummets 4% as Nike (NKE) and Dell (DELL) Sink appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-04-04 09:30:13",
      "date": "04/04/2025",
      "time": "09:30",
      "category": "crypto",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://247wallst.com/investing/2025/04/03/live-vanguard-sp-500-etf-voo-plummets-4-as-nike-nke-and-dell-dell-sink/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 34.9189393939394
    },
    {
      "title": "South Africa not planning to retaliate over Trump's tariffs",
      "content": "South Africa has no immediate plans to retaliate against the United States over tariffs announced by President Donald Trump this week and will instead seek to negotiate exemptions and quota agreements, senior government officials said on Friday.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 05:23:28",
      "date": "04/04/2025",
      "time": "05:23",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/world/africa/south-africa-says-trumps-tariffs-effectively-nullify-agoa-benefits-2025-04-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "africa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 34.468434343434346
    },
    {
      "title": "Apple says iPhone 16 series to be available in Indonesia from April 11",
      "content": "Apple's iPhone 16 series will be available in Indonesia from April 11, it said on Wednesday, after Jakarta lifted a ban on its sale following the company's more than $300 million investment plan.",
      "source": "reuters.com",
      "rawDate": "2025-03-26 06:36:27",
      "date": "26/03/2025",
      "time": "06:36",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/technology/apple-says-iphone-16-series-be-available-indonesia-april-11-2025-03-26/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 32.66287878787879
    },
    {
      "title": "I make $700k at a FAANG company but layoffs are coming – should I sell my U.S. homes and head back to Canada?",
      "content": "Key Points A Reddit user is concerned he is going to be laid off from his $700K job. He&#8217;s considering relocating, but he likely should keep his high paying job as long as he can. Shoring up his finances and starting to network for other work could help him maintain financial stability. Earn up to 3.8% on your money today (and get a cash bonus); click here to see how. (Sponsored) A Canadian working at a FAANG (Facebook, Amazon, Apple, Netflix, Google) job is currently making $700K per year while his pregnant wife stays home with the couple&#8217;s toddler. Unfortunately, as he posted on Reddit, he&#8217;s worried about potential layoffs at his company. He wasn&#8217;t given a promotion this year as the company was laying people off, and he&#8217;s also been unable to get a visa due to the layoffs. He&#8217;s also concerned that his temporary visa could be ended because of a potential trade war between the U.S. and Canada. Given the uncertainty about his professional future, he&#8217;s trying to decide what to do. He&#8217;s thinking about potentially selling his houses in the U.S. at a small loss and resettling in Canada; about paying down his mortgage so he&#8217;d earn enough rent to cover it and temporarily going to Canada or India and renting until things stabilize in the U.S.; or about just trying to hold on at work while expanding his emergency fund. So, what&#8217;s the best approach for him to deal with his current workplace uncertainty? Shoring up his finances and work skills could be a good option While the Reddit user may be worried about future layoffs, the fact is that he has not been laid off yet &#8212; and he is still making a $700K per year income. Giving up that job in anticipation of a possible layoff that may never come would likely be a foolish move. Instead, he can focus on making himself as indispensable as possible at work. While this may not guarantee he won&#8217;t be laid off, it still gives him a better shot at staying on the job and continuing to earn great pay. He can also start polishing up his resume, networking, and making professional connections. With a FAANG job as part of his employment history, he may easily be able to find other work in the U.S. even if he is laid off from his current position. This could help him to avoid having to sell his houses and disrupt his family just because of short-term economic issues. Regardless, since his job is uncertain, shoring up his financial situation would be a smart move. He should throw as much money as possible into a high-yield savings account right now. That way, this money will be there for him to live on temporarily if he loses his job. If he does end up having to move back to Canada because of problems with his visa resulting from a trade war, it would also be helpful to have these extra funds to pay for any costs. Since he really can&#8217;t predict the future, taking these steps to be as financially secure as possible, while keeping his high-paying job for as long as he can, should help set him up for a more secure future. A financial advisor can also help him find ways to free up more money to save and can also work with him to make different contingency plans and understand how they would impact his finances, so getting this professional advice would likely be a smart choice given the uncertainty of his ongoing situation. The post I make $700k at a FAANG company but layoffs are coming &#8211; should I sell my U.S. homes and head back to Canada? appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-03-26 12:03:13",
      "date": "26/03/2025",
      "time": "12:03",
      "category": "tech",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://247wallst.com/personal-finance/2025/03/25/i-make-700k-at-a-faang-company-but-layoffs-are-coming-should-i-sell-my-u-s-homes-and-head-back-to-canada/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "canada"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 24.5
    },
    {
      "title": "The geopolitical risk premium is likely to come back into the market, says Rapidan CEO Bob McNally",
      "content": "Bob McNally, Rapidan Energy Group CEO, joins 'Power Lunch' to discuss Trump targeting Russian oil and the oil trade.",
      "source": "youtube.com",
      "rawDate": "2025-03-31 14:51:32",
      "date": "31/03/2025",
      "time": "14:51",
      "category": "markets",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.youtube.com/watch?v=VvYpXYzyvyg",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 20.79191919191919
    },
    {
      "title": "President Trump: Vietnam wants to cut their tariffs to zero if agreement can be reached",
      "content": "CNBC's Megan Casella reports on the latest tariff-related news from the White House.",
      "source": "youtube.com",
      "rawDate": "2025-04-04 11:41:16",
      "date": "04/04/2025",
      "time": "11:41",
      "category": "companies",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.youtube.com/watch?v=uryxdQNPe7g",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 12.86969696969697
    },
    {
      "title": "Indian Stocks Are Over Their Slump. 2 Sectors to Consider.",
      "content": "India's stock market is still the world's most expensive, but price-earnings ratios are back to historic averages. The financial and power sectors look attractive.",
      "source": "barrons.com",
      "rawDate": "2025-03-20 13:21:00",
      "date": "20/03/2025",
      "time": "13:21",
      "category": "markets",
      "impact": "negative",
      "country": "emerging_markets",
      "url": "https://www.barrons.com/articles/india-stocks-over-slump-sectors-to-consider-1867ab1c",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 12.210353535353535
    }
  ],
  "global": [
    {
      "title": "US tariffs threaten growth shock, Goldman Sachs says",
      "content": "Goldman Sachs warned sweeping U.S. tariffs will weigh on global growth and prompt the Federal Reserve to cut interest rates more aggressively than previously expected.",
      "source": "reuters.com",
      "rawDate": "2025-04-03 14:20:38",
      "date": "03/04/2025",
      "time": "14:20",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/markets/us-tariffs-threaten-growth-shock-goldman-sachs-says-2025-04-03/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 52.03964646464647
    },
    {
      "title": "'Transitory' is back as the Fed doesn't expect tariffs to have long-lasting inflation impacts",
      "content": "Economic projections the Fed released Wednesday indicate that while officials see inflation moving up this year more rapidly than previously expected, they also expect the trend to be short-lived. The position is significant with markets concerned that President Donald Trump's tariffs could spark a broader global trade war that again would make inflation a problem for the U.S. economy.",
      "source": "cnbc.com",
      "rawDate": "2025-03-19 17:28:37",
      "date": "19/03/2025",
      "time": "17:28",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/03/19/transitory-is-back-as-the-fed-doesnt-expect-tariffs-to-have-long-lasting-inflation-impacts.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 46.395959595959596
    },
    {
      "title": "'Volatility and conflict': Business leaders sound warnings over Trump's tariffs",
      "content": "President Donald Trump's trade tariffs are a major concern among U.S. and international business leaders, with industry titans warning of trouble ahead.",
      "source": "cnbc.com",
      "rawDate": "2025-03-12 19:12:56",
      "date": "12/03/2025",
      "time": "19:12",
      "category": "markets",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/03/13/tariffs-could-cause-volatility-and-conflict-business-leaders.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 45.316161616161615
    },
    {
      "title": "Oil sinks nearly 3% after Trump announces sweeping new tariffs",
      "content": "Oil prices dropped $2 on Thursday after U.S. President Donald Trump announced reciprocal tariffs on trading partners, stoking concerns that a global trade war may dampen demand for crude.",
      "source": "reuters.com",
      "rawDate": "2025-04-02 21:13:25",
      "date": "02/04/2025",
      "time": "21:13",
      "category": "markets",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/business/energy/oil-sinks-nearly-3-after-trump-announces-sweeping-new-tariffs-2025-04-03/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 44.89823232323232
    },
    {
      "title": "Market warning lights flash amber after Trump tariff shock",
      "content": "Global markets have been sucked into a down-draft after U.S. President Donald Trump's sweeping tariffs, setting investors' go-to warning lights flickering but not yet flashing red.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 12:06:38",
      "date": "04/04/2025",
      "time": "12:06",
      "category": "markets",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/markets/global-markets-stress-graphic-pix-2025-04-04/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 42.25757575757576
    },
    {
      "title": "Trump widens trade war as he targets Venezuela's energy sector, eyes sectoral tariffs soon",
      "content": "U.S. President Donald Trump on Monday widened his global trade war with 25% secondary tariffs on any country that buys oil or gas from Venezuela, and said he would announce tariffs soon on automobiles, aluminum and pharmaceuticals.",
      "source": "reuters.com",
      "rawDate": "2025-03-24 15:31:53",
      "date": "24/03/2025",
      "time": "15:31",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/world/us/trump-widens-trade-war-he-targets-venezuelas-energy-sector-eyes-sectoral-tariffs-2025-03-24/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "energy"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.86893939393939
    },
    {
      "title": "Morning Bid: Trepidation Day",
      "content": "If you thought a global trade war was already priced into world markets, Thursday's reaction to the U.S. tariff sweep will be sobering.",
      "source": "reuters.com",
      "rawDate": "2025-04-03 06:55:54",
      "date": "03/04/2025",
      "time": "06:55",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/markets/us/global-markets-view-usa-2025-04-03/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 38.72348484848485
    },
    {
      "title": "El-Erian says U.S. recession risks are now 'uncomfortably high'",
      "content": "Allianz's Chief Economic Advisor Mohamed El-Erian on Friday that U.S. President Donald Trump's swathe of so-called reciprocal tariffs could have a significant effect on the global economy. He told CNBC the risk of a U.S. recession \"has become uncomfortably high.",
      "source": "cnbc.com",
      "rawDate": "2025-04-04 03:26:55",
      "date": "04/04/2025",
      "time": "03:26",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/04/04/liberation-day-mohamed-el-erian-says-trump-tariffs-risk-us-recession.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.63686868686869
    },
    {
      "title": "Trump tariffs poised to exacerbate woes of ailing petchems sector",
      "content": "Sweeping new U.S. import tariffs threaten to further erode demand for global petrochemical producers and accelerate capacity cuts in an industry plagued by weak margins, industry officials and analysts said.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 03:34:35",
      "date": "04/04/2025",
      "time": "03:34",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/markets/commodities/trump-tariffs-poised-exacerbate-woes-ailing-petchems-sector-2025-04-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.54469696969697
    },
    {
      "title": "Tech stocks sink after Trump tariff rollout — Apple heads for worst drop in 5 years",
      "content": "Technology stocks sold off Thursday after President Donald Trump announced a slew of global tariffs and a baseline 10% duty. Apple led the declines among the so-called \"Magnificent Seven\" group, dropping more than 8%.",
      "source": "cnbc.com",
      "rawDate": "2025-04-03 09:34:23",
      "date": "03/04/2025",
      "time": "09:34",
      "category": "crypto",
      "impact": "negative",
      "country": "global",
      "url": "https://www.cnbc.com/2025/04/03/tech-stocks-sink-after-trump-tariff-rollout-apple-leads-drop.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.61792929292929
    },
    {
      "title": "Recession Risks Rise as Stocks Selloff on Tariffs",
      "content": "Wall Street economists predict a US recession this year and a return to pandemic-level inflation due to the Trump administration's announcement of major tariffs on global trading partners. Liz Ann Sonders, Charles Schwab Chief Investment Strategist, talks about the risks of rising inflation and what the Federal Reserve might do next.",
      "source": "youtube.com",
      "rawDate": "2025-04-03 14:02:40",
      "date": "03/04/2025",
      "time": "14:02",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=VM_NIRbLihM",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 32.41540404040404
    },
    {
      "title": "Auto industry rocked by Trump's 25% tariffs on US imports",
      "content": "U.S. automakers and their global rivals were rocked on Wednesday by President Donald Trump's announcement that he would impose 25% tariffs on all vehicles and foreign-made autoparts imported into the United States.",
      "source": "reuters.com",
      "rawDate": "2025-03-26 20:55:28",
      "date": "26/03/2025",
      "time": "20:55",
      "category": "companies",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/autos-transportation/auto-industry-rocked-by-trumps-25-tariffs-us-imports-2025-03-27/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry",
          "transport"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 32.32171717171717
    },
    {
      "title": "Apple to hold Worldwide Developers Conference from June 9",
      "content": "Apple will hold its Worldwide Developers Conference (WWDC) from June 9 to June 13, it said on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-03-25 13:56:01",
      "date": "25/03/2025",
      "time": "13:56",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/technology/apple-hold-worldwide-developers-conference-june-9-2025-03-25/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.010606060606065
    },
    {
      "title": "Morning Bid: 'Magnificent' bear",
      "content": "What matters in U.S. and global markets today. It's Friday, so today I'll provide a quick overview of what's happening in global markets and then offer you some weekend reading suggestions away from the headlines.",
      "source": "reuters.com",
      "rawDate": "2025-04-04 06:34:33",
      "date": "04/04/2025",
      "time": "06:34",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/markets/us/global-markets-view-usa-2025-04-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.531060606060603
    },
    {
      "title": "Tariffs and stocks: Expect continued and increased volatility",
      "content": "Traders are now fully pricing in a Federal Reserve interest rate cut in June, a shift from previous July expectations. Charles Schwab chief investment strategist Liz Ann Sonders joins Catalysts host Madison Mills and Invesco global market strategist Brian Levitt to discuss how the economic backdrop and tariff impacts may limit the Fed's ability to address market challenges with small rate cuts alone.",
      "source": "youtube.com",
      "rawDate": "2025-04-03 13:27:03",
      "date": "03/04/2025",
      "time": "13:27",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=9nuOgEs_4iQ",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 30.46792929292929
    },
    {
      "title": "Fed's Bostic on Inflation, Rate Cuts and Tariffs",
      "content": "Federal Reserve Bank of Atlanta President Raphael Bostic discusses the outlook for Fed monetary policy, the US labor market and the economic impact of tariffs with Mike McKee on Bloomberg Television. Sign up for the Economics Daily newsletter to discover what's driving the global economy and what it means for policy makers, businesses, investors and you: https://bloom.bg/4535pfS -------- More on Bloomberg Television and Markets Like this video?",
      "source": "youtube.com",
      "rawDate": "2025-03-24 16:04:18",
      "date": "24/03/2025",
      "time": "16:04",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=sixJ_-O-mSY",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 30.198989898989897
    },
    {
      "title": "Trump Tariffs Smash Asia. How a Global Trade War Will Hurt U.S. Stock Markets.",
      "content": "Tesla deliveries sink as Musk's brand crisis grows, more TikTok suitors emerging as deadline for app nears, more news to start your day.",
      "source": "barrons.com",
      "rawDate": "2025-04-03 06:48:00",
      "date": "03/04/2025",
      "time": "06:48",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.barrons.com/articles/trump-tariffs-stock-markets-things-to-know-today-525eb603",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 25.24141414141414
    },
    {
      "title": "Fed's Powell Says Tariff Impact May Be Larger Than Expected",
      "content": "\"While uncertainty remains elevated, it is now becoming clear that the tariff increases will be significantly larger than expected,\" Federal Reserve Chair Jerome Powell says at the Society for Advancing Business Editing and Writing annual conference. Sign up for the Economics Daily newsletter to discover what's driving the global economy and what it means for policy makers, businesses, investors and you: https://bloom.bg/4535pfS -------- More on Bloomberg Television and Markets Like this video?",
      "source": "youtube.com",
      "rawDate": "2025-04-04 12:06:01",
      "date": "04/04/2025",
      "time": "12:06",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=axvwKjsgIUY",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.6739898989899
    },
    {
      "title": "How Cheap Are Big Tech Stocks?",
      "content": "The US stock market is currently experiencing one of its sharpest corrections in recent history, driven by uncertainty around trade policy and declining economic growth forecasts. President Donald Trump's frequent shifts in international tariff rhetoric have left businesses and investors navigating a rapidly changing landscape.",
      "source": "zacks.com",
      "rawDate": "2025-03-31 14:51:04",
      "date": "31/03/2025",
      "time": "14:51",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.zacks.com/commentary/2437615/how-cheap-are-big-tech-stocks?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2437615",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.822979797979798
    },
    {
      "title": "IMF warns of ‘significant risk' to global economy from Trump tariffs as markets slide",
      "content": "Fund boss Kristalina Georgieva says it is important that US and trading partners avoid escalating trade war",
      "source": "theguardian.com",
      "rawDate": "2025-04-04 03:51:29",
      "date": "04/04/2025",
      "time": "03:51",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.theguardian.com/business/2025/apr/04/imf-warns-of-significant-risk-to-global-economy-from-trump-tariffs-as-markets-slide",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.3729797979798
    },
    {
      "title": "These 2 Vanguard ETFs Have Over 10% of Assets in Nvidia Stock. Here's Why Both Growth Funds Are Great Buys Now.",
      "content": "Nvidia (NASDAQ: NVDA) took the market by storm in 2023 and 2024 -- increasing by several-fold in just two years to become the third most valuable company in the world behind only Apple (NASDAQ: AAPL) and Microsoft (NASDAQ: MSFT). But Nvidia and several other megacap growth stocks are underperforming the S&P 500 (^GSPC 0.38%) and Nasdaq Composite (^IXIC 0.87%) in 2025 as fears of an economic slowdown and tariffs rock markets.",
      "source": "fool.com",
      "rawDate": "2025-04-02 07:07:00",
      "date": "02/04/2025",
      "time": "07:07",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/04/02/buy-nvidia-stock-growth-etf-vanguard/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 19.18888888888889
    },
    {
      "title": "This agentic AI play's stock is falling after it called out ‘increasing global macroeconomic uncertainty'",
      "content": "Shares of UiPath fell sharply after hours on Wednesday after the business-automation software platform forecast sales for the year ahead that came in below Wall Street's expectations.",
      "source": "marketwatch.com",
      "rawDate": "2025-03-12 17:20:00",
      "date": "12/03/2025",
      "time": "17:20",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.marketwatch.com/story/this-agentic-ai-plays-stock-is-falling-after-it-called-out-increasing-global-macroeconomic-uncertainty-f4b2247e",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 18.508333333333333
    },
    {
      "title": "Tariffs could be a major rewiring of the domestic and global economy, says Mohamed El-Erian",
      "content": "Mohamed El-Erian, Allianz chief economic advisor and president of Queens' College, Cambridge, joins 'Squawk Box' to discuss President Trump's tariff agenda, impact of reciprocal tariffs, state of the economy, inflation concerns, and more.",
      "source": "youtube.com",
      "rawDate": "2025-04-01 09:31:51",
      "date": "01/04/2025",
      "time": "09:31",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=gnfuqQuSHbw",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 18.41868686868687
    },
    {
      "title": "Pimco Sees Bonds as Source of Stability Amid Recession Risk",
      "content": "Tiffany Wilding, economist at Pacific Investment Management Co. (Pimco), discusses the findings of the firm's cyclical outlook and the strong case to diversify away from US equities into a broader mix of global, high quality bonds. -------- More on Bloomberg Television and Markets Like this video?",
      "source": "youtube.com",
      "rawDate": "2025-04-01 10:16:48",
      "date": "01/04/2025",
      "time": "10:16",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=7HCmE0m8C4c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.615656565656565
    },
    {
      "title": "Crossmark Global CEO: Investors should pay attention to technicals",
      "content": "Bob Doll, Crossmark Global CEO and CIO, joins CNBC's 'Squawk on the Street' to discuss how to position amid the market selloff, how he's thinking about recession odds, and more.",
      "source": "youtube.com",
      "rawDate": "2025-04-04 11:43:22",
      "date": "04/04/2025",
      "time": "11:43",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=sei-cXBevtI",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.491666666666667
    },
    {
      "title": "Trump tariff stock market crash: Apple, Amazon, Nike, Shopify, Tesla, Walmart shares plummet",
      "content": "Yesterday, President Donald Trump announced a slew of tariffs on nearly every country in the world—over 180 of them, notes CNBC. The tariffs Trump announced are higher than most economists and business leaders feared.",
      "source": "fastcompany.com",
      "rawDate": "2025-04-03 09:21:34",
      "date": "03/04/2025",
      "time": "09:21",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fastcompany.com/91310775/trump-tariff-stock-market-crash-apple-amazon-nike-shopify-tesla-walmart-shares-plummet",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.890656565656567
    },
    {
      "title": "Markets Face Uncertainty as Tariffs Rise—Experts Weigh Risks & Opportunities",
      "content": "Jeffrey Kleintop, Chief Global Investment Strategist at Charles Schwab, and Ben Emons, Founder at FedWatch Advisors, discuss tariffs, market risks, Fed policy, and global investment trends.",
      "source": "youtube.com",
      "rawDate": "2025-04-03 06:56:13",
      "date": "03/04/2025",
      "time": "06:56",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=I3xeIaYu2so",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.328030303030303
    },
    {
      "title": "Tariffs: Making The U.S. Exceptional, But Not In A Good Way",
      "content": "U.S. tariffs create significant uncertainty, impacting investment levels, return on capital, and global growth, with the U.S. economy bearing the brunt of these effects. Tariffs are inflationary and reduce profits for U.S. businesses, particularly affecting high-quality companies and increasing bankruptcy risks for lower-quality firms.",
      "source": "seekingalpha.com",
      "rawDate": "2025-04-03 08:00:00",
      "date": "03/04/2025",
      "time": "08:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4772708-tariffs-making-the-us-exceptional-but-not-in-a-good-way",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.723989898989899
    },
    {
      "title": "3 reasons markets may be turning bearish",
      "content": "Matt Bartolini, State Street Global Advisors head of SPDR Americas Research, joins Market Domination to discuss the impact of tariffs on markets and on the consumer discretionary sector. He highlights the banking sector's \"turnaround\" and insulation from tariff impacts.",
      "source": "youtube.com",
      "rawDate": "2025-03-26 18:30:15",
      "date": "26/03/2025",
      "time": "18:30",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=o6KJ9ibQLdk",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 14.462121212121211
    },
    {
      "title": "Markets are in a period of stasis where everyone is sitting on their hands: BlackRocks's Rieder",
      "content": "The word \"uncertainty\" has dominated the market discourse as concerns about President Donald Trump's tariffs and an economic slowdown weigh on sentiment. In the video above, BlackRock global fixed income chief investment officer Rick Rieder discusses that uncertainty and how it's leading to a market \"stasis.",
      "source": "youtube.com",
      "rawDate": "2025-03-26 18:42:59",
      "date": "26/03/2025",
      "time": "18:42",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=phgu_FOR8qQ",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 13.737121212121213
    },
    {
      "title": "Wearable Medical Devices Market to Reach USD 324.7 Billion by 2032, CAGR 17.2% | Apple Inc, Fitbit Inc, MediBioSense Ltd.",
      "content": "Dublin, March 18, 2025 (GLOBE NEWSWIRE) -- Introspective Market Research is pleased to announce the publication of its latest report, Wearable Medical Devices Market. This in-depth analysis shows that the Global Wearable Medical Devices Market , valued at USD 69.24 Billion in 2023, is set for substantial growth and is projected to reach USD 324.7 Billion by 2032.",
      "source": "globenewswire.com",
      "rawDate": "2025-03-18 07:59:00",
      "date": "18/03/2025",
      "time": "07:59",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.globenewswire.com/news-release/2025/03/18/3044400/0/en/Wearable-Medical-Devices-Market-to-Reach-USD-324-7-Billion-by-2032-CAGR-17-2-Apple-Inc-Fitbit-Inc-MediBioSense-Ltd.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "healthcare"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 13.51388888888889
    }
  ],
  "events": [
    {
      "title": "Fed Williams Speech",
      "date": "11/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Michigan Consumer Sentiment (Apr)",
      "date": "11/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Musalem Speech",
      "date": "11/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Producer Price Index MoM (Mar)",
      "date": "11/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Apr/09)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Harker Speech",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Goolsbee Speech",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bowman Speech",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Logan Speech",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Jobless Claims 4-Week Average (Apr/05)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Continuing Jobless Claims (Mar/29)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "CPI s.a (Mar)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Inflation Rate YoY (Mar)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core Inflation Rate YoY (Mar)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core Inflation Rate MoM (Mar)",
      "date": "10/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Artius II Acquisition Inc. Rights (AACBR)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Robin Energy Ltd. Common Stock When Issued (RBNEV)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Toro Corp. Common Stock Ex-distribution When Issued (TOROV)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Artius II Acquisition Inc. Class A Ordinary Shares (AACB)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lazard Equity Megatrends ETF (THMZ)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Classover Holdings, Inc. Class B Common Stock (KIDZ)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Classover Holdings, Inc. Warrants (KIDZW)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lazard Japanese Equity ETF (JPY)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Lazard Next Gen Technologies ETF (TEKY)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Fidelity Municipal Bond Opportunities ETF (FMUB)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "IPO: Fidelity Systematic Municipal Bond Index ETF (FMUN)",
      "date": "07/04/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": null,
      "marketCap": null,
      "status": "Expected"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires Vyome",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "RSLS",
      "targetedSymbol": "HIND"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    },
    {
      "title": "M&A: CONSOL Energy Inc. acquires Arch Resources, Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1710366/000119312524230281/d897754ds4.htm",
      "symbol": "CEIX",
      "targetedSymbol": "ARCH"
    },
    {
      "title": "M&A: ACNB CORP acquires Traditions Bancorp, Inc.",
      "date": "30/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/715579/000110465924104255/tm2423820-1_s4.htm",
      "symbol": "ACNB",
      "targetedSymbol": "TRBK"
    },
    {
      "title": "M&A: APA Corp acquires Apache",
      "date": "27/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1841666/000119312524228043/d842747ds4.htm",
      "symbol": "APA",
      "targetedSymbol": null
    },
    {
      "title": "M&A: BERRY GLOBAL GROUP, INC. acquires Glatfelter",
      "date": "25/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/55454/000110465924102854/tm2423980-1_s4.htm",
      "symbol": "BERY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: CHOICEONE FINANCIAL SERVICES INC acquires Fentura Financial, Inc.",
      "date": "17/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/803164/000114036124041309/ny20035699x1_s4.htm",
      "symbol": "COFS",
      "targetedSymbol": "FETM"
    },
    {
      "title": "M&A: Akari Therapeutics Plc acquires Peak Bio",
      "date": "13/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1541157/000119312524218968/d882475ds4.htm",
      "symbol": "AKTX",
      "targetedSymbol": "OTC"
    },
    {
      "title": "M&A: Akari Therapeutics Plc acquires Akari Therapeutics, Plc",
      "date": "13/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1541157/000119312524218968/d882475ds4.htm",
      "symbol": "CLTX",
      "targetedSymbol": "AKTX"
    },
    {
      "title": "M&A: Bowen Acquisition Corp acquires Qianzhi",
      "date": "10/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1973056/000149315224035624/forms-4.htm",
      "symbol": "BOWNU",
      "targetedSymbol": "MERA"
    },
    {
      "title": "M&A: Bowen Acquisition Corp acquires Qianzhi",
      "date": "10/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1973056/000149315224035624/forms-4.htm",
      "symbol": "BOWNR",
      "targetedSymbol": "MERA"
    },
    {
      "title": "M&A: Bowen Acquisition Corp acquires Qianzhi",
      "date": "10/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1973056/000149315224035624/forms-4.htm",
      "symbol": "BOWN",
      "targetedSymbol": "MERA"
    },
    {
      "title": "M&A: PowerUp Acquisition Corp. acquires Aspire",
      "date": "06/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847345/000149315224035342/forms-4.htm",
      "symbol": "PWUPW",
      "targetedSymbol": null
    },
    {
      "title": "M&A: PowerUp Acquisition Corp. acquires Aspire",
      "date": "06/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847345/000149315224035342/forms-4.htm",
      "symbol": "PWUP",
      "targetedSymbol": null
    },
    {
      "title": "M&A: PowerUp Acquisition Corp. acquires Aspire",
      "date": "06/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847345/000149315224035342/forms-4.htm",
      "symbol": "PWUPU",
      "targetedSymbol": null
    },
    {
      "title": "M&A: GERMAN AMERICAN BANCORP, INC. acquires Heartland BancCorp",
      "date": "06/09/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/714395/000110465924097752/tm2420430-1_s4.htm",
      "symbol": "GABC",
      "targetedSymbol": "HLAN"
    }
  ]
}