{
  "lastUpdated": "2025-06-06T16:22:07.497053",
  "us": [
    {
      "title": "Fed 'Beige Book' economic report cites declining growth, rising prices and slow hiring",
      "content": "The U.S. economy contracted over the past six weeks as hiring slowed and consumers and businesses worried about tariff-related price increases, the Fed reported. On inflation, the report described prices as rising \"at a moderate pace and \" widespread reports of contacts expecting costs and prices to rise at a faster rate going forward.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 14:36:39",
      "date": "04/06/2025",
      "time": "14:36",
      "category": "economy",
      "impact": "positive",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/fed-beige-book-economic-report-cites-declining-growth-rising-prices-and-slow-hiring.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession",
          "monetary_policy"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 48.04217171717172
    },
    {
      "title": "Fed's Bowman confirmed by Senate to central bank's top regulatory post",
      "content": "Federal Reserve Governor Michelle Bowman was confirmed to the central bank's top regulatory post by the U.S. Senate on Wednesday, where she is expected to push an agenda aimed at easing rules for banks.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 18:53:54",
      "date": "04/06/2025",
      "time": "18:53",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/feds-bowman-confirmed-by-senate-central-banks-top-regulatory-post-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.682323232323235
    },
    {
      "title": "Apple cut share buybacks and the stock got hit. Here's what sellers are missing.",
      "content": "Investors unfairly punished Apple's stock last week after the company announced it was reducing its buyback program to $100 billion from $110 billion.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-07 09:32:00",
      "date": "07/05/2025",
      "time": "09:32",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apple-cut-share-buybacks-and-its-stock-took-the-hit-heres-what-sellers-are-missing-f5cb8500",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 46.840909090909086
    },
    {
      "title": "You can see AI everywhere — except in Big Tech's profits",
      "content": "AI boosters cling to fanciful forecasts — even if meaningful revenue and productivity has yet to materialize.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-14 07:50:00",
      "date": "14/05/2025",
      "time": "07:50",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.marketwatch.com/story/you-can-see-ai-everywhere-except-in-big-techs-profits-db5fbd81",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 44.99974747474747
    },
    {
      "title": "Fed's Cook: April market volatility will help hone financial stability assessment",
      "content": "Federal Reserve Governor Lisa Cook on Friday noted financial market volatility last month driven by the Trump administration's announcement of unexpectedly high tariffs did not result in the kind of U.S. market dysfunction triggered by the COVID-19 pandemic, but added that the experience would help \"hone our ongoing assessment\" of the stability of the financial system.",
      "source": "reuters.com",
      "rawDate": "2025-05-23 12:08:48",
      "date": "23/05/2025",
      "time": "12:08",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/finance/feds-cook-april-market-volatility-will-help-hone-financial-stability-assessment-2025-05-23/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 43.48510101010101
    },
    {
      "title": "Fed's Bowman lays out ambitious agenda to overhaul and ease bank oversight",
      "content": "The Federal Reserve's new top regulatory official laid out an ambitious agenda for revisiting and easing numerous bank rules and oversight policies which she argued have become onerous and unnecessary.",
      "source": "reuters.com",
      "rawDate": "2025-06-06 10:08:02",
      "date": "06/06/2025",
      "time": "10:08",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/feds-bowman-lays-out-ambitious-agenda-overhaul-ease-bank-oversight-2025-06-06/",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.80075757575757
    },
    {
      "title": "These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines",
      "content": "Key Points A &#8220;more is better&#8221; approach can help you diversify your portfolio while generating passive income. Five fascinating funds will tempt income seekers with potent yields and strong growth prospects. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Stock picking is fine, but exchange traded funds (ETFs) can enable immediate diversification without sacrificing growth and income opportunities. By selecting multiple funds instead of just one, you can achieve an extra measure of safety while also turning your portfolio into a veritable income-generating machine. The idea is to pick out ETFs with notable distribution yields (i.e., annualized cash payment percentages), but also to focus on a wide variety of funds with share-price growth potential. Now, let&#8217;s drill down on five fabulous ETFs so you can start accumulating shares for your income-machine portfolio today. NEOS NASDAQ-100 High Income ETF (QQQI) The name of the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) might lead you to assume that this fund only offers a hefty yield. There&#8217;s more to the story, though, as the QQQI ETF also enables investors to participate in strong technology-focused growth opportunities. Based on the NASDAQ 100 stock index with approximately 100 holdings, the NEOS NASDAQ-100 High Income ETF includes many large-cap tech names you&#8217;ll surely recognize. Some examples are NVIDIA (NASDAQ:NVDA), Apple (NASDAQ:AAPL), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Broadcom (NASDAQ:AVGO). There&#8217;s no denying that technology giants like Apple and NVIDIA are robust revenue generators. Consequently, the NEOS NASDAQ-100 High Income ETF share price could grow substantially over the long term. At the same time, many investors flock to the QQQI ETF for its eye-catching 13.92% distribution yield. Granted, the fund subtracts an annualized management fee (also known as the expense ratio) of 0.68% from the share price. Still, even after the expense ratio is taken out, investors can look forward to outstanding annual income with the QQQI ETF. Along with that, you&#8217;ll get to participate in the growth prospects of terrific tech titans when you hold the NEOS NASDAQ-100 High Income ETF. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) There&#8217;s another passive income machine that&#8217;s similar to QQQI, but it&#8217;s not identical. Brought to you by famous financier JPMorgan Chase (NYSE:JPM), the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) squeezes extra income from a range of high-confidence technology leaders. Much like the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100 and includes around 100 stocks (108, to be exact). From Microsoft to Apple, Amazon, and many more, you&#8217;ll find plenty of high-growth tech names in JEPQ. There&#8217;s a trade-off with the JPMorgan Nasdaq Equity Premium Income ETF when compared to the NEOS NASDAQ-100 High Income ETF. On the negative side, JEPQ has a rolling 12-month dividend yield of 11.01%, which isn’t as impressive as QQQI&#8217;s 13.92% distribution yield. On the positive side, however, the JPMorgan Nasdaq Equity Premium Income ETF has an annualized expense ratio of 0.35%. This is lower than the NEOS NASDAQ-100 High Income ETF&#8217;s 0.68% annual management fee. Perhaps most importantly, you&#8217;ll have the reassurance that comes with well-established fund management by JPMorgan Chase. Thus, for an interesting alternative to the QQQI ETF, the JPMorgan Nasdaq Equity Premium Income ETF is absolutely worth considering. Schwab U.S. Dividend Equity ETF (SCHD) Maybe you&#8217;re seeking a passive income machine that&#8217;s not as technology-heavy as QQQI and JEPQ. In that case, you&#8217;ll want to check out the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This fund includes has 103 stocks in its portfolio, but SCHD doesn&#8217;t track the NASDAQ 100 index. Instead, the Schwab U.S. Dividend Equity ETF tracks the Dow Jones U.S. Dividend 100 Index. Take a look at the fund’s top 10 holdings and you’ll find some technology firms, such as Cisco Systems (NASDAQ:CSCO) and Texas Instruments (NASDAQ:TXN). Yet, you&#8217;ll also see names from other sectors, including Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), Lockheed Martin (NYSE:LMT), and Conoco Phillips (NYSE:COP). Moreover, the Schwab U.S. Dividend Equity ETF offers a trailing 12-month distribution yield of 3.72% with an annual expense ratio of just 0.06%. The ultra-low management fees allow investors to grow their accounts steadily with the SCHD ETF. Two More Picks for Low Volatility To cap off this list of passive income machine picks, I&#8217;ve got two relatively low-risk funds to show you. First, there&#8217;s an ETF that concentrates on dividend-growing businesses instead of gigantic yield. The Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO) features a 4.81% annual distribution rate but also a 0.56% expense ratio, so the income opportunities are good but not jaw-dropping. On the other hand, DIVO tends to be low-volatility as it holds a diverse array of safe names, such as Home Depot, Visa (NYSE:V), Caterpillar (NYSE:CAT), Microsoft, and Goldman Sachs (NYSE:GS). The Amplify CWP Enhanced Dividend Income ETF emphasizes &#8220;high-quality large cap companies with a history of dividend and earnings growth.&#8221; This approach will typically reduce share-price volatility, so investors can sleep well at night while collecting passive income with DIVO. In a similar vein, the NEOS S&amp;P 500 High Income ETF (BATS:SPYI) is de-risked because it holds well-known large-cap stocks in multiple sectors. Indeed, SPYI might be the least risky fund on this list as it includes approximately 500 stocks in its holdings. Because the NEOS S&amp;P 500 High Income ETF generates income from the S&amp;P 500 index, it is a widely diversified fund. So, there&#8217;s a safety factor built into the SPYI ETF. In addition, the NEOS S&amp;P 500 High Income ETF is an enticing passive income machine with a 12.11% annual distribution rate. The fund&#8217;s 0.68% annual expense ratio isn&#8217;t super-low, but the fees may be justified as SPYI brings high yield and instant diversification to the table. All in all, I like DIVO and SPYI for reduced volatility, SCHD for low management fees, and QQQI and JEPQ for technology-sector exposure.The post These 5 ETFs (QQQI, JEPQ, SCHD, DIVO, SPYI) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 13:30:07",
      "date": "03/06/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/03/these-5-etfs-qqqi-jepq-schd-divo-spyi-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 42.151515151515156
    },
    {
      "title": "Most companies are already raising prices or plan to because of tariffs, data shows",
      "content": "New data shows companies are passing along cost increases from tariffs to consumers despite President Donald Trump's pressure not to. Formal data and anecdotal reports alike offer insight into how executives are carefully discussing U.S. trade policy behind the scenes.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 14:32:29",
      "date": "04/06/2025",
      "time": "14:32",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/companies-already-raise-prices-or-plan-to-blaming-tariffs-data-shows.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.762373737373736
    },
    {
      "title": "These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines",
      "content": "Key Points QQQI, JEPQ, SPYI, and MSTY offer eye-catching yields for ambitious passive income investors. You can try all four of these high-yield ETFs for diversified exposure to a wide range of stocks. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) In recent years, ultra-high-yield exchange traded funds (ETFs) have opened the door to new possibilities for aggressive income harvesters. If you pick your ETFs carefully, you can practically turn your portfolio into a passive income machine. Using high-yield ETFs to generate steady income is a smart strategy, but it takes time and research to build a reliable income machine. So, to save you some of the trouble, I&#8217;ve hand-picked these four fantastic funds with big yields. Furthermore, if you give these four ETFs a try, you can cover different market sectors to diversify your portfolio. NEOS NASDAQ-100 High Income ETF (QQQI) If you&#8217;re on the hunt for tech-sector exposure, big yield, and frequent payouts, look no further. Truly, the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) is an ambitious income investor&#8217;s dream fund. First and foremost, the QQQI ETF offers a huge distribution yield (i.e., the annualized cash payout to your portfolio) of 13.92%. This positions the NEOS NASDAQ-100 High Income ETF among the most generous high-yield funds available today. Plus, there&#8217;s another reason why the QQQI ETF is a dividend achiever. Specifically, the NEOS NASDAQ-100 High Income ETF pays its cash distributions on a monthly basis instead of making you wait three months for the next payout. Granted, you&#8217;ll have to pay an expense ratio, which is the annualized management fee that&#8217;s automatically deducted from the fund&#8217;s share price. When it comes to the NEOS NASDAQ-100 High Income ETF, the expense ratio is 0.68%, which is slightly high but not outrageous. Just as importantly, the NEOS NASDAQ-100 High Income ETF invests in components of the technology-heavy NASDAQ 100 index. With roughly 100 holdings, the QQQI ETF includes well-established tech winners like Apple (NASDAQ:AAPL), NVIDIA (NASDAQ:NVDA), Broadcom (NASDAQ:AVGO), Amazon (NASDAQ:AMZN), and Meta Platforms (NASDAQ:META). In other words, the NEOS NASDAQ-100 High Income ETF isn&#8217;t only a passive income powerhouse with a sizable yield. It&#8217;s also an easy way to diversify your portfolio across dozens of tech-market standouts, and this can add an extra layer of safety. JPMorgan Nasdaq Equity Premium Income ETF (JEPQ) In some ways, the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) is similar to the NEOS NASDAQ-100 High Income ETF. Yet, with the JEPQ ETF you&#8217;ll get the peace of mind that comes with prestigious management from financial giant JPMorgan Chase (NYSE:JPM). Like the NEOS NASDAQ-100 High Income ETF, the JPMorgan Nasdaq Equity Premium Income ETF focuses on the NASDAQ 100. JEPQ has 108 stocks in its holdings, and the fund is strongly weighted toward large-cap technology stocks (Apple, Amazon, Microsoft, and so on). Also, just like the QQQI ETF, the JEPQ ETF pays out its distributions on a monthly basis. However, the JPMorgan Nasdaq Equity Premium Income ETF has a rolling 12-month dividend yield of 11.01%, which isn&#8217;t quite as high as the NEOS NASDAQ-100 High Income ETF&#8217;s gigantic 13.92% distribution yield. On the other hand, the JPMorgan Nasdaq Equity Premium Income ETF brings you active management from the one and only JPMorgan Chase. That&#8217;s a safety feature to consider, and the fund&#8217;s expense ratio is only 0.35%. Therefore, you might consider leveraging the expertise of a legendary asset manager with the comparatively low-fee JEPQ ETF. NEOS S&amp;P 500 High Income ETF (SPYI) Mind you, I didn&#8217;t turn my portfolio into a passive income machine by only investing in NASDAQ 100 based funds. Indeed, I diversified my holdings even further with a very broad-based fund known as the NEOS S&amp;P 500 High Income ETF (BATS:SPYI). Like QQQI and JEPQ, SPYI pays out its distributions each and every month. Yet, unlike those other two funds, the NEOS S&amp;P 500 High Income ETF is based on the S&amp;P 500 rather than the NASDAQ 100. With around 500 stocks in its holdings, the NEOS S&amp;P 500 High Income ETF is more diversified than QQQI and JEPQ. You&#8217;ll get exposure to tech names like Apple and NVIDIA with the SPYI ETF, but you&#8217;ll also participate in the growth of non-technology-sector businesses like Coca-Cola (NYSE:KO), Bank of America (NYSE:BAC), Home Depot (NYSE:HD), and Occidental Petroleum (NYSE:OXY). For active management and the enhanced safety that comes with wide portfolio breadth, the NEOS S&amp;P 500 High Income ETF charges an expense ratio of 0.68%. However, the fund&#8217;s hefty 12.11% annual distribution rate more than makes up for the management fees, so SPYI is a great choice for monthly income seekers. YieldMax MSTR Option Income Strategy ETF (MSTY) Finally, after focusing on safety and diversification with the first three ETFs, now we can ramp up the risk-and-reward profile with a fourth fund. I&#8217;m referring to an aggressive but fascinating fund known as the YieldMax MSTR Option Income Strategy ETF (NYSEARCA:MSTY). You won&#8217;t get much diversification with the YieldMax MSTR Option Income Strategy ETF. Instead, you&#8217;ll get an annual expense ratio of 0.99% and an eye-watering distribution rate of 143.11%. The fund achieves this through actively trading U.S. Treasury bonds and options on Microstrategy (NASDAQ:MSTR) stock. As you may be aware, Microstrategy stock is volatile and involves a great deal of risk. You&#8217;ll get sizable monthly distributions with MSTY, but a downturn in MSTR stock could be problematic for your portfolio. Because this fund is very risky, my passive income machine only includes a few shares of the YieldMax MSTR Option Income Strategy ETF. For a more favorable safety-and-yield mix, consider taking a larger position in SPYI, a smaller stake in QQQI and JEPQ, and a tiny position in MSTY.The post These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-03 10:04:43",
      "date": "03/06/2025",
      "time": "10:04",
      "category": "crypto",
      "impact": "positive",
      "country": "us",
      "url": "https://247wallst.com/investing/2025/06/02/these-4-dividend-etfs-qqqi-jepq-spyi-msty-are-passive-income-machines/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.74242424242424
    },
    {
      "title": "Apple's stock falls as Trump makes a tariff threat on iPhones. Here's why it's misguided.",
      "content": "President Donald Trump said Apple must pay a 25% tariff if it doesn't rely on domestic production of iPhones for the U.S. market",
      "source": "marketwatch.com",
      "rawDate": "2025-05-23 08:46:00",
      "date": "23/05/2025",
      "time": "08:46",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-falls-as-trump-makes-a-tariff-threat-on-iphones-heres-why-its-misguided-502c7fce",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 40.55252525252525
    },
    {
      "title": "Apple plans smart glasses launch in 2026, Bloomberg News reports",
      "content": "Apple plans to release smart glasses at the end of next year, Bloomberg News reported on Thursday, in the iPhone maker's latest push to diversify its product lineup and boost demand for its artificial intelligence devices.",
      "source": "reuters.com",
      "rawDate": "2025-05-22 16:01:43",
      "date": "22/05/2025",
      "time": "16:01",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/business/apple-plans-smart-glasses-launch-2026-bloomberg-news-reports-2025-05-22/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.556060606060605
    },
    {
      "title": "Samsung launches slimmest smartphone as races against rival Apple",
      "content": "Samsung Electronics made public on Tuesday its slimmest flagship model to date, complete with enhanced artificial intelligence features, as it seeks to get ahead of rival Apple on the premium market.",
      "source": "reuters.com",
      "rawDate": "2025-05-12 20:03:43",
      "date": "12/05/2025",
      "time": "20:03",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://www.reuters.com/world/asia-pacific/samsung-launches-slimmest-smartphone-races-against-rival-apple-2025-05-13/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 39.522474747474746
    },
    {
      "title": "Federal Reserve governor warns US deficit 'not sustainable' as Treasury bond demand weakens",
      "content": "Federal Reserve Governor Christopher Waller said markets are demanding higher Treasury yields due to concerns about tax cuts widening the federal budget deficit.",
      "source": "foxbusiness.com",
      "rawDate": "2025-05-22 13:25:44",
      "date": "22/05/2025",
      "time": "13:25",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://www.foxbusiness.com/economy/federal-reserve-governor-warns-us-deficit-not-sustainable-treasury-bond-demand-weakens",
      "themes": {
        "macroeconomics": [
          "monetary_policy",
          "geopolitics",
          "energy_transition"
        ],
        "sectors": [
          "technology",
          "finance",
          "crypto"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 38.20479797979798
    },
    {
      "title": "Court denies Apple appeal in Epic Games case, keeping App Store changes in place",
      "content": "A panel of judges denied Apple's emergency application to halt changes to its App Store that resulted from the company's legal battle with Epic Games. The ruling in the case means Apple can no longer charge a commission on payment links inside its apps nor tell developers how the links should look.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 17:40:52",
      "date": "04/06/2025",
      "time": "17:40",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/06/04/apple-appeal-epic-games-app-store.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 37.754797979797985
    },
    {
      "title": "Delta warns new tariffs could force it to stop buying foreign-made airplanes",
      "content": "Delta Air Lines warned new tariffs on imported airplanes and parts could force the airline to stop buying foreign-made planes impacting millions of customers.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 13:23:47",
      "date": "05/06/2025",
      "time": "13:23",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/aerospace-defense/delta-warns-new-tariffs-could-force-it-stop-buying-foreign-made-airplanes-2025-06-05/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.741919191919195
    },
    {
      "title": "This is why Jamie Dimon is so gloomy on the economy",
      "content": "JPMorgan Chase CEO Jamie Dimon has regularly warned that the U.S. economy faces perils, but even as he sounds the alarm, his bank is doing better than ever. A review of 20 years of Dimon's annual investor letters and his public statements show a distinct evolution: His warnings about economic calamities became more frequent even as his bank's performance began lapping rivals.",
      "source": "cnbc.com",
      "rawDate": "2025-05-30 13:05:05",
      "date": "30/05/2025",
      "time": "13:05",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/05/30/jpmorgan-chase-jamie-dimon-economy.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 37.595454545454544
    },
    {
      "title": "Apple: Much, Much Cheaper Than It Looks (Rating Upgrade)",
      "content": "With more than $100 billion in annual sales and gross margins around the 75% mark, Apple's services segment is being categorically undercounted by the market. If this segment can produce ~5% revenue growth in each of the next three years, then estimates appear too low. This makes the stock appear much cheaper than previously thought. Trading at roughly 19x 2028 earnings, we think shares of AAPL appear highly attractive, and deserve an upgrade to 'Buy'.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-28 13:28:44",
      "date": "28/05/2025",
      "time": "13:28",
      "category": "tech",
      "impact": "positive",
      "country": "us",
      "url": "https://seekingalpha.com/article/4790550-apple-much-much-cheaper-than-it-looks-rating-upgrade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.96363636363636
    },
    {
      "title": "Consumer sentiment falls in May as Americans' inflation expectations jump after tariffs",
      "content": "Year-ahead inflation expectations rose to 7.3% from 6.5% last month, according to a University of Michigan survey.",
      "source": "cnbc.com",
      "rawDate": "2025-05-16 10:15:33",
      "date": "16/05/2025",
      "time": "10:15",
      "category": "economy",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.cnbc.com/2025/05/16/consumer-sentiment-may-inflation-expectations-tariffs.html",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.4530303030303
    },
    {
      "title": "Apple's stock has been in a slump — and these analysts don't see an easy way out",
      "content": "Needham analysts say the stock looks pricey, while Apple faces growing threats from its tech rivals.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-04 11:16:00",
      "date": "04/06/2025",
      "time": "11:16",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/apples-stock-has-been-in-a-slump-and-these-analysts-dont-see-an-easy-way-out-6906acd0",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.20202020202021
    },
    {
      "title": "Trump says a 25% tariff 'must be paid by Apple' on iPhones not made in the U.S.",
      "content": "Shares of Apple were under pressure on Friday after Trump's post on Truth Social.",
      "source": "cnbc.com",
      "rawDate": "2025-05-23 07:30:14",
      "date": "23/05/2025",
      "time": "07:30",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.cnbc.com/2025/05/23/trump-tariff-apple-iphones-not-made-in-the-us.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.1189393939394
    },
    {
      "title": "Fed saw inflation, jobless, stability risks at May meeting, minutes show",
      "content": "Rising inflation and unemployment pose challenges for the Federal Reserve amid tariff uncertainties, as officials weigh economic risks and policy responses.",
      "source": "foxbusiness.com",
      "rawDate": "2025-05-28 16:42:13",
      "date": "28/05/2025",
      "time": "16:42",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.foxbusiness.com/economy/fed-saw-inflation-jobless-stability-risks-may-meeting-minutes-show",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.11515151515151
    },
    {
      "title": "Why OpenAI's latest moves could signal more trouble ahead for Apple's stock",
      "content": "Apple hasn't spent enough on AI infrastructure and risks falling behind as rivals get more creative with their devices.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-05 07:52:00",
      "date": "05/06/2025",
      "time": "07:52",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.marketwatch.com/story/why-openais-latest-moves-could-signal-more-trouble-ahead-for-apples-stock-5e59e884",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.10328282828283
    },
    {
      "title": "32% of Warren Buffett's $281 Billion Berkshire Hathaway Portfolio Is Invested in These 2 S&P 500 Dividend Stocks",
      "content": "Berkshire Hathaway (BRK.A -0.97%) (BRK.B -0.92%) CEO Warren Buffett has steered his company to market-crushing performance over multiple decades -- so much so that he has earned the nickname \"the Oracle of Omaha.\" When he steps down from his role as the company's chief executive at the end of this year, it will mark the close of one of the most fantastic corporate leadership runs in history.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:35:00",
      "date": "04/06/2025",
      "time": "04:35",
      "category": "markets",
      "impact": "negative",
      "country": "us",
      "url": "https://www.fool.com/investing/2025/06/04/warren-buffett-berkshire-sp-500-dividend-stocks/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.09444444444445
    },
    {
      "title": "Apple loses bid to pause app store reform order in Epic Games case",
      "content": "Apple has failed to persuade a U.S. appeals court to pause key parts of a federal judge's order requiring the iPhone maker to immediately open its lucrative App Store to more competition.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 17:10:52",
      "date": "04/06/2025",
      "time": "17:10",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-loses-bid-pause-app-store-reform-order-epic-games-case-2025-06-04/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.019444444444446
    },
    {
      "title": "Trump says US will maintain 10% tariffs even after trade deals",
      "content": "President Donald Trump said on Friday that the U.S. will maintain a baseline 10% tariff on imports even after trade deals are struck, adding there could be exemptions when countries offer significant trade terms.",
      "source": "reuters.com",
      "rawDate": "2025-05-09 17:18:21",
      "date": "09/05/2025",
      "time": "17:18",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.reuters.com/business/autos-transportation/trump-says-us-will-maintain-10-tariffs-even-after-trade-deals-2025-05-09/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.967676767676764
    }
  ],
  "france": [
    {
      "title": "US stocks vs European stocks: does Jim Cramer support ‘sell America' trade?",
      "content": "US stocks have been unusually volatile since the start of this year, mostly because of the Trump administration's new trade policies that many believe could lead to a recession in the second half. In comparison, European equities have attracted significant capital in recent months due to more favourable monetary policies and, more importantly, stock valuations.",
      "source": "invezz.com",
      "rawDate": "2025-05-26 11:56:51",
      "date": "26/05/2025",
      "time": "11:56",
      "category": "economy",
      "impact": "negative",
      "country": "france",
      "url": "https://invezz.com/news/2025/05/26/us-stocks-vs-european-stocks-does-jim-cramer-support-sell-america-trade/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 20.781060606060606
    },
    {
      "title": "OECD Slashes Global Economic Forecasts Amid Tariffs, Trade Uncertainty",
      "content": "OECD Chief Economist Alvaro Santos Pereira discusses the Paris-based organization's decision to slash its global economic growth forecast to 2.9% this year, down from 3.3% in 2024. \"There's been a huge increase in trade and economic policy uncertainty,\" he tells Bloomberg Television.",
      "source": "youtube.com",
      "rawDate": "2025-06-03 05:40:39",
      "date": "03/06/2025",
      "time": "05:40",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://www.youtube.com/watch?v=E-sUVQdcV3A",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 19.91010101010101
    },
    {
      "title": "OECD chops U.S. growth forecasts, cites risks to the downside as tariffs bite",
      "content": "The Paris-based global policy forum now sees U.S. growth at just 1.6% this year, and global growth at 2.9%.",
      "source": "marketwatch.com",
      "rawDate": "2025-06-03 05:02:00",
      "date": "03/06/2025",
      "time": "05:02",
      "category": "economy",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.marketwatch.com/story/oecd-chops-u-s-growth-forecasts-cites-risks-to-the-downside-as-tariffs-bite-42be736c",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": [
          "blocs"
        ]
      },
      "source_type": "general_news",
      "importance_score": 10.130555555555556
    }
  ],
  "uk": [
    {
      "title": "US lawmakers criticise UK backdoor order to Apple, warn of cybercriminal risks",
      "content": "U.S. House Judiciary Chair Jim Jordan and Foreign Affairs Chair Brian Mast warned Britain on Wednesday that its order to Apple to create a backdoor to its encrypted user data could be exploited by cybercriminals and authoritarian regimes.",
      "source": "reuters.com",
      "rawDate": "2025-05-07 15:31:36",
      "date": "07/05/2025",
      "time": "15:31",
      "category": "tech",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-lawmakers-criticise-uk-backdoor-order-apple-warn-cybercriminal-risks-2025-05-07/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 38.02474747474747
    },
    {
      "title": "With Trillions Coming Into the United States One Investment Says ‘Buy’",
      "content": "A perfect storm of the greatest financial opportunities of our lifetimes may be before us, with unprecedented amounts of foreign capital, 18 trade deals in the final stages of negotiation, and upcoming tax cuts. Nearly $3 trillion of investment commitments in AI have been announced, which span a period of years. Oracle, NVIDIA, and Apple are major players, along with the UAE, Open AI, and Softbank.Risk is present from China producing less expensive or more powerful chips, or imposing trade restrictions that could greatly impact our tech companies. However, the US is striving to be the dominant world leader of AI, for which It does not take a genius to consider long term holds for Oracle, NVIDIA, and Apple. In the last 5 weeks NVIDIA has risen 23.6%, up from a low of 94, to 116. However, that is well under their 2025 highpoint of 149. Similarly, the 2025 high of Oracle was 186, but currently is 150, while Apple has dropped 61 points since the day after Christmas, and is now 198, down 23.5%. Although we may see some significant volatility with trade negotiations in the short term, for the coming years, I would expect the large domestic investments made by these key tech companies to produce excellent returns. Also, Taiwan Semiconductors is investing $100 billion for producing their chips here, and that stock is down over 21% in the last 2 ½ months. Likely this would also be a very good hold.What do AI data centers need? Electricity! By 2030, AI data centers are estimated to require 9% of total electricity usage in the United States, with overall demand for electricity projected to increase by 16%. AI data centers are planned for Texas, Louisiana, Ohio, North Carolina, and other areas, for which one might look at providers of electricity in those states. Oncor, that is owned by Sempra, is a major servicer of Texas. The parent company is one of the largest utility holding companies in the US, with current pricing of $75 per share, which is down from $87 in early January, and is paying a dividend of 3.4%. American Electric Power (AEP) is headquartered in Columbus, Ohio, for which that stock is up almost 14% this year, and paying a current dividend yield of 3.54%. AEP exceeded analyst expectations of earnings per share by 8.1%, while Ohio is experiencing growth with favorable tax legislation. Several AI data centers are planned for south Florida, while Florida has experienced tremendous population growth, gaining nearly 2 million more residents since 2019. When speaking of electricity to power Florida, one might consider investments in Nexterra, that owns Florida Power and Light, the largest utility in the state, and has a dividend yield of 3.22%. I also am an advocate for Duke Energy, which is held by numerous pension funds. Duke is one of the three great universities of Research Triangle Park, along with the University of North Carolina and North Carolina State. This area of the country has one of the highest concentrations of PhD’s, for which Apple and others are investing in data centers in North Carolina. Duke Energy is up about 12% in 2025, which is excellent for a bit over 4 months, and has a dividend yield of 3.47%.An additional component for not only the construction of AI data centers, but for the expansion of many industries that will benefit from the huge investments being made in the US, is&#8230; infrastructure! This leads one to ETFs for materials. One might take a look at XLB, Vanguard Materials (VAW), and Invesco (PYZ).What is driving both foreign and domestic investment in the US, is the likely legislation of tax cuts, combined with no tariffs for producing goods in the United States. This is a one-two punch for an economic stimulus, along with 18 trade deals being in the stages of final negotiation, which hopefully will dramatically increase US production and exports.This is the first in a series of articles to capitalize on the trillions of dollars of investment commitments that have been announced in recent weeks, along with a multitude of trade deals and tax cut legislation that should be forthcoming. The phrase that comes to mind is that the best time is… NOW!I encourage the reader to do their own research, and to consult with a competent investment advisor. The post With Trillions Coming Into the United States One Investment Says &#8216;Buy&#8217; appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-14 16:13:32",
      "date": "14/05/2025",
      "time": "16:13",
      "category": "tech",
      "impact": "positive",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/05/14/with-trillions-coming-into-the-united-states-one-investment-says-buy/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.621212121212125
    },
    {
      "title": "Live Nasdaq Composite: Markets in Freefall Amid EU Tariff Tussle",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Interest Rate Cuts in Flux 9:56 am by Gerelyn Terzo Chicago Fed President Austan Goolsbee stated Friday that President Donald Trump&#8217;s recent tariff actions have thrown a wrench into monetary policy likely delaying any adjustments to interest rates. He told CNBC: &#8220;Everything’s always on the table. But I feel like the bar for me is a little higher for action in any direction while we’re waiting to get some clarity.&#8221; This article will be updated throughout the day, so check back often for more daily updates. The markets are in freefall on Friday, with all three of the major stock market averages lower by at least 1%. The markets are poised to end the week on a negative note after President Trump threatened to impose a steep 50% tariff on the EU, which could take effect in the coming days. The Dow Jones Industrial Average is reeling by over 400 points, while the Nasdaq Composite and S&amp;P 500 are similarly down 1% today. Most sectors of the economy are trading lower, with the worst declines seen in consumer discretionary and technology stocks. Treasury yields are falling as the trade war reignites, capping off a roller coaster week for the bond market. Volatility has also returned to the stock market, as evidenced by a 25% increase in the CBOE Volatility Index (VIX). Additionally, Apple (Nasdaq: AAPL) has a target on its back after President Trump also cautioned that iPhones made outside of the U.S. could be subject to heavy tariffs. Apple stock is down 2% today. In a bright spot for the Magnificent Seven stocks, influential Wedbush analyst Dan Ives is bullish on Tesla (Nasdaq: TSLA), lifting his price target on the EV maker to $500, reflecting 49% upside potential, with an &#8220;outperform&#8221; rating attached. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 400.50 (-0.96%) Nasdaq Composite: Down 309.43 (-1.6%) S&amp;P 500: Down 66.80 (-1.1%) Market Movers Nuclear stocks are bucking the downward trend today and gaining ground as the Trump administration looks to implement favorable conditions for the industry. Stocks including Oklo (NYSE: OKLO), NuScale (NYSE: SMR) and Constellation Energy (Nasdaq: CEG) are all advancing today, led by a double-digit percentage gain for OKLO. Quantum computing stock IonQ (NYSE: IONQ) fell as much as 4.7% today, following yesterday&#8217;s rally that saw the share price close above $45. The post Live Nasdaq Composite: Markets in Freefall Amid EU Tariff Tussle appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-23 10:00:52",
      "date": "23/05/2025",
      "time": "10:00",
      "category": "tech",
      "impact": "neutral",
      "country": "uk",
      "url": "https://247wallst.com/investing/2025/05/23/live-nasdaq-composite-markets-in-freefall-amid-eu-tariff-tussle/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 31.439393939393938
    },
    {
      "title": "How the US can avoid a recession",
      "content": "US President Trump announced a finalized trade deal with the UK on Thursday. Rockland Trust vice president and portfolio manager Michael Sayers tells Josh Lipton and Julie Hyman on Market Domination Overtime that he was \"underwhelmed\" by the trade agreement.",
      "source": "youtube.com",
      "rawDate": "2025-05-09 18:23:27",
      "date": "09/05/2025",
      "time": "18:23",
      "category": "economy",
      "impact": "negative",
      "country": "uk",
      "url": "https://www.youtube.com/watch?v=3NbyusKYxPk",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 19.186363636363637
    },
    {
      "title": "UK escapes Trump's increased 50% tariffs - but White House warns the exemption is conditional",
      "content": "The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned.",
      "source": "news.sky.com",
      "rawDate": "2025-06-04 02:55:36",
      "date": "04/06/2025",
      "time": "02:55",
      "category": "companies",
      "impact": "positive",
      "country": "uk",
      "url": "https://news.sky.com/story/trade-war-uk-exemption-from-50-steel-tariffs-is-conditional-trump-warns-13378892",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 17.84873737373737
    },
    {
      "title": "FTSE Russell releases preliminary 2025 US Indexes Reconstitution list",
      "content": "FTSE Russell has released the preliminary list of additions and deletions for its 2025 Russell US Indexes Reconstitution, marking the beginning of an annual process that updates the composition of its widely followed benchmarks. The reconstitution, based on April 30 market data, reflects shifts in company size, sector composition, and style classifications.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-05-26 10:30:03",
      "date": "26/05/2025",
      "time": "10:30",
      "category": "markets",
      "impact": "neutral",
      "country": "uk",
      "url": "https://www.proactiveinvestors.com/companies/news/1071852",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 15.588131313131312
    },
    {
      "title": "Why JP Morgan thinks Apple can regain momentum in coming months",
      "content": "JP Morgan believes Apple stock might get its mojo back in the next few months due to historical data, the upcoming iPhone 17 release, and lukewarm expectations from Apple's conference, which the company can surpass and impress investors.",
      "source": "invezz.com",
      "rawDate": "2025-06-05 13:58:07",
      "date": "05/06/2025",
      "time": "13:58",
      "category": "tech",
      "impact": "positive",
      "country": "uk",
      "url": "https://invezz.com/news/2025/06/05/why-jp-morgan-thinks-apple-can-regain-momentum-in-coming-months/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.567424242424241
    }
  ],
  "germany": [
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Apple in Crosshairs 2:11 pm by Gerelyn Terzo Apple (Nasdaq: AAPL) stock has a target on its back. Wall Street firm Needham has downgraded shares of the Big Tech stock to &#8220;hold&#8221; from &#8220;buy,&#8221; arguing the stock is hovering at frothy levels. Needham also pulled its $225 price target, noting a $170-$180 range would be an acceptable entry point. Apple shares were largely unchanged today, while the SPY ETF is up 0.26%. Citi Takes Aim at CEG 11:35 am by Gerelyn Terzo Wall Street analyst firm Citi has reduced its rating on Constellation Energy (NYSE: CEG) shares in response to the utility&#8217;s long-term power agreement with Mag 7 stock Meta (Nasdaq: META). Analysts at Citi now classify CEG stock as high-risk, arguing that the company will forgo the opportunity for premium pricing on its nuclear-generated electricity. They have set a price target of $318. CEG shares are falling 3% today after yesterday&#8217;s rock-star performance. The SPY ETF is up 0.16% as of mid-morning trading. S&amp;P Outlook Looking Up 10:05 am by Gerelyn Terzo With the first half of 2025 almost behind us, Wall Street analysts are actively revising their year-end market forecasts. Most recently, Barclays has adjusted its S&amp;P 500 year-end outlook upward by nearly 3% to 6,050, a notable increase from its previous target of 5,900. Beyond Barclays, other prominent analyst firms like Deutsche Bank and RBC have also recently elevated their 2025 S&amp;P 500 targets, signaling a positively shifting consensus for the broader market&#8217;s direction. This article will be updated throughout the day, so check back often for more daily updates. Market optimism is overriding underwhelming labor market data, with all three major stock averages climbing higher as of morning trading. Yesterday, equities staged a turnaround, as the Dow Jones Industrial Average notched its fourth consecutive winning session, while the tech-heavy Nasdaq Composite and S&amp;P 500 also advanced. Today, most economic sectors are in positive territory, with technology leading the charge with a 1.48% gain. The SPDR S&amp;P 500 ETF (SPY) is up 0.11%) Nvidia (Nasdaq: NVDA) has surpassed Microsoft (Nasdaq: MSFT) to reclaim its position as the world&#8217;s most valuable company, now boasting a market capitalization of $3.45 trillion. Traders and investors are betting whether NVDA stock can clinch new highs soon. Private Payrolls Slow, Sparking Rate Cut Calls Private sector hiring lost significant momentum in May, with payrolls expanding by a mere 37,000 jobs. These results not only fell short of April&#8217;s 60,000 gain but also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. Following this weaker-than-expected private sector jobs data, President Trump is increasing pressure on Jerome Powell to lower interest rates, asserting that the Fed chairman should have already taken this action. Discount Retailers Rally, ON Semi Recovers Dollar General (NYSE: DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on the back of a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is also gaining 6% today, buoyed by similarly upbeat guidance. ON Semi (Nasdaq: ON) is climbing 2.7% today, recouping some recently lost ground. This comes after Morgan Stanley analysts recently indicated that much of the negative sentiment is already factored into ON&#8217;s stock price. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Show Resilience in Face of Sputtering Economy appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/sp-500-nysearca-spy-live-markets-show-resilience-in-face-of-sputtering-economy/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 59.015151515151516
    },
    {
      "title": "Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Sour Apple 2:05 pm by Gerelyn Terzo One Wall Street analyst firm is taking aim at Big Tech stock Apple (Nasdaq: AAPL). Needham analysts believe AAPL shares are too frothy, downgrading shares to &#8220;hold&#8221; from &#8220;buy.&#8221; The analyst firm also withdrew its price target of $225 per share, saying that the $170-$180 range reflects a more reasonable entry point. AAPL shares are relatively flat today. The Nasdaq Composite is holding onto a gain of 0.43%. Citi Downgrades This Nuclear Stock 11:30 am by Gerelyn Terzo Wall Street firm Citi has downgraded shares of Constellation Energy (NYSE: CEG) on the heels of the utility&#8217;s long-term power arrangement with Big Tech company Meta (Nasdaq: META). Citi analysts attached a high-risk label to CEG stock, saying that it will miss out on premium pricing for its nuclear power, with a price target of $318. After yesterday&#8217;s rally, CEG shares are falling 2.8% today. The Nasdaq Composite is up 0.25% as of mid-morning trading. Wall Street Improves Market Outlook 9:51 am by Gerelyn Terzo With the first half of 2025 nearly in the rearview mirror, Wall Street analysts are coming out in droves to revise their year-end forecasts. Most recently, Barclays has updated its S&amp;P 500 year-end outlook by close to 3% to 6,050 compared with a previous target of below 6,000. In addition to Barclays, other analysts firms that have lifted their 2025 S&amp;P 500 targets of late include Deutsche Bank and RBC. This article will be updated throughout the day, so check back often for more daily updates. The markets appear to be shrugging off some lackluster labor market data, with all three of the major stock market averages higher as of early morning trading. Yesterday, the markets managed to turn things around, with the Dow Jones Industrial Average tacking on its fourth-straight winning session while the tech-heavy Nasdaq Composite and S&amp;P 500 also gained ground. Today, most sectors of the economy are higher, led by technology with a 1.48% advance. Nvidia&#8217;s (Nasdaq: NVDA) muscled Microsoft (Nasdaq: MSFT) out of the way to reclaim the top of the most valuable company in the world rankings, with a market capitalization of $3.45 trillion. Traders are debating whether NVDA stock will see new highs in the near future. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 62.83 (+0.22%) Nasdaq Composite: Up 50.28 (+0.26%) S&amp;P 500: Up 14.10 (+0.24%) Economic Headwinds Private sector hiring lost momentum in May, with payrolls expanding by a mere 37,000 jobs. Results fell short of April&#8217;s 60,000 gain and also missed the Dow Jones forecast of 110,000 by a wide margin. In a sobering sign for the labor market, it marked the lowest monthly job creation from the ADP report in over two years. Meanwhile, the picture for wages remained largely static compared with the prior month&#8217;s results. President Trump is increasing pressure on Jerome Powell to lower interest rates following the weaker-than-expected private sector jobs data, saying the Fed chairman should have already taken this action. Market Movers Dollar General (NYSE:DG) is racing ahead by 15.8% today, extending yesterday&#8217;s gains on a positive full-year outlook. Fellow discount retailer Dollar Tree (NYSE: DLTR) is gaining 6% on the day on similarly upbeat guidance. ON Semi (Nasdaq: ON) is gaining 2.7% today, recouping some recently lost ground. Morgan Stanley analysts recently said that negativity is already priced into ON stock. The post Live Nasdaq Composite: Markets Look to Extend Gains Despite Economic Headwinds appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-06-04 16:10:02",
      "date": "04/06/2025",
      "time": "16:10",
      "category": "crypto",
      "impact": "neutral",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/06/04/live-nasdaq-composite-markets-look-to-extend-gains-despite-economic-headwinds/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 56.36363636363637
    },
    {
      "title": "Euro zone inflation falls to cooler-than-expected 1.9% in May, below ECB target",
      "content": "Economists polled by Reuters had been expecting the May reading to come in at 2%, which is the European Central Bank's target.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 05:04:56",
      "date": "03/06/2025",
      "time": "05:04",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/06/03/euro-zone-inflation-may-2025.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 47.74393939393939
    },
    {
      "title": "Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher",
      "content": "Live Updates Live Coverage Updates appear automatically as they are published. Bonds on Sale 1:19 pm The Treasury&#8217;s auction of 5-year notes has concluded. Paying 4% interest, the $70 billion in notes sold at an average yield of 4.07%, indicating a small 1.7% discount to face value. At the Right Price, Investors Still Love T-Bills 11:52 am $70 billion worth of 5-year Treasury notes are about to go on auction, and demand looks healthy even as yields rise. (Which makes sense. Higher yields imply lower prices, and everybody likes a bargain, even when we&#8217;re talking about U.S. government debt). 2-year Treasuries went on sale yesterday, and demand was described similarly as &#8220;solid.&#8221; The Dow is still down 0.3%. Apple and iPhones in Focus 11:17 am Dow component company Apple (Nasdaq: APPL) is in focus today as Loop Capital analyst Ananda Baruah reiterates a hold rating and $215 price target on the tech stock. &#8220;Tariff actions&#8221; are pulling demand for iPhones forward into the March and June quarters as investors hedge against the risk President Trump is serious about imposing 25% tariffs on imported iPhones. Further out, the analyst is looking ahead to the expected iPhone 17 launch. Apple has raised its estimates for iPhone 17 shipments in Q4, and iPhone average selling prices are also moving higher. Apple stock is up about 0.5% today. But the Dow Jones Industrial Average has turned red, now down 0.3%. This article will be updated throughout the day, so check back often for more daily updates. President Trump alarmed investors last week when he threatened to impose a 50% tariff on imports from the European Union as early as June 1. On Monday, the President backtracked, saying the tariffs won&#8217;t actually go into effect until July 9. Even more optimistically, he confirmed efforts are afoot to &#8220;quickly establish meeting dates&#8221; with EU negotiators to lower tariff barriers and &#8220;open up the European Nations for Trade with the United States of America.&#8221; In more troubling news, there&#8217;s trouble brewing at the White House today as Elon Musk, who spearheaded President Trump&#8217;s Department of Government Efficiency (DOGE) efforts, says he&#8217;s &#8220;disappointed&#8221; with &#8220;the massive spending bill&#8221; that the President sent to Congress last week, and that the House of Representatives has now passed. The bill, says Musk, &#8220;increases the budget deficit&#8221; and &#8220;undermines the work that the Doge team is doing.&#8221; Not good. Nevertheless, after soaring 700 points yesterday, the Dow Jones Industrial Average (DJINDICES: ^DJI) is up another 65 points today for a nearly 0.2 % gain. Earnings Abercrombie &amp; Fitch (NYSE: ANF) reported an earnings beat today, $1.59 per share earned in Q1, which was $0.20 better than expected. The retail clothing chain stock is up nearly 27% currently. Macy&#8217;s (NYSE: M) &#8220;beat earnings by a penny,&#8221; reporting $0.16 per share in Q1 profit. Macy&#8217;s stock is down almost 4%. Both companies cut guidance after reporting their beats. Abercrombie predicts it will earn between $9.50 and $10.50 this year. Macy&#8217;s says full year earnings will range from $1.60 to $2. Both earnings ranges are broadly below analyst forecasts, implying no more earnings beats this year. Dick&#8217;s Sporting Goods (NYSE: DKS) meanwhile reported $3.37 per share this morning. The number beat analyst forecasts. Even better, guidance at Dick&#8217;s calls for $13.80 to $14.40 per share earned this year. At the midpoint, that&#8217;s less than Wall Street&#8217;s forecast $14.34, but the &#8220;$14.40&#8221; number at least implies there&#8217;s a chance Dick&#8217;s will beat estimates this year. The post Dow Jones Live Update May 28: Dow Jones Industrial Average (DJI) Opens Higher appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-28 14:06:21",
      "date": "28/05/2025",
      "time": "14:06",
      "category": "crypto",
      "impact": "positive",
      "country": "germany",
      "url": "https://247wallst.com/investing/2025/05/28/dow-jones-live-update-may-28-dow-jones-industrial-average-dji-opens-higher/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 46.333333333333336
    },
    {
      "title": "The EU's top exports, most vulnerable to Trump's new tariffs",
      "content": "U.S. President Donald Trump on Friday once again threatened to ramp up his trade war, recommending a 50% tariff on European Union goods starting June 1, sending European stocks tumbling.",
      "source": "reuters.com",
      "rawDate": "2025-05-23 13:54:23",
      "date": "23/05/2025",
      "time": "13:54",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/business/autos-transportation/eus-top-exports-most-vulnerable-trumps-new-tariffs-2025-05-23/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 41.834848484848486
    },
    {
      "title": "Epic Games' Fortnite back up on Apple app store in US, Epic gamestore in EU",
      "content": "Epic Games' \"Fortnite\" video game was available again in the U.S. on Apple's App Store and on the Epic Games Store and AltStore in the European Union, the company said on Tuesday.",
      "source": "reuters.com",
      "rawDate": "2025-05-20 18:30:33",
      "date": "20/05/2025",
      "time": "18:30",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.reuters.com/technology/epic-games-fortnite-back-up-apple-app-store-us-epic-gamestore-eu-2025-05-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 34.7699494949495
    },
    {
      "title": "CNBC Daily Open: Europe is already responding to Trump tariffs",
      "content": "U.S. futures jumped Monday night stateside on Trump's delay of 50% tariffs on the European Union. Analysts are warning investors not to let optimism over Trump's postponement of EU tariffs run unchecked.",
      "source": "cnbc.com",
      "rawDate": "2025-05-26 21:26:40",
      "date": "26/05/2025",
      "time": "21:26",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.cnbc.com/2025/05/27/cnbc-daily-open-europe-is-already-responding-to-trump-tariffs.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 32.44267676767677
    },
    {
      "title": "Apple blocks Fortnite game in US, EU stores, Epic Games says",
      "content": "Epic Games said on Friday that Apple has blocked its \"Fortnite\" video game on its store in the European Union and the iPhone maker's U.S. app store.",
      "source": "reuters.com",
      "rawDate": "2025-05-16 05:06:43",
      "date": "16/05/2025",
      "time": "05:06",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.reuters.com/sustainability/apple-blocks-fortnite-game-us-eu-stores-epic-games-says-2025-05-16/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.229292929292924
    },
    {
      "title": "Trump Loves Europe's Rate Cuts. Why the Fed Should Take Cover.",
      "content": "The ECB is widely expected to lower interest rates for the eighth consecutive meeting.",
      "source": "barrons.com",
      "rawDate": "2025-06-04 20:15:00",
      "date": "04/06/2025",
      "time": "20:15",
      "category": "economy",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.barrons.com/articles/trump-fed-ecb-interest-rate-27cbf628",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 27.117676767676766
    },
    {
      "title": "Smart Trackers Strategic Business Report 2024-2025 & 2030, Competitive Analysis of Apple, Chipolo doo, Cube Tracker, Jiobit, Kaltio, Lil Tracker, Pebblebee, Rope Innovation, Samsung, Shenzhen Coban",
      "content": "Understand the significant growth trajectory of the Consumer Products End-Use segment, which is expected to reach US$952.2 Million by 2030 with a CAGR of a 8.9%. The Pets End-Use segment is also set to grow at 7.6% CAGR over the analysis period. Gain insights into the U.S. market, valued at $276.6 Million in 2024, and China, forecasted to grow at an impressive 11.5% CAGR to reach $338.5 Million by 2030. Discover growth trends in other key regions, including Japan, Canada, Germany, and the Asia-Pacific. Understand the significant growth trajectory of the Consumer Products End-Use segment, which is expected to reach US$952.2 Million by 2030 with a CAGR of a 8.9%. The Pets End-Use segment is also set to grow at 7.6% CAGR over the analysis period. Gain insights into the U.S. market, valued at $276.6 Million in 2024, and China, forecasted to grow at an impressive 11.5% CAGR to reach $338.5 Million by 2030. Discover growth trends in other key regions, including Japan, Canada, Germany, and the Asia-Pacific.",
      "source": "globenewswire.com",
      "rawDate": "2025-05-14 11:16:00",
      "date": "14/05/2025",
      "time": "11:16",
      "category": "tech",
      "impact": "positive",
      "country": "germany",
      "url": "https://www.globenewswire.com/news-release/2025/05/14/3081353/28124/en/Smart-Trackers-Strategic-Business-Report-2024-2025-2030-Competitive-Analysis-of-Apple-Chipolo-doo-Cube-Tracker-Jiobit-Kaltio-Lil-Tracker-Pebblebee-Rope-Innovation-Samsung-Shenzhen-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 26.819444444444443
    },
    {
      "title": "Dax Index News: Trade Talks and Fed Outlook Dictate DAX Forecast This Week",
      "content": "Traders eye US services PMI and ADP data as sentiment toward the DAX hinges on Fed rate cues and EU tariff negotiations.",
      "source": "fxempire.com",
      "rawDate": "2025-06-04 01:00:26",
      "date": "04/06/2025",
      "time": "01:00",
      "category": "economy",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.fxempire.com/forecasts/article/dax-index-news-trade-talks-and-fed-outlook-dictate-dax-forecast-this-week-1523616",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 22.575757575757574
    },
    {
      "title": "Week Ahead for FX, Bonds: U.S. Jobs Data, Likely ECB Rate Cut in Focus",
      "content": "U.S. monthly jobs data for May on Friday will be key for investors as they assess the impact of U.S. tariffs on the jobs market.",
      "source": "wsj.com",
      "rawDate": "2025-05-30 13:02:00",
      "date": "30/05/2025",
      "time": "13:02",
      "category": "markets",
      "impact": "negative",
      "country": "germany",
      "url": "https://www.wsj.com/economy/week-ahead-for-fx-bonds-u-s-jobs-data-likely-ecb-rate-cut-in-focus-06a861b0",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": [
          "europe"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.476767676767675
    },
    {
      "title": "Trump threatens 50% EU tariff, nuclear energy executive orders, Supreme Court ruling to protect Fed",
      "content": "Morning Brief hosts Madison Mills and Brad Smith cover several of the day's developing market stories for Friday, May 23. Asterozoa Capital CIO Joe Hegener and Bipartisan Policy Center Director of Economic Policy Shai Akabas come on to talk about the economic impacts of President Trump threatening new tariffs, including a proposed 50% levy against the European Union.",
      "source": "youtube.com",
      "rawDate": "2025-05-23 12:00:56",
      "date": "23/05/2025",
      "time": "12:00",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.youtube.com/watch?v=WIzdEYR1QZM",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "energy"
        ],
        "regions": [
          "europe",
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 16.525
    },
    {
      "title": "Apple Appeals European Commission Order on Interoperability With Competitors' Products",
      "content": "Apple reportedly filed an appeal against an order from the European Union's antitrust regulator that requires the company to make its iOS operating system more compatible with other companies' products. The company filed its appeal Friday (May 30) at the EU's General Court in Luxembourg, The Wall Street Journal (WSJ) reported Monday (June 2).",
      "source": "pymnts.com",
      "rawDate": "2025-06-02 13:43:17",
      "date": "02/06/2025",
      "time": "13:43",
      "category": "tech",
      "impact": "neutral",
      "country": "germany",
      "url": "https://www.pymnts.com/apple/2025/apple-appeals-european-commission-order-on-interoperability-with-competitors-products/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 15.561616161616161
    },
    {
      "title": "Goldman Sachs Cuts Tesla Price Target on Weaker Global Delivery Trends",
      "content": "<p>Goldman Sachs trimmed its price target on <a href='https://financialmodelingprep.com/financial-summary/TSLA'>Tesla (NASDAQ:TSLA)</a> to $285 from $295, maintaining a Neutral stance amid signs of softening vehicle demand across key markets. The firm lowered its second-quarter delivery estimate to 365,000 units—down from a previous forecast of 410,000 and below the market consensus of 417,000.</p>\n<p>The adjustment follows lackluster regional data: U.S. deliveries through May were down by mid-teens year-over-year, while April registrations in Europe fell roughly 50%. Early May figures also point to continued weakness. In China, growth was marginal on a sequential basis, but sales in April and May combined were still about 20% lower than a year ago.</p>\n<p>Surveys from HundredX and Morning Consult indicated a drop in consumer sentiment toward Tesla, further justifying the revised projections. Goldman now expects Q2 deliveries to fall between 335,000 and 395,000, depending on how much Tesla leans on incentives in June. Lower EPS expectations have also been factored into the updated valuation.</p>\n",
      "source": "Financial Modeling Prep",
      "rawDate": "2025-06-06 15:02:00",
      "date": "06/06/2025",
      "time": "15:02",
      "category": "tech",
      "impact": "negative",
      "country": "germany",
      "url": "https://financialmodelingprep.com/market-news/fmp-goldman-sachs-cuts-tesla-price-target-on-weaker-global-delivery-trends",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "fmp_articles",
      "importance_score": 15.212878787878788
    }
  ],
  "china": [
    {
      "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Under Pressure Amid Consumer Weariness",
      "content": "Live Updates Live Coverage Has Ended OpenAI Looks to Future of AI 1:15 pm by Gerelyn Terzo OpenAI has announced it&#8217;s acquiring Jony Ive&#8217;s AI devices startup in a $6.4 billion deal, which includes OpenAI&#8217;s existing stake. In a related move, OpenAI is reportedly entrusting its creative and design leadership to Ive and his design firm, LoveFrom. Ive, widely recognized as the visionary behind the iPhone, alongside OpenAI CEO Sam Altman, will focus on crafting consumer devices and other projects that aim to shape the future look and feel of artificial intelligence. NFLX Stock Clinches New All-Time High Despite Analyst Downgrade 11:45 am by Gerelyn Terzo Netflix (Nasdaq: NFLX) stock is rising 1.5% today to above $1,200 per share for a market cap of $514.3 billion, clinching a fresh all-time high. JPMorgan analysts are sending mixed messages, downgrading NFLX shares to &#8220;neutral&#8221; from &#8220;overweight&#8221; but raising the price target to $1,220 per share, reflecting about 1% upside potential from current levels. The SPY ETF is currently down by 0.18%. UnitedHealth Woes Grow 10:30 am by Gerelyn Terzo UnitedHealth Group (NYSE: UNH) stock is experiencing a further decline today, dropping 4.3% and adding to its recent struggles. Analysts at HSBC recently downgraded the healthcare giant, citing earnings risks and suggesting that any recovery for the battered stock could be &#8220;delayed.&#8221; This follows the company&#8217;s CEO stepping down in recent weeks. CFRA was an early mover, downgrading UNH shares to a &#8220;sell&#8221; back in Q1 and sounding an early warning on the stock. Overall, UNH stock has fallen 39.3% year-to-date. The SPY ETF remains under pressure and is down 0.51% at last check. This article will be updated throughout the day, so check back often for more daily updates. Markets are widening their losses today, with all three major stock market averages trading lower right out of the gate. Bond yields are on the rise, pushing the 30-year Treasury yield past the 5% mark. The Dow Jones Industrial Average is sinking by over 300 points, while both the tech-heavy Nasdaq Composite and S&amp;P 500 are each shedding approximately 0.55%. The SPY ETF trading lower by 0.45%. Bucking the downward trend, Google parent company Alphabet (Nasdaq: GOOGL) stands out, climbing 1.8% today. The tech giant, currently hosting its I/O developer event in California, has showcased new innovations like Android XR glasses and real-time translation in Google Meets, and hinted at a paid subscription tier for AI users. Meanwhile, Nvidia (Nasdaq: NVDA) CEO Jensen Huang expressed approval for the Trump administration&#8217;s updated curbs on AI chip exports to China. Discount retailer Target (NYSE: TGT) delivered disappointing quarterly results, including a 2.8% slide in sales. The retailer further lowered its full-year outlook, attributing the cautious forecast to consumer uncertainty surrounding tariffs, and is now bracing for a low single-digit sales decline for the current fiscal year. Consequently, Target&#8217;s stock is losing 6.8% today. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 345.16 (-0.81%) Nasdaq Composite: Down 38.21 (-0.20%) S&amp;P 500: Down 30.26 (-0.51%) Market Movers Retailers are on the move. TJX Companies (NYSE: TJX), parent of brands like TJ Maxx, managed to surpass Wall Street&#8217;s sales estimates but opted to keep its full-year guidance unchanged. TJX appears to be benefiting from the current economic climate as consumers adjust spending habits and increasingly opt for lower-priced brand items. In other individual stock movements, Palo Alto Networks (Nasdaq: PANW) is down 6.9% today following its Q3 results. Despite this, Morningstar analysts suggest the cybersecurity firm is gaining significant market share. Super Micro Computer (Nasdaq: SMCI) is advancing 2.7% as the company weighs investing in a U.S. expansion. Fair Isaac Corp (NYSE: FICO) has plunged 11% today after a federal housing official raised questions about its pricing model. This comes in a significant week for the housing sector, with key existing and new home sales data anticipated later. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Under Pressure Amid Consumer Weariness appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-22 11:09:08",
      "date": "22/05/2025",
      "time": "11:09",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/05/21/sp-500-nysearca-spy-live-markets-under-pressure-amid-consumer-weariness/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 65.80303030303031
    },
    {
      "title": "S&P 500 INDEX (SPX) Live: Markets Pare Losses in Face of Credit Downgrade",
      "content": "Live Updates Live Coverage Has Ended Jamie Dimon on the Risk of Inflation and Deflation 3:23 pm by Gerelyn Terzo The markets have recouped most of their losses, with the SPX now down a modest 0.03%. JPMorgan CEO Jamie Dimon believes the risks around the threat of both inflation and deflation have yet to surface in stock market values. He said at an event in New York, “We have huge deficits; we have what I consider almost complacent central banks. You all think they can manage all this. I don’t think” they can&#8230;“My own view is people feel pretty good because you haven’t [yet] seen effective tariffs&#8230;The market came down 10%, [it’s] back up 10%; that’s an extraordinary amount of complacency.&#8221; Ray Dalio Comments on US Debt 11:58 am by Gerelyn Terzo Ray Dalio, founder of Bridgewater Associates, reportedly raised a flag that Moody&#8217;s downgrade of the U.S. sovereign credit rating misses a crucial point regarding the vulnerability of U.S. Treasuries. According to Dalio, the credit agency&#8217;s analysis fails to account for the inherent risk of the federal government resorting to money printing to service its massive debt. While Treasury yields rise, the markets remain under pressure, including a 0.17% decline in the SPX ETF. Retail Stocks in Focus 10:57 am by Gerelyn Terzo This week, the market&#8217;s focus pivots to corporate earnings, with reports due from major players like Home Depot (NYSE: HD), Target (NYSE: TGT) and TJX Companies (NYSE: TJX). Notably, TJX stock has already climbed 11% this year so far. Comparable store sales figures will be under close examination amid ongoing high interest rates as well as signs of cooling inflation. This article will be updated throughout the day, so check back often for more daily updates. The markets are narrowing their declines in the face of a U.S. debt downgrade by one of the credit rating agencies. Moody&#8217;s lowered its view of U.S. debt by a single notch to to Aa1, down from the highest possible rating. Moody&#8217;s blamed the persistent budget deficit and high interest rates, a view challenged by President Trump, who affirmed global confidence in the U.S. economy. The credit downgrade adds insult to injury following a week in which the S&amp;P 500 advanced 5%. Atlanta Fed President Raphael Bostic told CNBC he predicts one interest rate cut in 2025 as the economy continues to stave off a recession. The central bank has tipped its hand to a possible two rate cuts this year. Today&#8217;s credit downgrade sent Treasury yields higher, with the 30-year Treasury surpassing the 5% threshold, and weighed heavily on equities. While the SPX ETF is currently down slightly, the three major averages are showing signs of resilience, paring back their earlier losses as the morning progresses. The broader technology sector is currently down 1.4%. The prominent Magnificent Seven stocks are mostly in the red, including a 2.8% decline in Apple (Nasdaq: AAPL) stock amid ongoing regulatory scrutiny of its proposed AI partnership with China&#8217;s Alibaba. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 44.18 (-0.10%) Nasdaq Composite: Down 103.54 (-0.54%) S&amp;P 500: Down 20.36 (-0.34%) Market Movers Walmart (NYSE: WMT) is down 2.3% after announcing potential price increases due to tariffs, a move countered by Treasury Secretary Scott Bessent&#8217;s suggestion that the retailer will &#8220;absorb some of the tariffs.&#8221; Palantir Technologies (Nasdaq: PLTR) has seen a 3.8% decline but remains close to its recent high of $130.18. Novavax (Nasdaq: NVAX) is a significant gainer, soaring 25.9% following regulatory approval for its COVID-19 vaccine. Reddit (NYSE: RDDT) shares are lower by 4.4% on the back of an analyst downgrade. Take-Two Interactive Software (Nasdaq: TTWO) is bucking the trend, climbing 3.7% after a price target increase from Wedbush Securities. The post S&#038;P 500 INDEX (SPX) Live: Markets Pare Losses in Face of Credit Downgrade appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-20 13:30:05",
      "date": "20/05/2025",
      "time": "13:30",
      "category": "crypto",
      "impact": "negative",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/05/19/sp-500-index-spx-live-markets-pare-losses-in-face-of-credit-downgrade/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 61.71212121212121
    },
    {
      "title": "Treasury yields soar on hope a recession will be avoided after temporary China-U.S. deal",
      "content": "U.S. Treasury yields moved higher on Monday as the U.S. and China successfully negotiated a trade deal to temporarily slash tariffs on each other's goods.",
      "source": "cnbc.com",
      "rawDate": "2025-05-12 07:55:02",
      "date": "12/05/2025",
      "time": "07:55",
      "category": "economy",
      "impact": "positive",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/12/us-treasury-yields-us-and-china-agree-to-slash-tariffs-.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "recession",
          "geopolitics"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 42.59444444444444
    },
    {
      "title": "Exclusive: Some Chinese companies eye Singapore listings to expand markets amid trade war",
      "content": "At least five companies from mainland China or Hong Kong are planning IPOs, dual listings, or share placements in Singapore in the next 12 to 18 months, four sources said, as Chinese firms look to expand in Southeast Asia amid global trade tensions.",
      "source": "reuters.com",
      "rawDate": "2025-05-17 19:04:37",
      "date": "17/05/2025",
      "time": "19:04",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/some-chinese-companies-eye-singapore-listings-expand-markets-amid-trade-war-2025-05-17/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.888636363636365
    },
    {
      "title": "Apple raises trade-in prices for iPhones in China to spur demand in key market",
      "content": "Apple on Friday raised the amount of money people can get off their next iPhone in China by trading in their old device. The move signals Apple's desire to spur more sales in China, where it has faced falling market share and declining sales amid tougher competition from Xiaomi and Huawei.",
      "source": "cnbc.com",
      "rawDate": "2025-05-23 03:45:03",
      "date": "23/05/2025",
      "time": "03:45",
      "category": "tech",
      "impact": "negative",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/23/apple-raises-trade-in-prices-for-iphones-in-china-as-amid-competition.html",
      "themes": {
        "macroeconomics": [
          "inflation",
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 40.66919191919192
    },
    {
      "title": "Investors cheer US-China tariff truce, but cautious over a final deal",
      "content": "A breakthrough in U.S.-China trade talks set off a relief rally in stocks on Monday and propelled the dollar higher, but investors fear further negotiations could prove a long slog, as risks of a global economic slowdown persist.",
      "source": "reuters.com",
      "rawDate": "2025-05-12 08:20:24",
      "date": "12/05/2025",
      "time": "08:20",
      "category": "economy",
      "impact": "negative",
      "country": "china",
      "url": "https://www.reuters.com/world/china/investors-cheer-us-china-tariff-truce-cautious-over-final-deal-2025-05-12/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 40.2270202020202
    },
    {
      "title": "Chinese e-commerce sites offer discounts of up to $351 on Apple's latest iPhones",
      "content": "Chinese e-commerce platforms are offering discounts of up to 2,530 yuan ($351) on Apple's latest iPhone 16 models, an effort to spur sales as first-quarter shipments by the U.S. tech giant fell further in its second-largest market.",
      "source": "reuters.com",
      "rawDate": "2025-05-14 01:22:32",
      "date": "14/05/2025",
      "time": "01:22",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/chinese-e-commerce-sites-offer-discounts-up-351-apples-latest-iphones-2025-05-14/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.56590909090909
    },
    {
      "title": "Treasury Secretary Bessent says he's likely to meet with China again in 'next few weeks' to work on bigger agreement",
      "content": "The comments come after the U.S. and China announced a 90-day pause on most of the tariffs the countries had imposed on one another.",
      "source": "cnbc.com",
      "rawDate": "2025-05-12 07:21:07",
      "date": "12/05/2025",
      "time": "07:21",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/12/treasury-secretary-bessent-says-hes-likely-to-meet-with-china-again-in-next-few-weeks.html",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "general_news",
      "importance_score": 35.36666666666667
    },
    {
      "title": "Apple and Alibaba's AI rollout in China delayed by Trump's trade war, FT reports",
      "content": "Apple and Alibaba's rollout of artificial intelligence services in China is being delayed by a Beijing regulator, the Financial Times reported on Wednesday.",
      "source": "reuters.com",
      "rawDate": "2025-06-04 11:56:07",
      "date": "04/06/2025",
      "time": "11:56",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/china/apple-alibabas-ai-rollout-china-delayed-by-trumps-trade-war-ft-reports-2025-06-04/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.35757575757576
    },
    {
      "title": "India approves Apple-supplier Foxconn's $433 million joint venture in bid to boost chip industry",
      "content": "The plant is expected to be operational in India's northern state of Uttar Pradesh by 2027 and will manufacture Foxconn's display driver chips, used in consumer electronics.  The deal comes as Apple suppliers increasingly look towards India as a way to reduce their reliance on China, amid tensions between Beijing and Washington.",
      "source": "cnbc.com",
      "rawDate": "2025-05-15 04:08:33",
      "date": "15/05/2025",
      "time": "04:08",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/15/india-approves-apple-supplier-foxconns-433-million-chip-joint-venture.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "industry"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 33.32575757575758
    },
    {
      "title": "Apple offers additional trade-in discounts for new iPhones in China",
      "content": "Apple is offering additional trade-in discounts for new iPhones in China until June 18, according to its website on Friday.",
      "source": "reuters.com",
      "rawDate": "2025-05-23 01:25:34",
      "date": "23/05/2025",
      "time": "01:25",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/business/media-telecom/apple-offers-additional-trade-in-discounts-new-iphones-china-2025-05-23/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.3719696969697
    },
    {
      "title": "Apple supplier Foxconn to invest $1.5 billion in India unit",
      "content": "Apple supplier Foxconn will invest 1.5 billion rupees in its India unit, the company said in a filing, as the iPhone maker shifts more manufacturing out of tariff-hit China.",
      "source": "reuters.com",
      "rawDate": "2025-05-20 01:47:53",
      "date": "20/05/2025",
      "time": "01:47",
      "category": "tech",
      "impact": "neutral",
      "country": "china",
      "url": "https://www.reuters.com/world/asia-pacific/apple-supplier-foxconn-invest-15-billion-india-unit-2025-05-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.26843434343434
    },
    {
      "title": "Magnificent 7 Stocks Live: Trade Talks Lead To Spiking Share Prices",
      "content": "Live Updates Live Coverage Has Ended The Magnificent 7 Could See Even More Upside 11:38 am While today’s 1,000-point Dow rally has been impressive, similar days may be ahead. When the U.S. and China meet again in the next few weeks, they’ll work out a bigger agreement on trade. While nothing has been set in stone with that just yet, markets are still celebrating today’s trade breakthrough. Here’s where that currently stands. Under the 90-day pause, both countries lowered tariffs by 115 percentage points to 10%. The 20% fentanyl-related tariff from the U.S. remains in place, so most Chinese goods face a 30% rate in total, down from 145% previously, as noted by CNBC. The Magnificent 7 Are Just Starting to Rally Back 10:50 am As of May, the Magnificent 7 lost about $6 trillion in value since their peak in late 2024. Also, at its trough, the Roundhill BIG Tech ETF (NASDAQ: MAGS) – which tracks the Magnificent 7 plummeted from about $56 to a low of $39. However, thanks to the latest U.S.-China news, the ETF is quickly rebounding higher. Making the Mag 7 even more attractive, analysts believe they can easily beat the S&amp;P 500 in earnings this year. Plus, with valuations off their 2024 peaks, investors are coming back to the table to feast. The U.S. and China have finally agreed to a temporary – but significant easing of tariffs. In fact, according to U.S. Treasury Secretary Scott Bessent, U.S. tariffs on China will drop 115 percentage points to 30%. China’s levies on U.S. imports will drop to 10%. More information on specifics can be found in the Joint Statement on U.S. China Economic and Trade Meeting in Geneva at WhiteHouse.gov. As a result of the agreement, the Dow Jones is up about 1,050 points. The NASDAQ is up 663, as the S&amp;P 500 adds 156 points. Even better, it’s boosting the Magnificent 7 stocks. Apple (NASDAQ: AAPL) is up 5.6%, or $11.25. Microsoft (NASDAQ: MSFT) is up 1%, or by $4.80. Alphabet (NASDAQ: GOOG) is up about 3%, or by $4.71. com (NASDAQ: AMZN) is up 7.4% or by $14.55. Nvidia (NASDAQ: NVDA) is up 4%, or by $4.80. Meta Platforms (NASDAQ: META) I up 6.5%, or by $38.73. Tesla (NASDAQ: TSLA) is up 7%, or by $21.23. The post Magnificent 7 Stocks Live: Trade Talks Lead To Spiking Share Prices appeared first on 24/7 Wall St..",
      "source": "https://247wallst.com",
      "rawDate": "2025-05-13 08:00:04",
      "date": "13/05/2025",
      "time": "08:00",
      "category": "tech",
      "impact": "positive",
      "country": "china",
      "url": "https://247wallst.com/investing/2025/05/12/magnificent-7-stocks-live-trade-talks-lead-to-spiking-share-prices/",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 31.863636363636363
    },
    {
      "title": "India's iPhone exports to the U.S. soared an estimated 76%. But Trump, Beijing won't make further growth easy",
      "content": "The data from Canalys, now part of Omdia, showed that U.S. iPhones shipped from India in April rose about 76% to reach 3,000,000. That's a stark contrast to shipments from China over the same period, which fell about 76% from last year to just 900,000.",
      "source": "cnbc.com",
      "rawDate": "2025-05-27 05:52:40",
      "date": "27/05/2025",
      "time": "05:52",
      "category": "companies",
      "impact": "positive",
      "country": "china",
      "url": "https://www.cnbc.com/2025/05/27/indias-iphone-exports-to-the-us-soared-an-estimated-76percent-in-april.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "transport"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 30.7
    }
  ],
  "japan": [
    {
      "title": "Apple looks to add AI search to company's browser, Bloomberg reports",
      "content": "Apple is \"actively looking\" to reshape the Safari web browser to focus on AI-powered search engines, Bloomberg News reported on Wednesday, citing an Apple executive's disclosures in the U.S. Justice Department's lawsuit against Alphabet.",
      "source": "reuters.com",
      "rawDate": "2025-05-07 12:06:19",
      "date": "07/05/2025",
      "time": "12:06",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/business/apple-looks-add-ai-search-companys-browser-bloomberg-reports-2025-05-07/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 41.718939393939394
    },
    {
      "title": "Apple challenges 'unreasonable' EU order to open up to rivals",
      "content": "Apple has submitted a legal challenge to an EU order to open up its closed ecosystem to rivals such as Meta and Alphabet's Google, saying the demands are unreasonable and hamper innovation.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 11:19:24",
      "date": "02/06/2025",
      "time": "11:19",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/apple-challenges-unreasonable-eu-order-open-up-rivals-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "europe"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 32.37348484848485
    },
    {
      "title": "YouTube launches weekly top podcast list to rival Spotify and Apple",
      "content": "Alphabet-owned YouTube launched a weekly top podcast shows chart. Podcasts like \"The Joe Rogan Experience,\" \"Kill Tony\" and \"Rotten Mango\" currently top the YouTube chart.",
      "source": "cnbc.com",
      "rawDate": "2025-05-15 13:01:51",
      "date": "15/05/2025",
      "time": "13:01",
      "category": "tech",
      "impact": "neutral",
      "country": "japan",
      "url": "https://www.cnbc.com/2025/05/15/youtube-top-podcast.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 30.005303030303033
    },
    {
      "title": "Google Stock Drops $160 Billion As Apple Executive Suggests Google's Safari Dominance May Be Waning",
      "content": "Shares of Google parent Alphabet tumbled Wednesday after its key partner Apple indicated Google's days of search engine dominance on Apple devices may be numbered, causing Google stock to limp toward one of its largest losses ever, the latest test for the company as generative artificial intelligence reshapes users' search habits.",
      "source": "forbes.com",
      "rawDate": "2025-05-07 13:43:30",
      "date": "07/05/2025",
      "time": "13:43",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://www.forbes.com/sites/dereksaul/2025/05/07/google-stock-drops-160-billion-as-apple-executive-suggests-googles-safari-dominance-may-be-waning/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 27.92222222222222
    },
    {
      "title": "Alphabet stock stumbles on Apple looking into adding AI search to Safari",
      "content": "Alphabet (GOOG, GOOGL) shares continue to see losses ahead of Wednesday's market close on the headlines that Apple (AAPL) is looking into adding AI search capabilities to its Safari web browser, a disclosure that Apple senior vice president of services Eddy Cue made in a testimony to US Department of Justice (DOJ) officials. Yahoo Finance tech editor Dan Howley breaks down the details.",
      "source": "youtube.com",
      "rawDate": "2025-05-07 17:39:48",
      "date": "07/05/2025",
      "time": "17:39",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://www.youtube.com/watch?v=ucBMpvGFqzM",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 27.75959595959596
    },
    {
      "title": "Google stock drops nearly 10% after Apple says it could ditch search engine as iPhone default",
      "content": "Alphabet stock sank after senior Apple executive signaled that the iPhone maker was looking at search engine alternatives for its Safari web browser.",
      "source": "nypost.com",
      "rawDate": "2025-05-07 12:41:10",
      "date": "07/05/2025",
      "time": "12:41",
      "category": "tech",
      "impact": "negative",
      "country": "japan",
      "url": "https://nypost.com/2025/05/07/business/google-stock-drops-9-after-apple-says-it-could-ditch-search-engine/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 20.232070707070708
    }
  ],
  "emerging_markets": [
    {
      "title": "Apple gives Tata India iPhone repair business as partnership expands, sources say",
      "content": "Apple has brought in Tata Group to handle repairs for iPhones and MacBook devices in its fast-growing Indian market, signalling the Indian conglomerate's deepening role in the U.S. tech giant's supply chain, two people familiar with the matter said.",
      "source": "reuters.com",
      "rawDate": "2025-06-05 06:34:54",
      "date": "05/06/2025",
      "time": "06:34",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.reuters.com/business/media-telecom/apple-gives-tata-india-iphone-repair-business-partnership-expands-sources-say-2025-06-05/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.646212121212116
    },
    {
      "title": "Trump says he doesn't want Apple building products in India: 'I had a little problem with Tim Cook'",
      "content": "President Trump on Thursday said he told Apple CEO Tim Cook that he doesn't want tech giant building its products in India. \"I had a little problem with Tim Cook yesterday,\" Trump said.",
      "source": "cnbc.com",
      "rawDate": "2025-05-15 05:17:28",
      "date": "15/05/2025",
      "time": "05:17",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://www.cnbc.com/2025/05/15/trump-told-tim-cook-he-doesnt-want-apple-building-iphones-in-india.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 35.513888888888886
    },
    {
      "title": "Emerging markets said to see the next bull run as the 'sell U.S.' narrative gains ground",
      "content": "The Bank of America heralded emerging markets as \"the next bull market\" recently.  \"Weaker U.S. dollar, U.S.",
      "source": "cnbc.com",
      "rawDate": "2025-05-21 19:37:31",
      "date": "21/05/2025",
      "time": "19:37",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.cnbc.com/2025/05/22/emerging-markets-next-bull-market-sell-us-market-watchers.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 29.96666666666667
    },
    {
      "title": "Apple: Tariff To Have Low Impact On Revenue",
      "content": "Market fears about Apple's tariff exposure are overblown; management's foresight and strategic planning mitigate significant disruptions, maintaining strong customer loyalty and market share. The company's proactive supply chain optimization and exemption from certain tariffs support a resilient outlook. AAPL's strategic supply chain diversification to India and Vietnam minimizes tariff impact, with a projected gross margin reduction of only 0.8% in FY2025.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-15 01:16:27",
      "date": "15/05/2025",
      "time": "01:16",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://seekingalpha.com/article/4786919-apple-tariff-to-have-low-impact-on-revenue",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 19.083585858585856
    },
    {
      "title": "Apple's 25% Tariff Threat: Expect An About-Turn Soon",
      "content": "Apple Inc.'s current tariff headwinds are temporary, with the Trump 2.0 administration's threats unlikely to materialize into significant long-term impact. Apple is skillfully managing supply chain risks by diversifying production to India and Vietnam, mitigating potential tariff exposure. AAPL stock remains undervalued at 25x FY 2026 earnings, offering ~18% upside to a $232 price target as earnings growth accelerates.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-27 09:05:48",
      "date": "27/05/2025",
      "time": "09:05",
      "category": "tech",
      "impact": "neutral",
      "country": "emerging_markets",
      "url": "https://seekingalpha.com/article/4790096-apple-25-percent-tariff-threat-expect-an-about-turn-soon",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.2479797979798
    },
    {
      "title": "Trump Asks Apple to Make Your Next iPhone in the US, Not India",
      "content": "Apple's CEO Tim Cook has reportedly agreed to increase the amount of iPhone production that takes place in the US, according to President Donald Trump.",
      "source": "cnet.com",
      "rawDate": "2025-05-15 11:10:03",
      "date": "15/05/2025",
      "time": "11:10",
      "category": "tech",
      "impact": "positive",
      "country": "emerging_markets",
      "url": "https://www.cnet.com/tech/mobile/trump-asks-apple-to-make-your-next-iphone-in-the-us-not-india/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "asia"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 16.298232323232323
    }
  ],
  "global": [
    {
      "title": "US trade panel's vote paves way for stiff tariffs on many solar imports",
      "content": "The U.S. International Trade Commission determined on Tuesday that domestic solar panel makers were materially harmed or threatened by a flood of cheap imports from four Southeast Asian nations, bringing the United States a step closer to imposing stiff duties on those goods.",
      "source": "reuters.com",
      "rawDate": "2025-05-20 12:50:59",
      "date": "20/05/2025",
      "time": "12:50",
      "category": "crypto",
      "impact": "negative",
      "country": "global",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-trade-panels-vote-paves-way-stiff-tariffs-many-solar-imports-2025-05-20/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "transport",
          "crypto"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 40.41818181818182
    },
    {
      "title": "The market just gave investors a gift. Here's how not to blow it, according to investing experts",
      "content": "The stock market has fully recovered from its April lows, making it a good time for investors over-concentrated in U.S. stocks to consider a more balanced portfolio. International equities makes sense, according to ETF experts, despite President Trump's global trade war.",
      "source": "cnbc.com",
      "rawDate": "2025-05-18 11:19:38",
      "date": "18/05/2025",
      "time": "11:19",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/05/18/market-rebound-stocks-investing-diversification.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 36.16186868686869
    },
    {
      "title": "Apple and Samsung smartphone growth to take hit from tariff uncertainty: Counterpoint Research",
      "content": "Counterpoint Research research outfit said it had revised down its overall 2025 global smartphone shipment growth forecast to 1.9% year-on-year from 4.2%, citing \"renewed uncertainties surrounding U.S. tariffs.\" Apple shipments are expected to grow 2.5% year-on-year in 2025, while Samsung shipments are expected to be flat.",
      "source": "cnbc.com",
      "rawDate": "2025-06-04 07:35:12",
      "date": "04/06/2025",
      "time": "07:35",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/04/apple-samsung-smartphone-growth-cut-due-to-tariffs-analysts.html",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 35.24848484848485
    },
    {
      "title": "HEDGE FLOW Hedge funds buy stocks at quickest pace since Nov 2024, Goldman Sachs says",
      "content": "Hedge funds bought global equities last week at the quickest pace since November 2024, Goldman Sachs said in a note, just as stock markets ended the month with their most positive May performance in decades.",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:54:07",
      "date": "02/06/2025",
      "time": "06:54",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/hedge-flow-hedge-funds-buy-stocks-quickest-pace-since-nov-2024-goldman-sachs-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 35.150757575757574
    },
    {
      "title": "Morning Bid: Dollar slides on trade and tax fears",
      "content": "A look at what matters in U.S. and global markets today from Mike Dolan, Editor-At-Large, Finance and Markets",
      "source": "reuters.com",
      "rawDate": "2025-06-02 06:39:47",
      "date": "02/06/2025",
      "time": "06:39",
      "category": "markets",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-06-02/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 34.28762626262626
    },
    {
      "title": "Court strikes down Trump reciprocal tariffs",
      "content": "A federal court struck down President Trump's reciprocal tariffs in a ruling out Wednesday. A three-judge panel said President exceeded \"any authority granted\" by the International Emergency Economic Powers Act.",
      "source": "cnbc.com",
      "rawDate": "2025-05-28 19:57:36",
      "date": "28/05/2025",
      "time": "19:57",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.cnbc.com/2025/05/29/court-strikes-down-trump-reciprocal-tariffs.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 33.88914141414142
    },
    {
      "title": "Jim Cramer says Trump is making it hard for the market to value stocks accurately",
      "content": "CNBC's Jim Cramer said President Donald Trump's actions bring out short sellers and lead investors to make misguided market moves. \"When you examine the market's mistakes, they share a common theme: the president's distorting pretty much everything, especially with his tariffs and his jingoistic approach to the rest of the world, and it's continually confounding traders and investors alike,\" he said.",
      "source": "cnbc.com",
      "rawDate": "2025-06-03 18:59:31",
      "date": "03/06/2025",
      "time": "18:59",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/06/03/jim-cramer-trump-market-stocks-correctly-.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 31.073989898989897
    },
    {
      "title": "Fortnite is now offline on iOS worldwide as Apple blocks game, Epic Games says",
      "content": "Fortnite is now unavailable on iOS globally, Epic Games said Friday, after Apple blocked a bid to reinstate the popular game on the App Store in the U.S.",
      "source": "cnbc.com",
      "rawDate": "2025-05-16 05:21:57",
      "date": "16/05/2025",
      "time": "05:21",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.cnbc.com/2025/05/16/fortnite-is-now-offline-on-ios-worldwide-as-apple-blocks-game-epic-games-says.html",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 27.788636363636364
    },
    {
      "title": "Ray Dalio Says Fed Should Not Cut Rates Now",
      "content": "Ray Dalio, Bridgewater Associates founder, says the Federal Reserve should not be cutting interest rates right now. He speaks to Bloomberg's Sonali Basak at the BNP Paribas' annual Global Electric Vehicle & Mobility Conference.",
      "source": "youtube.com",
      "rawDate": "2025-05-20 15:44:09",
      "date": "20/05/2025",
      "time": "15:44",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=n1K6iSvwmJw",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [
          "finance"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 26.93358585858586
    },
    {
      "title": "Apple: Despite Failing From Its Highs There Is Still Upside Potential Going Forward",
      "content": "Apple remains a powerhouse in profitability and cash flow, supporting aggressive buybacks and robust EPS growth, despite flat revenue. Services are driving margin expansion and reducing reliance on iPhone sales, with the segment on track for over $100 billion in annual revenue. Apple's AI and ecosystem investments, global expansion, and loyal customer base position it for future upside, even as competitors innovate rapidly.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-20 08:30:00",
      "date": "20/05/2025",
      "time": "08:30",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4787930-apple-despite-failing-from-highs-there-is-still-upside-potential-going-forward",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 26.701262626262626
    },
    {
      "title": "Did a Top Apple Executive Just Give Investors the Ultimate Reason to Dump the Stock?",
      "content": "Apple (AAPL -2.15%) has been one of the best stocks to own over the past five years on the stock market, rising more than 160% during that time frame. As of Monday's close, its market cap was just over $3.1 trillion, making it one of the most valuable companies in the world.",
      "source": "fool.com",
      "rawDate": "2025-05-21 18:23:00",
      "date": "21/05/2025",
      "time": "18:23",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/05/21/did-a-top-apple-executive-just-give-investors-the/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 25.309343434343432
    },
    {
      "title": "If I Could Only Buy 2 Dividend Stocks Right Now (May 2025 Edition)",
      "content": "I've added Novo Nordisk and Novartis to boost The Dividend Income Accelerator's healthcare allocation and global diversification, reducing overall risk and volatility. Both companies are attractively valued, trading below sector averages, and offer strong growth metrics and robust dividend yields. Novo Nordisk and Novartis each provide a compelling blend of dividend income and growth potential, aligning perfectly with our investment strategy.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-20 07:30:00",
      "date": "20/05/2025",
      "time": "07:30",
      "category": "markets",
      "impact": "positive",
      "country": "global",
      "url": "https://seekingalpha.com/article/4787764-if-i-could-only-buy-2-dividend-stocks-right-now-may-2025-edition",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 24.738888888888887
    },
    {
      "title": "Why Apple (AAPL) International Revenue Trends Deserve Your Attention",
      "content": "Explore Apple's (AAPL) international revenue trends and how these numbers impact Wall Street's forecasts and what's ahead for the stock.",
      "source": "zacks.com",
      "rawDate": "2025-05-13 10:23:01",
      "date": "13/05/2025",
      "time": "10:23",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.zacks.com/stock/news/2468073/why-apple-aapl-international-revenue-trends-deserve-your-attention?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm_international_revenues-2468073",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 18.93838383838384
    },
    {
      "title": "Prediction: This Artificial Intelligence Stock Will Be More Valuable Than Nvidia, Apple, and Microsoft in 5 Years",
      "content": "Nvidia (NVDA -0.99%), Apple (AAPL -0.98%), and Microsoft (MSFT -0.21%) are the three most valuable stocks in the world right now, with market caps north of $3 trillion. They are prominent names in tech, and all stand to benefit significantly from artificial intelligence (AI) as they enhance their existing products and services.",
      "source": "fool.com",
      "rawDate": "2025-05-21 06:30:00",
      "date": "21/05/2025",
      "time": "06:30",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/05/21/prediction-this-artificial-intelligence-stock-will/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.91388888888889
    },
    {
      "title": "Why the next 20-year Treasury auction is ‘must-see TV' for investors after the Moody's downgrade",
      "content": "Bond market remains under pressure in the wake of Moody's downgrade. Tumult in global government debt since Moody's downgraded the U.S. credit rating has investors on edge about a crucial auction of 20-year Treasury bonds on Wednesday.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-20 16:35:00",
      "date": "20/05/2025",
      "time": "16:35",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://www.marketwatch.com/story/why-the-next-20-year-treasury-auction-is-must-see-tv-for-investors-after-the-moodys-downgrade-ac71a676",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 18.561868686868685
    },
    {
      "title": "Nvidia hits $3.17 tn, closes in on Apple's m-cap after Saudi partnership: can it reshape tech rankings?",
      "content": "Nvidia Corp. came within striking distance of overtaking Apple Inc. as the world's second most valuable company on Tuesday, as its stock rallied on optimism around chip sales to Saudi Arabia and artificial intelligence infrastructure deals. The company's shares jumped 5.6% to close at $129.93, lifting its market capitalisation to $3.",
      "source": "invezz.com",
      "rawDate": "2025-05-14 02:00:30",
      "date": "14/05/2025",
      "time": "02:00",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://invezz.com/news/2025/05/14/nvidia-hits-3-17-tn-closes-in-on-apples-m-cap-after-saudi-partnership-can-it-reshape-tech-rankings/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.430555555555557
    },
    {
      "title": "Apple says its App Store helped generate $1.3T in billings and sales, most without a commission",
      "content": "Ahead of its Worldwide Developer Conference on June 9, Apple on Thursday offered a new update on its global App Store business, sharing that developers generated $1.3 trillion in billings and sales in 2024. The company stressed that 90% of those billings and sales did not involve paying Apple a commission.",
      "source": "techcrunch.com",
      "rawDate": "2025-06-05 09:52:41",
      "date": "05/06/2025",
      "time": "09:52",
      "category": "tech",
      "impact": "negative",
      "country": "global",
      "url": "https://techcrunch.com/2025/06/05/apple-says-its-app-store-helped-generate-1-3t-in-billings-and-sales-most-without-a-commission/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "consumer"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 18.231565656565657
    },
    {
      "title": "Private Credit's Surge Has Investors Excited And Regulators Concerned",
      "content": "Private credit has rapidly evolved from a niche asset class into a dominant force in the global lending ecosystem, now representing an estimated $2.5 trillion industry. Regulators, including the Federal Reserve, the International Monetary Fund, and the Bank for International Settlements, are increasingly scrutinizing private credit's role in financial markets.",
      "source": "seekingalpha.com",
      "rawDate": "2025-06-05 13:21:00",
      "date": "05/06/2025",
      "time": "13:21",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4792729-private-credits-surge-investors-excited-regulators-concerned",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 18.096464646464646
    },
    {
      "title": "Prediction: This Unstoppable Stock Will Be the World's First $5 Trillion Company. (Hint: It's Not Apple.",
      "content": "While Apple historically wins the race to various valuation milestones, I think a different company will beat it to the punch to the $5 trillion level, and no, it isn't Microsoft either. I believe that Nvidia (NVDA 0.51%) will win this race, and thanks to its unwavering growth, it will leave both of these two in the dust in the march toward $5 trillion.",
      "source": "fool.com",
      "rawDate": "2025-06-05 06:15:00",
      "date": "05/06/2025",
      "time": "06:15",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/05/prediction-this-unstoppable-stock-will-be-the-worl/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "global"
        ]
      },
      "source_type": "stock_news",
      "importance_score": 17.98611111111111
    },
    {
      "title": "These 4 Warren Buffett Stocks Make Up Over 57% of Berkshire Hathaway's $277 Billion Portfolio",
      "content": "Warren Buffett capped a legendary career recently when he announced that he would be stepping down as CEO of Berkshire Hathaway at the end of the year. The multibillionaire and all-time investing great spent six decades leading the holding company to success, which grew into one of the world's largest companies.",
      "source": "fool.com",
      "rawDate": "2025-05-13 09:15:00",
      "date": "13/05/2025",
      "time": "09:15",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/05/13/these-4-warren-buffett-stocks-make-up-over-57-of/",
      "themes": {
        "macroeconomics": [
          "geopolitics"
        ],
        "sectors": [
          "transport"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 17.687626262626264
    },
    {
      "title": "Trump's Tariffs Are Slowing Down US And Global Economy, OECD Says",
      "content": "The OECD warned that further increases in tariffs by the U.S. government and retaliatory measures by trading partners could “intensify the growth slowdown and trigger significant disruptions in cross-border supply chains.” The report notes that more tariffs and retaliation could further roil financial markets, “prolong policy uncertainty” and “weaken global demand for many key commodities,” among other things.",
      "source": "forbes.com",
      "rawDate": "2025-06-03 06:55:04",
      "date": "03/06/2025",
      "time": "06:55",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.forbes.com/sites/siladityaray/2025/06/03/trumps-tariffs-are-slowing-down-us-and-global-economy-oecd-says/",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": [
          "blocs",
          "global"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.61691919191919
    },
    {
      "title": "U.S. stock futures jump as federal trade court blocks Trump's sweeping tariffs",
      "content": "U.S. stock futures shot higher late Wednesday after a federal trade court ruled that President Donald Trump exceeded his authority in imposing a sweeping raft of global tariffs.",
      "source": "marketwatch.com",
      "rawDate": "2025-05-28 20:23:00",
      "date": "28/05/2025",
      "time": "20:23",
      "category": "economy",
      "impact": "positive",
      "country": "global",
      "url": "https://www.marketwatch.com/story/trumps-sweeping-global-tariffs-blocked-by-federal-trade-court-3f4873eb",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 17.35530303030303
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Will Be Worth More Than Apple By the End of 2025",
      "content": "So far, Apple's (AAPL 0.83%) efforts in artificial intelligence (AI) have underwhelmed investors, and it's fair to say that no one thinks it's taking the world by storm with this particular technology. Its Apple Intelligence initiatives are not getting nearly the buzz that competitors' products are receiving, and it seems that its other AI-related products (advanced AI chips, for example) are still in development or getting little fanfare.",
      "source": "fool.com",
      "rawDate": "2025-06-04 04:20:00",
      "date": "04/06/2025",
      "time": "04:20",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.fool.com/investing/2025/06/04/predict-artificial-intelligence-ai-stock-apple/",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology"
        ],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 16.730555555555554
    },
    {
      "title": "Cathie Wood says Trump's tariffs could unlock tech and healthcare growth",
      "content": "President Donald Trump's trade tariffs, announced in April, have sparked sharp reactions across global markets. While many interpret the move as protectionist, Cathie Wood, founder of ARK Investment Management, believes the policy shift may instead pave the way for more open and freer international trade.",
      "source": "invezz.com",
      "rawDate": "2025-05-19 12:13:33",
      "date": "19/05/2025",
      "time": "12:13",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://invezz.com/news/2025/05/19/cathie-wood-says-trumps-tariffs-could-unlock-tech-and-healthcare-growth/",
      "themes": {
        "macroeconomics": [
          "recession"
        ],
        "sectors": [
          "technology",
          "healthcare"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 15.031818181818181
    },
    {
      "title": "Trump Vs. Apple: We Know How This One Ends (Rating Upgrade)",
      "content": "I think Apple Inc. stock dips are buying opportunities, and Friday's pullback is a chance to reload, not panic-sell. I don't think Apple's global supply chain can be replicated in the U.S. overnight, and I think uncertainty should subside in the near term. AAPL stock's valuation is attractive: the forward P/E has compressed, and risk is already priced in compared to the Mag 7.",
      "source": "seekingalpha.com",
      "rawDate": "2025-05-27 13:15:00",
      "date": "27/05/2025",
      "time": "13:15",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://seekingalpha.com/article/4790137-trump-vs-apple-we-know-how-this-one-ends-rating-upgrade",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.840656565656564
    },
    {
      "title": "Dow slips, Nasdaq gains as investors eye inflation and sentiment data",
      "content": "9:51am: Stocks in neutral US markets opened Friday with a mixed tone as investors processed a flurry of economic data, corporate updates, and global developments. The Dow Jones slipped 40 points, or 0.1%, to 42,283, while the S&P 500 ticked up 4 points to 5,921.",
      "source": "proactiveinvestors.com",
      "rawDate": "2025-05-16 09:56:51",
      "date": "16/05/2025",
      "time": "09:56",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.proactiveinvestors.com/companies/news/1071368",
      "themes": {
        "macroeconomics": [
          "inflation"
        ],
        "sectors": [
          "technology"
        ],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 14.818686868686868
    },
    {
      "title": "Apple vs. HP: Which PC Maker Stock is a Better Buy Right Now?",
      "content": "Apple AAPL and HP HPQ are well-known personal computer (PC) makers in a market that is expected to see year-over-year shipment growth of 2.1% in 2025, per IDC. Global PC shipment is expected to witness a CAGR of 0.4% between 2025 and 2029 to hit 422.6 million in 2029.",
      "source": "zacks.com",
      "rawDate": "2025-05-19 13:31:14",
      "date": "19/05/2025",
      "time": "13:31",
      "category": "tech",
      "impact": "positive",
      "country": "global",
      "url": "https://www.zacks.com/stock/news/2474223/apple-vs-hp-which-pc-maker-stock-is-a-better-buy-right-now?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2474223",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "stock_news",
      "importance_score": 14.592929292929293
    },
    {
      "title": "Federal court blocks Trump's tariffs",
      "content": "A federal court on Wednesday found President Donald Trump does not have the authority to impose his sweeping tariff strategy. The US Court of International Trade's three-judge panel was unanimous in its ruling.",
      "source": "businessinsider.com",
      "rawDate": "2025-05-28 19:29:04",
      "date": "28/05/2025",
      "time": "19:29",
      "category": "economy",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.businessinsider.com/donald-trump-tariffs-blocked-federal-court-2025-5",
      "themes": {
        "macroeconomics": [
          "monetary_policy"
        ],
        "sectors": [],
        "regions": [
          "usa"
        ]
      },
      "source_type": "general_news",
      "importance_score": 14.174242424242424
    },
    {
      "title": "Week Ahead for FX, Bonds: PMI Data in Focus as Investors Gauge Impact of Tariffs on Economy",
      "content": "Focus shifts to how tariffs and the uncertainty surrounding them affect the global economy, with the U.S. purchasing managers' index on manufacturing and services activity due this week.",
      "source": "wsj.com",
      "rawDate": "2025-05-18 08:19:00",
      "date": "18/05/2025",
      "time": "08:19",
      "category": "tech",
      "impact": "neutral",
      "country": "global",
      "url": "https://www.wsj.com/economy/week-ahead-for-fx-bonds-pmi-data-in-focus-as-investors-gauge-impact-of-tariffs-on-economy-5377e0ac",
      "themes": {
        "macroeconomics": [],
        "sectors": [
          "technology",
          "finance"
        ],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 13.274242424242425
    },
    {
      "title": "Labor market weakening is the biggest risk to the US economy",
      "content": "Equity markets (^GSPC, ^IXIC, ^DJI) have seemingly shrugged off Moody's downgrade to the US credit rating, but concerns are growing over earnings pressure and global investor outflows. Ellen Hazen, chief market strategist and portfolio manager at F.L.Putnam Investment Management Co., says the real risk is negative earnings revisions driven by tighter immigration policies and labor costs.",
      "source": "youtube.com",
      "rawDate": "2025-05-19 13:36:11",
      "date": "19/05/2025",
      "time": "13:36",
      "category": "economy",
      "impact": "negative",
      "country": "global",
      "url": "https://www.youtube.com/watch?v=r15T4W2FNtg",
      "themes": {
        "macroeconomics": [],
        "sectors": [],
        "regions": []
      },
      "source_type": "general_news",
      "importance_score": 12.901515151515152
    }
  ],
  "events": [
    {
      "title": "Michigan Consumer Sentiment (Jun)",
      "date": "13/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Jun/11)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Jobless Claims 4-Week Average (Jun/07)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Initial Jobless Claims (Jun/07)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Continuing Jobless Claims (May/31)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Producer Price Index MoM (May)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Inflation Rate MoM (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "CPI (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Inflation Rate YoY (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core Inflation Rate YoY (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Core Inflation Rate MoM (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "CPI s.a (May)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Atlanta Fed GDPNow (Q2)",
      "date": "09/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Bowman Speech",
      "date": "06/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Unemployment Rate (May)",
      "date": "06/06/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "IPO: Chime Financial, Inc. (CHYM)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "24.00 - 26.00",
      "marketCap": 956800000,
      "status": "Expected"
    },
    {
      "title": "IPO: Ategrity Specialty Holdings LLC (ASIC)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": "14.00 - 16.00",
      "marketCap": 122666672,
      "status": "Expected"
    },
    {
      "title": "IPO: Vantage Corp (Singapore) (VNTG)",
      "date": "12/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": "4.00 - 5.00",
      "marketCap": 18687500,
      "status": "Expected"
    },
    {
      "title": "IPO: Voyager Technologies, Inc./DE (VOYG)",
      "date": "11/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NYSE",
      "priceRange": "26.00 - 29.00",
      "marketCap": 366850000,
      "status": "Expected"
    },
    {
      "title": "IPO: Omada Health, Inc. (OMDA)",
      "date": "06/06/2025",
      "time": "09:00",
      "type": "ipo",
      "importance": "medium",
      "score": 5,
      "exchange": "NASDAQ",
      "priceRange": "19.00",
      "marketCap": 150100000,
      "status": "Expected"
    },
    {
      "title": "M&A: MetroCity Bankshares, Inc. acquires First IC Corporation",
      "date": "23/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1747068/000110465925052461/tm2515540-2_s4.htm",
      "symbol": "MCBS",
      "targetedSymbol": "FIEB"
    },
    {
      "title": "M&A: RadNet, Inc. acquires iCAD, Inc.",
      "date": "06/05/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790526/000168316825003180/radnet_s4.htm",
      "symbol": "RDNT",
      "targetedSymbol": "ICAD"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Mr. Cooper Group Inc.",
      "date": "29/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925041422/tm2513302-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "COOP"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKKQ",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNK",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: Mallinckrodt plc acquires Old Mutual Funds III",
      "date": "23/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1567892/000110465925037968/tm2512254-1_s4.htm",
      "symbol": "MNKPF",
      "targetedSymbol": "OTCQX"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "21/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925036921/alms-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO-PA",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APO",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Apollo Global Management, Inc. acquires Bridge Investment Group Holdings Inc.",
      "date": "11/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1858681/000119312525079161/d898041ds4.htm",
      "symbol": "APOS",
      "targetedSymbol": "BRDG"
    },
    {
      "title": "M&A: Rocket Companies, Inc. acquires Redfin Corporation",
      "date": "07/04/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1805284/000110465925032694/tm2511408-1_s4.htm",
      "symbol": "RKT",
      "targetedSymbol": "RDFN"
    },
    {
      "title": "M&A: PLUMAS BANCORP acquires Cornerstone Community Bancorp",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1168455/000143774925010230/plbc20250327_s4.htm",
      "symbol": "PLBC",
      "targetedSymbol": "CRSB"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY-WT",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: Getty Images Holdings, Inc. acquires Shutterstock, Inc.",
      "date": "31/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1898496/000101376225004383/ea0235881-01.htm",
      "symbol": "GETY",
      "targetedSymbol": "SSTK"
    },
    {
      "title": "M&A: ALUMIS INC. acquires Acelyrin, Inc.",
      "date": "27/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1847367/000110465925028809/tmb-20241231xs4.htm",
      "symbol": "ALMS",
      "targetedSymbol": "SLRN"
    },
    {
      "title": "M&A: BERKSHIRE HILLS BANCORP INC acquires Brookline Bancorp, Inc.",
      "date": "24/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1108134/000110465925027226/tm252197-5_s4.htm",
      "symbol": "BHLB",
      "targetedSymbol": "BRKL"
    },
    {
      "title": "M&A: HERC HOLDINGS INC acquires H&E Equipment Services, Inc.",
      "date": "19/03/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1364479/000119312525057826/d897934ds4.htm",
      "symbol": "HRI",
      "targetedSymbol": "HEES"
    },
    {
      "title": "M&A: GLACIER BANCORP, INC. acquires Bank of Idaho Holding Company",
      "date": "28/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/868671/000119312525040197/d924756ds4.htm",
      "symbol": "GBCI",
      "targetedSymbol": "BOID"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNE",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: CNB FINANCIAL CORP/PA acquires ESSA Bancorp, Inc.",
      "date": "20/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/736772/000119312525030821/d906633ds4.htm",
      "symbol": "CCNEP",
      "targetedSymbol": "ESSA"
    },
    {
      "title": "M&A: FLYEXCLUSIVE INC. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "FLYX",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-UN",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF-WT",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: EG Acquisition Corp. acquires Jet.AI Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1843973/000095017025021150/flyx-20250214.htm",
      "symbol": "EGGF",
      "targetedSymbol": "JTAI"
    },
    {
      "title": "M&A: Quanterix Corp acquires Akoya Biosciences, Inc.",
      "date": "14/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1503274/000110465925013197/qtrx-20240930xs4.htm",
      "symbol": "QTRX",
      "targetedSymbol": "AKYA"
    },
    {
      "title": "M&A: Clearwater Analytics Holdings, Inc. acquires Enfusion, Inc.",
      "date": "11/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866368/000119312525023759/d923386ds4.htm",
      "symbol": "CWAN",
      "targetedSymbol": "ENFN"
    },
    {
      "title": "M&A: TUHURA BIOSCIENCES, INC. acquires KINETA, INC./DE",
      "date": "07/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1498382/000119312525022803/d907296ds4.htm",
      "symbol": "HURA",
      "targetedSymbol": "KANT"
    },
    {
      "title": "M&A: NortonLifeLock Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "NLOK",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: Gen Digital Inc. acquires MoneyLion Inc.",
      "date": "03/02/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/849399/000114036125002752/ny20039778x6_s4.htm",
      "symbol": "GEN",
      "targetedSymbol": "ML"
    },
    {
      "title": "M&A: INDEPENDENT BANK CORP acquires Enterprise Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/776901/000119312525013451/d843045ds4.htm",
      "symbol": "INDB",
      "targetedSymbol": "EBTC"
    },
    {
      "title": "M&A: Northwest Bancshares, Inc. acquires Penns Woods Bancorp, Inc.",
      "date": "27/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1471265/000119312525012768/d881961ds4.htm",
      "symbol": "NWBI",
      "targetedSymbol": "PWOD"
    },
    {
      "title": "M&A: OMNICOM GROUP INC. acquires The Interpublic Group of Companies, Inc.",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/29989/000119312525008526/d881832ds4.htm",
      "symbol": "OMC",
      "targetedSymbol": "IPG"
    },
    {
      "title": "M&A: MID PENN BANCORP INC acquires William Penn Bancorporation",
      "date": "17/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/879635/000119312525008431/d518638ds4.htm",
      "symbol": "MPB",
      "targetedSymbol": "WMPN"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCCF",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: Amcor plc acquires AMC Entertainment Holdings, Inc.",
      "date": "13/01/2025",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1748790/000110465925003032/tm2431373-1_s4.htm",
      "symbol": "AMCR",
      "targetedSymbol": "AMC"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQLLW",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: ATLANTIC INTERNATIONAL CORP. acquires Staffing 360 Solutions, Inc.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "ATLN",
      "targetedSymbol": "STAF"
    },
    {
      "title": "M&A: SeqLL, Inc. acquires Atlantic International Corp.",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1605888/000121390024112669/ea0225658-01.htm",
      "symbol": "SQL",
      "targetedSymbol": "ATLN"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PE",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCA",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCB",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RCC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC-PC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: Ready Capital Corp acquires United Development Funding IV",
      "date": "26/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1527590/000110465924131559/tm2431241-1_s4.htm",
      "symbol": "RC",
      "targetedSymbol": "UDFI"
    },
    {
      "title": "M&A: IRON HORSE ACQUISITIONS CORP. acquires Iron Horse Acquisitions Corp. Common Stock",
      "date": "19/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1901203/000121390024110549/ea0224529-01.htm",
      "symbol": "IROHU",
      "targetedSymbol": "IROH"
    },
    {
      "title": "M&A: Cara Therapeutics, Inc. acquires Tvardi",
      "date": "18/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1346830/000110465924129773/tm2430195-1_s4.htm",
      "symbol": "CARA",
      "targetedSymbol": "TVRD"
    },
    {
      "title": "M&A: CHARTER COMMUNICATIONS, INC. /MO/ acquires Liberty Broadband Corporation",
      "date": "13/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1091667/000114036124049322/ny20038391x3_s4.htm",
      "symbol": "CHTR",
      "targetedSymbol": "LBRDA"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOBP",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ConnectOne Bancorp, Inc. acquires The First of Long Island Corporation",
      "date": "10/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/712771/000110465924127153/tm2430419-1_s4.htm",
      "symbol": "CNOB",
      "targetedSymbol": "FLIC"
    },
    {
      "title": "M&A: ONEOK INC /NEW/ acquires EnLink Midstream, LLC",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1039684/000121390024106665/ea0223893-01.htm",
      "symbol": "OKE",
      "targetedSymbol": "ENLC"
    },
    {
      "title": "M&A: Allovir, Inc. acquires Kalaris",
      "date": "09/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1754068/000119312524272655/d888593ds4.htm",
      "symbol": "ALVR",
      "targetedSymbol": "KLRS"
    },
    {
      "title": "M&A: Aerovate Therapeutics, Inc. acquires Jade",
      "date": "03/12/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1798749/000110465924124782/avte-20240930xs4.htm",
      "symbol": "AVTE",
      "targetedSymbol": "JBIO"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZW",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Classover Holdings, Inc. acquires Battery Future Acquisition Corp.",
      "date": "26/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2006257/000192998024000599/class_s4.htm",
      "symbol": "KIDZ",
      "targetedSymbol": "BFAC"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAINW",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: Rain Enhancement Technologies Holdco, Inc. acquires Coliseum Acquisition Corp.",
      "date": "25/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/2028293/000110465924122257/tm2417797-13_s4.htm",
      "symbol": "RAIN",
      "targetedSymbol": "MITA"
    },
    {
      "title": "M&A: ATHENA GOLD CORP acquires Athira Pharma, Inc.",
      "date": "22/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1304409/000168316824008359/athenagold_s4.htm",
      "symbol": "AHNR",
      "targetedSymbol": "ATHA"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUBAP",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Sandy Spring Bancorp, Inc.",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB",
      "targetedSymbol": "SASR"
    },
    {
      "title": "M&A: Atlantic Union Bankshares Corp acquires Atlantic Union Bankshares Corporation",
      "date": "21/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/883948/000110465924121535/tm2428626-1_s4.htm",
      "symbol": "AUB-PA",
      "targetedSymbol": "AUB"
    },
    {
      "title": "M&A: BYLINE BANCORP, INC. acquires D.A. Davidson",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1702750/000095017024127675/by-20241115.htm",
      "symbol": "BY",
      "targetedSymbol": null
    },
    {
      "title": "M&A: Solventum Corp acquires 3M",
      "date": "15/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1964738/000196473824000051/solv-formsx4.htm",
      "symbol": "SOLV",
      "targetedSymbol": null
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMVU",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: AlphaVest Acquisition Corp. acquires SPAC,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1937891/000149315224044878/forms-4.htm",
      "symbol": "ATMV",
      "targetedSymbol": "AMTV"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXU",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXXW",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Inflection Point Acquisition Corp. II acquires Intuitive Machines, Inc.",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787434/000121390024096943/ea0220524-01.htm",
      "symbol": "IPXX",
      "targetedSymbol": "LUNR"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-WT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corporation acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Southport Acquisition Corp acquires Angel Studios,Inc",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1671941/000110465924116765/port-20240630xs4.htm",
      "symbol": "PORT-UN",
      "targetedSymbol": "AGSD"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMA",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAU",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Welsbach Technology Metals Acquisition Corp. acquires WTMA,",
      "date": "12/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1866226/000121390024096181/ea0218637-01.htm",
      "symbol": "WTMAR",
      "targetedSymbol": "EMAT"
    },
    {
      "title": "M&A: Atlis Motor Vehicles Inc acquires Verde",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1722969/000121390024096067/ea0220087-01.htm",
      "symbol": "AMV",
      "targetedSymbol": "VRDE"
    },
    {
      "title": "M&A: EAGLE BANCORP INC acquires Solo Brands, Inc.",
      "date": "08/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1050441/000105044124000156/registeredexchange-formsx4.htm",
      "symbol": "EGBN",
      "targetedSymbol": "DTC"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECA",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAW",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: Denali Capital Acquisition Corp. acquires New Semnur shall",
      "date": "06/11/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1584541/000119312524251843/d887184ds4.htm",
      "symbol": "DECAU",
      "targetedSymbol": "SMNR"
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Parker",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBR",
      "targetedSymbol": null
    },
    {
      "title": "M&A: NABORS INDUSTRIES LTD acquires Nabors Industries Ltd.",
      "date": "31/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1163739/000119312524247843/d888562ds4.htm",
      "symbol": "NBRWF",
      "targetedSymbol": "NBR"
    },
    {
      "title": "M&A: NBT BANCORP INC acquires Evans Bancorp, Inc.",
      "date": "24/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/790359/000114036124044133/ny20037539x1_s4.htm",
      "symbol": "NBTB",
      "targetedSymbol": "EVBN"
    },
    {
      "title": "M&A: CAMDEN NATIONAL CORP acquires Northway Financial, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/750686/000114036124043705/ny20036065x1_s4.htm",
      "symbol": "CAC",
      "targetedSymbol": "NWYF"
    },
    {
      "title": "M&A: FIRST BUSEY CORP /NV/ acquires CrossFirst Bankshares, Inc.",
      "date": "18/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/314489/000110465924109878/tm2423752-2_s4.htm",
      "symbol": "BUSE",
      "targetedSymbol": "CFB"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAU",
      "targetedSymbol": "YOTA"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAR",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTAW",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: Yotta Acquisition Corp acquires Yotta Acquisition Corporation",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1907730/000121390024087623/ea0217145-01.htm",
      "symbol": "YOTA",
      "targetedSymbol": "YOTAU"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-B",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: LIONS GATE ENTERTAINMENT CORP /CN/ acquires Lionsgate Studios Corp.",
      "date": "15/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/929351/000119312524237307/d860983ds4.htm",
      "symbol": "LGF-A",
      "targetedSymbol": "LION"
    },
    {
      "title": "M&A: Rafael Holdings, Inc. acquires Cyclo Therapeutics, Inc.",
      "date": "09/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1713863/000121390024086418/ea0216930-01.htm",
      "symbol": "RFL",
      "targetedSymbol": "CYTH"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLD",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDW",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: FTAC Emerald Acquisition Corp. acquires Mr. Hohns",
      "date": "07/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1787441/000121390024085654/ea0212543-01.htm",
      "symbol": "EMLDU",
      "targetedSymbol": "FLD"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBCP",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: WESBANCO INC acquires Premier Financial Corp.",
      "date": "04/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/203596/000119312524233159/d864335ds4.htm",
      "symbol": "WSBC",
      "targetedSymbol": "PFC"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires Vyome",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "RSLS",
      "targetedSymbol": "HIND"
    },
    {
      "title": "M&A: ReShape Lifesciences Inc. acquires ReShape Lifesciences Inc.",
      "date": "01/10/2024",
      "time": "10:00",
      "type": "m&a",
      "importance": "medium",
      "score": 6,
      "source": "https://www.sec.gov/Archives/edgar/data/1427570/000110465924105017/rsls-20240630xs4.htm",
      "symbol": "OBLN",
      "targetedSymbol": "RSLS"
    }
  ]
}