{
  "us": [
    {
      "title": "Stocks sink as inflation fears and tariffs spark sell off, retirement portfolio risks",
      "content": "Market Domination Overtime anchors Julie Hyman and Josh Lipton break down the market sell-off for March 28, 2025. Other stories include the decline in consumer sentiment and how Trump's tariffs are taking a toll on retirement portfolios.",
      "source": "youtube.com",
      "date": "28/03/2025",
      "time": "20:20",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=ai_PB53f75c",
      "score": 26
    },
    {
      "title": "Bitcoin's Bearish Turn: Rising Wedge Collapse Signals Drop To $73,919",
      "content": "The bulls are losing their grip as Bitcoin confirms a bearish rising wedge breakdown, threatening its recent gains.",
      "source": "bitcoinist.com",
      "date": "29/03/2025",
      "time": "21:30",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://bitcoinist.com/bitcoins-rising-wedge-collapse/",
      "score": 23
    },
    {
      "title": "3 Cryptocurrencies to Sell Fast if Bitcoin Price Plunges Below $80K",
      "content": "Bitcoin price tumbled towards the $82,000 mark on Sunday, March 30. IntoTheBlock data shows DOGE, Chainlink, and AVAX exhibited high correlation to BTC price action in the last 30 days.",
      "source": "coingape.com",
      "date": "29/03/2025",
      "time": "21:21",
      "category": "crypto",
      "impact": "negative",
      "country": "us",
      "url": "https://coingape.com/markets/3-cryptocurrencies-to-sell-fast-if-bitcoin-price-plunges-below-80k/",
      "score": 13
    },
    {
      "title": "Is It Time to Look at Fixed Income and Inflation Protection?",
      "content": "Recently, I was asked on CNBC Asia what I thought about fixed income at the present time. My answer was that I thought having cash allocated to some is wise and that we were doing that as well.",
      "source": "seeitmarket.com",
      "date": "29/03/2025",
      "time": "12:54",
      "category": "economie",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.seeitmarket.com/is-it-time-to-look-at-fixed-income-and-inflation-protection/",
      "score": 13
    },
    {
      "title": "CPI Surge, Overseas Investments, and Gone Grants",
      "content": "CPI Surge – The Consumer Price Index increased by 0.2% in February 2025, following a 0.5% increase in January 2025. The food index rose by 0.2% and the shelter index increased by 0.3%, while the airline fare index decreased by 4.0% and the gasoline index dropped by 1.0% (source: U.S. Bureau of Labor Statistics).",
      "source": "etftrends.com",
      "date": "29/03/2025",
      "time": "08:31",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.etftrends.com/leveraged-inverse-channel/cpi-surge-overseas-investments-gone-grants/",
      "score": 10
    },
    {
      "title": "Buckle up: Stock market wipes over $1 trillion in a day",
      "content": "Although the stock market began the week positively, the five-day trading session ended with massive losses as investors were spooked by the threat of accelerating inflation and uncertainty surrounding President Donald Trump's trade tariffs.",
      "source": "finbold.com",
      "date": "29/03/2025",
      "time": "07:26",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://finbold.com/buckle-up-stock-market-wipes-over-1-trillion-in-a-day/",
      "score": 10
    },
    {
      "title": "RKLB LAWSUIT ALERT: Levi & Korsinsky Notifies Rocket Lab USA, Inc. Investors of a Class Action Lawsuit and Upcoming Deadline",
      "content": "NEW YORK, NY / ACCESS Newswire / March 29, 2025 / If you suffered a loss on your Rocket Lab USA, Inc. (NASDAQ:RKLB) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/rocket-lab-usa-inc-lawsuit-submission-form?prid=139653&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "29/03/2025",
      "time": "21:23",
      "category": "economie",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/rklb-lawsuit-alert-levi-and-korsinsky-notifies-rocket-lab-usa-in-1007358",
      "score": 6
    },
    {
      "title": "Shiba Inu [SHIB] price prediction – Mapping short-term targets as selling pressure climbs",
      "content": "Key on-chain and technical metrics have SHIB heading south soon.",
      "source": "ambcrypto.com",
      "date": "29/03/2025",
      "time": "23:00",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://ambcrypto.com/shiba-inu-shib-price-prediction-mapping-short-term-targets-as-selling-pressure-climbs/",
      "score": 3
    },
    {
      "title": "AppLovin Corporation Class Action: Levi & Korsinsky Reminds AppLovin Investors of the Pending Class Action Lawsuit with a Lead Plaintiff Deadline of May 5, 2025 – APP",
      "content": "NEW YORK, NY / ACCESS Newswire / March 29, 2025 / If you suffered a loss on your AppLovin Corporation (NASDAQ:APP) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/applovin-corporation-lawsuit-submission-form?prid=139652&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "29/03/2025",
      "time": "21:23",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/applovin-corporation-class-action-levi-and-korsinsky-reminds-app-1007357",
      "score": 3
    },
    {
      "title": "Investors who lost money on Alarum Technologies Ltd.(ALAR) should contact Levi & Korsinsky about pending Class Action - ALAR",
      "content": "NEW YORK, NY / ACCESS Newswire / March 29, 2025 / If you suffered a loss on your Alarum Technologies Ltd. (NASDAQ:ALAR) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/alarum-technologies-ltd-lawsuit-submission-form?prid=139651&wire=1 or contact Joseph E.",
      "source": "accessnewswire.com",
      "date": "29/03/2025",
      "time": "21:23",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/investors-who-lost-money-on-alarum-technologies-ltdalar-should-c-1007356",
      "score": 3
    },
    {
      "title": "Above The Noise: Will Policy Uncertainty Harm The U.S. Economy?",
      "content": "While the setup was good coming into 2025, markets struggled with ongoing changes to the US policy approach. We may not be at peak policy uncertainty, but past peaks have been attractive buying opportunities for investors.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "02:45",
      "category": "tech",
      "impact": "negative",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771496-will-policy-uncertainty-harm-us-economy",
      "score": 3
    },
    {
      "title": "Tariff Talk vs. Market Reality: Don't Panic Amid Volatility",
      "content": "Tariff talk is heating up, but is it time to hit the panic button? Not so fast, says William Lee.",
      "source": "youtube.com",
      "date": "29/03/2025",
      "time": "10:00",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://www.youtube.com/watch?v=k0TohYXNGAY",
      "score": 2
    },
    {
      "title": "What Moved Markets This Week",
      "content": "Wall Street on Friday closed out a roller-coaster week that began with an advance and ended with a selloff.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "06:47",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771530-what-moved-markets-this-week",
      "score": 2
    },
    {
      "title": "Weekly Commentary: Critical Market Juncture",
      "content": "A disconcerting environment turned notably more so this week, with market instability becoming more serious. The longer the Trump administration ignores mounting market distress, the clearer it becomes that moving full speed ahead with agenda priorities takes precedence.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "05:45",
      "category": "marches",
      "impact": "neutral",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771525-weekly-commentary-critical-market-juncture",
      "score": 2
    },
    {
      "title": "Wall Street Gets Tariffied",
      "content": "Investors capped the week with all the grace of a sneeze in a violin recital, as the S&P 500 notched its second-worst performance of the year and the Nasdaq its fourth. Tariff and stagflation fears dominated, with all eyes on next week's April 2 “Liberation Day” announcement of reciprocal tariffs.",
      "source": "seekingalpha.com",
      "date": "28/03/2025",
      "time": "23:10",
      "category": "tech",
      "impact": "neutral",
      "country": "us",
      "url": "https://seekingalpha.com/article/4771461-wall-street-gets-tariffied",
      "score": 2
    }
  ],
  "france": [
    {
      "title": "Brookfield Infrastructure Partners: Sell-Off Makes It Even Better",
      "content": "Brookfield Infrastructure Partners is a high-quality dividend growth stock benefiting from macro trends and has become more attractive due to a recent price pullback. The stock is a compelling investment at current prices, offering a strong opportunity for retail investors seeking reliable dividend growth. I have previously covered Brookfield Infrastructure Partners on Seeking Alpha, with my most recent analysis published around three months ago.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "22:02",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771570-brookfield-infrastructure-partners-sell-off-makes-it-even-better",
      "score": 17
    },
    {
      "title": "Yoga Pants Blues",
      "content": "As the current corporate earnings season winds down, the last companies to report are giving us a preview of what to expect when the Q1 numbers start coming out next month. The University of Michigan Consumer Sentiment index was revised lower in its final version today, the third monthly decline in a row and the lowest since July 2022, roughly the time when inflation hit a high of nine percent.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "02:50",
      "category": "economie",
      "impact": "negative",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771498-yoga-pants-blues",
      "score": 16
    },
    {
      "title": "Neuronetics: Explosive Growth Poised To Soar On FDA Breakthroughs",
      "content": "Neuronetics has shown significant growth, with a 430% rally since November and strong Q4 2024 results, driven by its NeuroStar TMS therapy system. The company's valuation remains attractive despite recent gains, with a forward P/S ratio of 1.71x, well below sector norms, indicating potential undervaluation. Strategic acquisitions, including Greenbrook, and FDA approvals are expected to drive revenue growth and cash flow positivity by Q3 2025.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "23:45",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771574-neuronetics-explosive-growth-poised-to-soar-on-fda-breakthroughs",
      "score": 15
    },
    {
      "title": "Nano Dimension: Watch Out For Acquisitions Integration; Earnings Preview",
      "content": "Nano Dimension is a Hold until clear evidence of successful integration of Desktop Metal and Markforged and effective cash management is presented in the upcoming earnings report. The company has shown promising financial improvements, with Q3 2024 being its best quarter ever, but investor confidence remains low due to recent controversies and CEO change. NNDM's core business, particularly the DragonFly system, is performing well with increased revenue and gross margins, indicating strong underlying business health.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "23:07",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771573-nano-dimension-watch-out-for-acquisitions-integration-earnings-preview",
      "score": 10
    },
    {
      "title": "Trump tells NBC he 'couldn't care less' if car makers hike prices due to tariffs",
      "content": "U.S. President Donald Trump said on Saturday he did not warn car industry executives against raising prices as tariffs on foreign-made autos come into force, telling NBC News he \"couldn't care less\" if they do.",
      "source": "reuters.com",
      "date": "29/03/2025",
      "time": "20:06",
      "category": "tech",
      "impact": "neutral",
      "country": "france",
      "url": "https://www.reuters.com/world/us/trump-tells-nbc-he-couldnt-care-less-if-car-makers-hike-prices-due-tariffs-2025-03-30/",
      "score": 10
    },
    {
      "title": "KOIL Energy Announces Delay in Filing of Annual Report on Form 10-K and anticipates reporting profitable growth in revenues",
      "content": "HOUSTON, March 29, 2025 (GLOBE NEWSWIRE) -- Koil Energy Solutions, Inc. (OTCQB: KLNG), (the “Company”) today announced that it will be filing its Annual Report on Form 10-K for the fiscal year ended December 31, 2024, with the Securities and Exchange Commission (the “SEC”) later than the originally scheduled date of March 31, 2025. The Company anticipates filing the Annual Report within the extended timeframe granted by the SEC of fifteen days.",
      "source": "globenewswire.com",
      "date": "29/03/2025",
      "time": "22:31",
      "category": "economie",
      "impact": "positive",
      "country": "france",
      "url": "https://www.globenewswire.com/news-release/2025/03/30/3051776/0/en/KOIL-Energy-Announces-Delay-in-Filing-of-Annual-Report-on-Form-10-K-and-anticipates-reporting-profitable-growth-in-revenues.html",
      "score": 8
    },
    {
      "title": "CVS Health: I Don't Understand The Fuss, But The Worst Is Behind",
      "content": "CVS Health experienced a significant turnaround in 2025, with shares up nearly 50% after a 44% decline in 2024. The recent rally is not driven by great results or strong guidance under new CEO leadership, but rather bad ones that just weren't as terrible as expected. CVS's 2025 outlook includes modest revenue growth, improved operating income, and a focus on stabilizing margins and profitability.",
      "source": "seekingalpha.com",
      "date": "29/03/2025",
      "time": "22:52",
      "category": "marches",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771572-cvs-health-i-dont-understand-the-fuss-but-the-worst-is-behind",
      "score": 7
    },
    {
      "title": "Atkore Inc. Sued for Securities Law Violations - Contact Levi & Korsinsky Before April 23, 2025 to Discuss Your Rights – ATKR",
      "content": "NEW YORK, NY / ACCESS Newswire / March 29, 2025 / If you suffered a loss on your Atkore Inc. (NYSE:ATKR) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information: https://zlk.com/pslra-1/atkore-inc-lawsuit-submission-form?prid=139654&wire=1 or contact Joseph E. Levi, Esq.",
      "source": "accessnewswire.com",
      "date": "29/03/2025",
      "time": "21:23",
      "category": "economie",
      "impact": "negative",
      "country": "france",
      "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/atkore-inc-sued-for-securities-law-violations--contact-levi-and--1007359",
      "score": 6
    },
    {
      "title": "Gannett Co., Inc.: A Deep Value Turnaround With Hidden Optionality",
      "content": "Gannett is a business on the right track, currently offered by Mr. Market at a depressed valuation with attractive optionality and multiple catalysts. They are in the middle of turning the business into digital, which could eventually lead to multiple expansion. Gannett is involved in an ongoing legal case against Google which, depending on the outcome, could result in a meaningful cash inflow.",
      "source": "seekingalpha.com",
      "date": "30/03/2025",
      "time": "00:01",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://seekingalpha.com/article/4771576-gannett-co-inc-a-deep-value-turnaround-with-hidden-optionality",
      "score": 5
    },
    {
      "title": "Autodesk, Inc. (NASDAQ: ADSK) Stock Transaction and Strategic Initiatives",
      "content": "<ul>\n<li>Senior Vice President and Chief Accounting Officer, Hope Stephen W., sold 2,452 shares at <strong>$267.29</strong> each, leaving him with 3,003 shares.</li>\n<li>Autodesk is actively engaging with shareholders and has appointed two independent directors to its Board, aiming to enhance shareholder value.</li>\n<li>The company's strategic efforts and strong business performance are highlighted by its recent financial results and initiatives, despite a slight decrease in stock price to <strong>$261.63</strong>.</li>\n</ul>\n\n<p><a href=\"https://site.financialmodelingprep.com/financial-summary/NASDAQ:ADSK\">Autodesk, Inc. (NASDAQ: ADSK)</a> is a leading software company known for its design and engineering software, widely used in industries such as architecture, engineering, and construction. The company faces competition from firms like Adobe and Dassault Systèmes. Recently, Autodesk has been in the news due to a stock transaction by its Senior Vice President and Chief Accounting Officer, Hope Stephen W.</p>\n\n<p>On March 28, 2025, Hope Stephen W. sold 2,452 shares of Autodesk's common stock at <strong>$267.29</strong> each. This transaction leaves him with 3,003 shares. This sale comes amid Autodesk's ongoing efforts to enhance shareholder value, as highlighted by its response to Starboard Value LP's comments. Autodesk emphasizes its strong business performance and strategic initiatives aimed at generating long-term value.</p>\n\n<p>Autodesk has been actively engaging with its shareholders, representing over half of its outstanding shares, to maintain a constructive dialogue. The company has also strengthened its Board of Directors by appointing two independent directors with proven records of value creation. Despite Starboard's tactics, including misrepresentations and a reduction of its stake, Autodesk remains committed to acting in the best interests of its shareholders.</p>\n\n<p>The company's recent financial results and strategic initiatives have led to total shareholder returns that surpass those of its peers. Autodesk has been working to drive growth, expand operating margins, and generate substantial free cash flow. In fiscal year 2025, the company launched a new go-to-market approach, further solidifying its market position.</p>\n\n<p>Currently, Autodesk's stock price is <strong>$261.63</strong>, reflecting a decrease of 3.03% or <strong>$8.18</strong>. The stock has traded between $260.94 and $268.28 today, with a market capitalization of approximately <strong>$55.73 billion</strong>. The trading volume for the day is 1,233,244 shares on the NASDAQ exchange. Despite the recent dip, Autodesk's strategic efforts and strong business performance continue to position it well in the market.</p>",
      "source": "Financial Modeling Prep",
      "date": "28/03/2025",
      "time": "19:00",
      "category": "tech",
      "impact": "positive",
      "country": "france",
      "url": "https://financialmodelingprep.com/market-news/autodesk-inc-stock-transaction-strategic-initiatives",
      "score": 5
    }
  ],
  "events": [
    {
      "title": "Dallas Fed Manufacturing Index (Mar)",
      "date": "31/03/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Waller Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Barr Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Chair Powell Speech",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Nonfarm Payrolls Private (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Non Farm Payrolls (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Unemployment Rate (Mar)",
      "date": "04/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Balance Sheet (Apr/02)",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Cook Speech",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    },
    {
      "title": "Fed Jefferson Speech",
      "date": "03/04/2025",
      "time": "09:00",
      "type": "economic",
      "importance": "high",
      "score": 13
    }
  ],
  "lastUpdated": "2025-03-30T04:41:21.977381"
}