[
    {
        "nom": "Micro-foncier",
        "definition": "Le régime micro-foncier est un régime fiscal simplifié pour les propriétaires qui louent des biens nus (non meublés) et perçoivent moins de 15 000 € de loyers bruts par an, tous biens et foyers confondus. Il permet de bénéficier d'un abattement automatique de 30 % sur les loyers déclarés, sans avoir à détailler ses charges. Ce régime est incompatible avec certains dispositifs fiscaux comme le Pinel ou le Malraux.",
        "exemple": "Si vous percevez 10 000 € de loyers dans l'année, vous ne serez imposé que sur 7 000 €, même si vos charges réelles dépassent 3 000 €.",
        "comparaison": "Très simple, mais moins intéressant si vos charges dépassent 30 % des loyers. Le régime réel est alors préférable.",
        "avantages": [
            "Simplicité de déclaration (formulaire 2042 uniquement)",
            "Pas besoin de comptabilité ni de justificatifs",
            "Automatisme de l'abattement fiscal"
        ],
        "inconvenients": [
            "Plafond de 15 000 € pour l'ensemble du foyer",
            "Pas adapté si vous avez des charges élevées",
            "Incompatible avec les dispositifs fiscaux type Pinel, Malraux, etc."
        ]
    },
    {
        "nom": "Réel foncier",
        "definition": "Le régime réel permet de déduire toutes les charges réellement engagées (travaux, intérêts d'emprunt, taxe foncière, etc.) pour calculer le revenu imposable sur les loyers de biens loués vides.",
        "exemple": "Vous percevez 15 000 € de loyers par an et avez 7 000 € de charges. Vous ne serez imposé que sur 8 000 €.",
        "comparaison": "Plus intéressant que le micro-foncier si vos charges dépassent 30 % des loyers, mais demande plus de rigueur.",
        "avantages": [
            "Optimisation fiscale via déduction des charges réelles",
            "Possibilité de créer un déficit foncier",
            "Intéressant en cas de travaux ou de charges importantes"
        ],
        "inconvenients": [
            "Gestion plus complexe (déclaration 2044, justificatifs)",
            "Nécessite un suivi comptable plus rigoureux",
            "Pas automatique : il faut opter pour ce régime"
        ]
    },
    {
        "nom": "LMNP micro-BIC",
        "definition": "Le LMNP micro-BIC est un régime simplifié pour les particuliers qui louent un bien meublé. Les recettes sont imposées dans la catégorie des BIC, avec un abattement automatique de 50 %.",
        "conditions_statut": "Recettes < 23 000 €/an ET inférieures à 50 % des revenus globaux du foyer.",
        "exemple": "Vous percevez 9 000 € de loyers. Vous serez imposé sur 4 500 €, sans prise en compte des charges.",
        "comparaison": "Simple à gérer, mais moins optimisé que le régime réel si vous avez des charges ou amortissements.",
        "avantages": [
            "Simplicité administrative",
            "Pas besoin de comptabilité complexe",
            "Abattement forfaitaire de 50 %"
        ],
        "inconvenients": [
            "Pas de déduction des charges réelles",
            "Moins avantageux si vous avez investi dans le bien (travaux, mobilier)",
            "Soumis à des plafonds stricts pour rester en LMNP"
        ]
    },
    {
        "nom": "LMNP réel",
        "definition": "Le régime réel LMNP permet de déduire toutes les charges et d'amortir le bien, le mobilier et les frais. Il est très efficace pour réduire voire annuler l'imposition sur les loyers issus d'une location meublée.",
        "conditions_statut": "Recettes < 23 000 €/an ET inférieures à 50 % des revenus globaux du foyer.",
        "exemple": "Vous percevez 12 000 € de loyers, 4 000 € de charges et 6 000 € d'amortissements. Votre revenu imposable est de seulement 2 000 €.",
        "comparaison": "Très avantageux fiscalement, surtout en début d'investissement, mais nécessite une comptabilité complète.",
        "avantages": [
            "Amortissement du bien = réduction importante d'impôt",
            "Optimisation sur plusieurs années",
            "Déduction de toutes les charges réelles"
        ],
        "inconvenients": [
            "Obligation de tenir une comptabilité complète",
            "Coût éventuel d'un expert-comptable",
            "Plus complexe à gérer que le micro-BIC"
        ]
    },
    {
        "nom": "SCI à l'IS",
        "definition": "La SCI à l'IS permet de détenir un ou plusieurs biens à plusieurs associés. Elle permet l'amortissement des biens et un pilotage plus professionnel, mais la fiscalité à la revente est moins favorable (plus-value sur valeur nette comptable).",
        "exemple": "Une SCI perçoit 40 000 € de loyers. Après charges et amortissements, le bénéfice est de 10 000 €, soumis à l'IS. Si les bénéfices sont distribués, ils sont ensuite imposés chez les associés.",
        "comparaison": "Structure efficace pour capitaliser/reinvestir, mais moins souple pour sortir les bénéfices sans surimposition.",
        "avantages": [
            "Amortissement fiscal des biens",
            "Bonne structuration pour gérer plusieurs biens ou associés",
            "Utile pour transmettre ou réinvestir"
        ],
        "inconvenients": [
            "Plus-value à la revente moins avantageuse qu'en nom propre",
            "Comptabilité obligatoire",
            "Double imposition possible en cas de distribution"
        ]
    },
    {
        "nom": "SAS",
        "definition": "La SAS est une société par actions très flexible utilisée pour des projets immobiliers professionnels. La rémunération du dirigeant est soumise aux cotisations sociales. Elle permet de faire entrer facilement des investisseurs.",
        "exemple": "Des associés créent une SAS pour investir dans plusieurs immeubles, avec possibilité d'accueillir des actionnaires externes.",
        "comparaison": "Structure adaptée aux projets ambitieux ou nécessitant des levées de fonds, mais plus lourde à gérer.",
        "avantages": [
            "Grande souplesse statutaire",
            "Attractive pour les investisseurs",
            "Séparation claire entre pouvoirs et répartition des profits"
        ],
        "inconvenients": [
            "Cotisations sociales sur la rémunération du dirigeant",
            "Comptabilité lourde",
            "Moins adaptée pour des petits projets ou en famille"
        ]
    },
    {
        "nom": "SARL",
        "definition": "La SARL est une société classique utilisée pour gérer un patrimoine immobilier. En version SARL de famille, elle peut opter pour l'impôt sur le revenu. Elle est souvent choisie pour des projets en couple ou en famille.",
        "exemple": "Un couple crée une SARL pour acheter un bien. En optant pour le régime IR (SARL de famille), ils peuvent imputer le résultat sur leur déclaration personnelle.",
        "comparaison": "Moins souple que la SAS, mais plus sécurisante pour les projets familiaux. La SARL de famille permet une imposition à l'IR sur option.",
        "avantages": [
            "Protection du patrimoine personnel",
            "Possible option pour l'IR (SARL de famille)",
            "Encadrement juridique rassurant"
        ],
        "inconvenients": [
            "Moins flexible que la SAS",
            "Gestion administrative obligatoire",
            "Changement de régime fiscal difficile une fois fixé"
        ]
    }
]