{
    "timestamp": "20250328_131931",
    "date": "2025-03-28T13:19:31.857907",
    "portfolios": {
        "Agressif": {
            "Commentaire": "En ce moment, les tensions géopolitiques et les préoccupations liées à l'inflation dominent le paysage économique mondial, notamment avec les tarifs douaniers qui pourraient exacerber les pressions inflationnistes. Les marchés européens et asiatiques affichent des performances variées, avec certains indices comme l'IBEX 35 et le NASDAQ Korea Large Mid Cap Index enregistrant des hausses YTD notables. Le secteur des matériaux connaît une volatilité, tandis que les secteurs technologiques et financiers montrent des signes de résistance. Dans ce portefeuille agressif, la stratégie mise sur les actifs à haut rendement comme les actions à forte croissance et les crypto-monnaies performantes, tout en intégrant un ETF pour diversifier le risque.",
            "Actions": {
                "DOMINARI HLDGS": "10%",
                "HALLMARK FINL": "9%",
                "EXTREME NETWORKS": "8%",
                "THYSSENKRUPP": "8%",
                "RHEINMETALL": "7%",
                "H&E EQUIPMENT SV": "7%"
            },
            "Crypto": {
                "ZetaChain (ZETA)": "5%",
                "Alchemist AI (ALCH)": "5%",
                "Safe (SAFE)": "5%",
                "Four (FORM)": "5%",
                "CARV (CARV)": "5%"
            },
            "ETF": {
                "EURO STOXX® Banks 30-15": "8%",
                "DAXglobal® Gold Miners": "8%",
                "Solactive Global Pure Gold Miners": "8%"
            },
            "Obligations": {}
        },
        "Modéré": {
            "Commentaire": "Malgré des inquiétudes macroéconomiques mondiales, certaines régions telles que l'Amérique Latine affichent des performances robustes, avec le NASDAQ Brazil Large Mid Cap Index en hausse significative. Les secteurs de l'énergie et des biens de consommation de base en Europe présentent une stabilité relative. Ce portefeuille modéré vise à équilibrer le risque en combinant des actions dynamiques, des ETF diversifiés et des obligations sélectionnées pour leur stabilité.",
            "Actions": {
                "QVC GROUP RG-B": "8%",
                "CLEARDAY": "7%",
                "GADSDENPROP REIT": "7%",
                "RADIUS-A": "7%"
            },
            "Crypto": {
                "Cronos (CRO)": "5%",
                "API3 (API3)": "5%"
            },
            "ETF": {
                "MSCI Emerging Markets Eastern Europe ex Russia": "8%",
                "NYSE Arca Gold Miners": "8%",
                "Solactive China Technology (EUR Hedged)": "8%"
            },
            "Obligations": {
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "12%",
                "Bloomberg Emerging Markets Local Currency Liquid Government Bond (EUR Hedged)": "12%",
                "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "13%"
            }
        },
        "Stable": {
            "Commentaire": "Les incertitudes économiques globales, notamment liées à l'inflation, nécessitent une approche prudente. Les marchés nord-américains montrent une certaine résilience malgré des performances YTD négatives. Les secteurs des services financiers et de la santé en Europe restent solides. Ce portefeuille stable se concentre sur la préservation du capital en intégrant des obligations de haute qualité et des ETF robustes, avec une allocation minimale en actions pour un potentiel de croissance modéré.",
            "Actions": {
                "RHEINMETALL": "8%",
                "H&E EQUIPMENT SV": "7%"
            },
            "Crypto": {},
            "ETF": {
                "STOXX® Europe 600 Banks": "8%",
                "MSCI Europe Financials 20/35 Capped": "8%",
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "8%"
            },
            "Obligations": {
                "Bloomberg US Long Treasury (EUR Hedged)": "12%",
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "12%",
                "JP Morgan USD Emerging Markets Diversified 3% capped 1-5 (EUR Hedged)": "12%",
                "Bloomberg MSCI US Liquid Corporates Sustainable (EUR Hedged)": "12%",
                "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "13%"
            }
        }
    }
}