{
    "timestamp": "20250403_135717",
    "date": "2025-04-03T13:57:17.751984",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les tensions géopolitiques actuelles et l'incertitude liée à l'inflation continuent d'affecter les marchés financiers. Les menaces de nouvelles taxes douanières aux États-Unis et les préoccupations sur l'inflation mondiale pèsent sur les actifs risqués. 📈 **Marchés** — Les marchés américains et européens ont subi des corrections récentes, notamment le NASDAQ en baisse de près de 9% YTD. En revanche, certains marchés d'Amérique Latine, comme le NASDAQ Brazil Large Mid Cap, montrent une résilience avec une hausse YTD de 14,78%. 🏭 **Secteurs** — Les secteurs technologiques et industriels européens montrent une certaine résilience malgré les baisses générales. Le secteur des technologies en Europe est en hausse YTD et pourrait bénéficier de la demande continue pour l'innovation. 📊 **Choix des actifs** — Le portefeuille agressif inclut des actions et des cryptomonnaies sélectionnées pour leur potentiel de rebond suite aux récentes corrections. Les cryptomonnaies comme EOS (7j: +38,93%) et Compound (7j: +3,25%) sont intégrées pour capter le potentiel de volatilité positive. Les ETF comme le Solactive China Technology offrent une exposition aux technologies émergentes, tandis que les actions sélectionnées comme RHEINMETALL (YTD 119.90%) et THALES (YTD 81.97%) sont positionnées pour profiter d'un éventuel rebond dans le secteur de la défense.",
            "Actions": {
                "RHEINMETALL": "10%",
                "THALES": "10%",
                "LEONARDO": "9%",
                "DASSAULT AVIATION": "8%",
                "ELBIT SYSTEMS LT": "8%"
            },
            "Crypto": {
                "EOS": "8%",
                "Compound (COMP)": "8%",
                "Walrus (WAL)": "7%",
                "Zcash (ZEC)": "7%"
            },
            "ETF": {
                "Solactive China Technology (EUR Hedged)": "10%",
                "NASDAQ Brazil Large Mid Cap Index": "10%"
            },
            "Obligations": {
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "5%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les préoccupations inflationnistes dominent les discussions économiques, avec des impacts notables sur les politiques monétaires globales. Les tensions commerciales impliquant les États-Unis sont également sous les feux de la rampe. 📈 **Marchés** — Les indices européens, bien que récemment en baisse, montrent des signes de stabilisation. En Amérique Latine, des indices comme le Santiago IGPA affichent une croissance notable. 🏭 **Secteurs** — Les secteurs de la finance et de la technologie continuent de montrer des signes de résilience, avec des opportunités spécifiques dans l'Europe et l'Asie. 📊 **Choix des actifs** — Le portefeuille modéré intègre un mélange d'ETF diversifiés et d'obligations pour équilibrer risque et rendement. Les ETF tels que le iBoxx® GBP Liquid Corporates offrent une stabilité, tandis que le NASDAQ Eurozone Financials capture une possible reprise dans le secteur financier européen. Les actions comme H&E EQUIPMENT SV apportent une exposition industrielle avec un potentiel de croissance.",
            "Actions": {
                "H&E EQUIPMENT SV": "8%",
                "RADIUS-A": "7%",
                "WILLAMETTE VY VI": "6%"
            },
            "Crypto": {
                "Compound (COMP)": "6%",
                "Zcash (ZEC)": "6%"
            },
            "ETF": {
                "NASDAQ Eurozone Financials Lg Md Cap EUR x (Inde)": "12%",
                "MSCI Emerging Markets Eastern Europe ex Russia": "12%"
            },
            "Obligations": {
                "ICE US Treasury 7-10 Year (EUR Hedged)": "10%",
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "10%",
                "JP Morgan USD Emerging Markets IG ESG Diversified Bond (EUR Hedged)": "8%",
                "Bloomberg Global Aggregate US Treasury Float Adjusted (EUR Hedged)": "8%",
                "Bloomberg US Aggregate Bond (EUR Hedged)": "7%"
            }
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — L'incertitude économique mondiale due aux tensions géopolitiques et à l'inflation reste élevée. Les plans tarifaires et les politiques monétaires sont surveillés de près. 📈 **Marchés** — Les marchés mondiaux présentent des tendances mixtes, avec des indices européens comme le CAC 40 en légère baisse. Toutefois, des indices comme le NASDAQ Mexico Large Mid Cap et le NASDAQ Chile Large Mid Cap montrent des performances YTD positives. 🏭 **Secteurs** — Les secteurs de la santé et des services financiers en Europe montrent une certaine résilience, soutenus par une demande stable. 📊 **Choix des actifs** — Le portefeuille stable favorise une allocation diversifiée avec une forte exposition aux obligations pour minimiser le risque. Les ETF comme le STOXX® Europe 600 Optimised Banks et les obligations de haute qualité telles que le Bloomberg US Government 10+ Year Inflation-Linked Bond (GBP Hedged) apportent une stabilité. Les actions telles que SES et CORCEPT THERAPEU offrent une exposition défensive aux secteurs de la communication et de la santé.",
            "Actions": {
                "SES": "8%",
                "CORCEPT THERAPEU": "7%",
                "ENERGY FOCUS": "6%",
                "COMPASS HLDGS-SBI": "5%"
            },
            "ETF": {
                "STOXX® Europe 600 Optimised Banks": "10%",
                "MSCI Greece IMI + Coca-Cola 20/35": "10%"
            },
            "Obligations": {
                "Bloomberg US Government 10+ Year Inflation-Linked Bond (GBP Hedged)": "15%",
                "iBoxx® MSCI ESG USD Emerging Markets Sovereigns Quality Weighted (EUR Hedged)": "14%",
                "Bloomberg Global Aggregate Corporate USD (EUR Hedged)": "10%",
                "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "10%"
            }
        }
    }
}