{
    "timestamp": "20250401_082016",
    "date": "2025-04-01T08:20:16.676827",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les récentes inquiétudes économiques, notamment aux États-Unis avec l'épuisement des consommateurs face à l'inflation, imposent une approche prudente malgré les signaux positifs de certaines entreprises technologiques. 📈 **Marchés** — Les marchés européens et asiatiques montrent des résultats YTD positifs, tandis que l'Amérique latine affiche des performances variées, avec des indices comme le NASDAQ Brazil Large Mid Cap Index en forte hausse. 🏭 **Secteurs** — Le secteur technologique en Europe et en Amérique latine se montre dynamique, tandis que l'énergie et les matières premières restent sous pression. 📊 **Choix des actifs** — Le portefeuille agressif mise sur la technologie et les crypto-monnaies pour capter la reprise potentielle de ces secteurs. Les ETF technologiques et les cryptos performantes comme FUNToken et Enzyme sont incluses pour leur potentiel de croissance futur.",
            "Actions": {
                "CHINA AUTO SYS": "8%",
                "HALLMARK FINL": "8%",
                "DOMINARI HLDGS": "8%",
                "QVC GROUP RG-B": "8%",
                "THYSSENKRUPP": "8%"
            },
            "Crypto": {
                "FUNToken (FUN)": "6%",
                "Enzyme (MLN)": "6%",
                "Zcash (ZEC)": "6%"
            },
            "ETF": {
                "Solactive China Technology (EUR Hedged)": "8%",
                "MSCI Emerging Markets Eastern Europe ex Russia": "8%",
                "Lyxor NetZero2050S&PWldClmPABDRETF": "8%"
            },
            "Obligations": {
                "Bloomberg US Long Treasury (EUR Hedged)": "8%",
                "JP Morgan Emerging Markets Risk-Aware Bond (EUR Hedged)": "8%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les tensions économiques aux États-Unis et en Europe renforcent la nécessité de diversifier les investissements. 📈 **Marchés** — Les indices européens montrent une performance positive, avec le DAX et le CAC 40 en croissance, tandis que l'Amérique latine affiche une certaine volatilité. 🏭 **Secteurs** — Les secteurs financiers et technologiques en Europe se distinguent, tandis que le matériel de base reste sous pression. 📊 **Choix des actifs** — Le portefeuille modéré combine des ETF diversifiés et des obligations pour équilibrer risque et rendement, incluant des ETF comme MSCI Europe Financials et des obligations émergentes pour leur stabilité relative.",
            "Actions": {
                "RHEINMETALL": "7%",
                "CORCEPT THERAPEU": "7%",
                "H&E EQUIPMENT SV": "7%"
            },
            "Crypto": {
                "Safe (SAFE)": "5%"
            },
            "ETF": {
                "MSCI Europe Financials 20/35 Capped": "7%",
                "STOXX® Europe Select Dividend 30": "7%",
                "Amundi MSCI Europe II ETF Acc": "7%"
            },
            "Obligations": {
                "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "10%",
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "10%",
                "Bloomberg MSCI Global High Yield Liquid Corporate ESG Weighted SRI Bond (EUR Hedged)": "10%",
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "10%"
            }
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — L'incertitude économique globale, avec des tensions sur les prix et des inquiétudes récessionnistes, incite à la prudence. 📈 **Marchés** — Les marchés européens, bien que positifs, montrent des signes de ralentissement potentiel, nécessitant une approche prudente. 🏭 **Secteurs** — Les secteurs de la consommation courante et des services de télécommunication affichent une stabilité relative par rapport à d'autres secteurs plus volatils. 📊 **Choix des actifs** — Le portefeuille stable privilégie les obligations et les ETF stables, tels que les obligations américaines à long terme et les ETF de dividendes, pour assurer une protection contre la volatilité.",
            "Actions": {
                "CLEARDAY": "5%",
                "GADSDENPROP REIT": "5%"
            },
            "ETF": {
                "EURO STOXX® Select Dividend 30": "7%",
                "Amundi MSCI Europe ESGBrdTrnstnETFDREURC": "7%",
                "SPDR® MSCI Europe Consumer Staples ETF": "7%"
            },
            "Obligations": {
                "ICE US Treasury 20+ Year (EUR Hedged)": "10%",
                "Bloomberg US Government Inflation-Linked Bond (EUR Hedged)": "10%",
                "JP Morgan USD Emerging Markets IG ESG Diversified Bond (EUR Hedged)": "10%",
                "Bloomberg US Aggregate Bond (EUR Hedged)": "10%",
                "JP Morgan EMBI Global Core (EUR Hedged)": "10%"
            }
        }
    }
}