{
    "timestamp": "20250604_082558",
    "date": "2025-06-04T08:25:58.590871",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les tensions commerciales entre les États-Unis et la Chine continuent d'influencer la volatilité des marchés, tandis que la Fed prévoit de maintenir des taux d'intérêt élevés jusqu'à fin 2025. 📈 **Marchés** — Les marchés européens montrent une résilience notable, notamment le DAX et le CAC 40, tandis que les marchés nord-américains sont plus fragiles avec une rotation sectorielle en cours. 🏭 **Secteurs** — Le secteur de la défense continue de croître, soutenu par l'augmentation des budgets militaires, tandis que le secteur technologique subit une correction. 📊 **Choix des actifs** — Le portefeuille agressif inclut des actions comme BAE Systems et Dassault Aviation, alignées avec la hausse des budgets de défense. Les ETF comme MarketVector Global Defense Industry reflètent la dynamique du secteur de la défense. Les cryptos comme ICON et ssv.network sont incluses pour leur potentiel de croissance dans un contexte de volatilité élevée.",
            "Actions": {
                "BAE SYSTEMS": "8%",
                "DASSAULT AVIATION": "7%",
                "COMMERZBANK": "6%",
                "K+S": "6%",
                "HEIDELBERGMAT": "6%"
            },
            "Crypto": {
                "ICON (ICX)": "5%",
                "ssv.network (SSV)": "5%"
            },
            "ETF": {
                "MarketVector Global Defense Industry": "10%",
                "Solactive Global Pure Gold Miners": "10%"
            },
            "Obligations": {},
            "ActifsExclus": [
                "Rheinmetall: +80% YTD mais risque de correction suite aux annonces de politique étrangère américaine",
                "LEONARDO: Potentielle surévaluation avec +109.33% YTD"
            ]
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les tensions commerciales et les taux d'intérêt élevés continuent de peser sur les marchés, mais les chiffres d'emploi américains meilleurs que prévus apportent une note positive. 📈 **Marchés** — Les marchés européens surperforment, tandis que les marchés émergents sont sous pression en raison d'un dollar fort. 🏭 **Secteurs** — Les secteurs défensifs comme les services publics et la défense montrent une résilience, tandis que le secteur technologique est en correction. 📊 **Choix des actifs** — Le portefeuille modéré inclut des actions comme E.ON et Elia Group, alignées avec la stabilité des services publics. Les ETF comme STOXX Europe 600 Optimised Banks reflètent la résilience du secteur bancaire européen. Les obligations choisies apportent une stabilité supplémentaire.",
            "Actions": {
                "E.ON": "7%",
                "Elia Group": "6%",
                "ING GROUP": "6%",
                "NN GROUP": "6%",
                "SPIE": "6%"
            },
            "Crypto": {},
            "ETF": {
                "STOXX Europe 600 Optimised Banks": "10%"
            },
            "Obligations": {
                "Bloomberg Emerging Markets Local Currency Liquid Government Bond (EUR Hedged)": "8%",
                "iBoxx® EUR Liquid High Yield": "8%"
            },
            "ActifsExclus": [
                "THALES: Potentielle surévaluation avec +95.96% YTD",
                "ROLLS-ROYCE HLDG: Potentielle surévaluation avec +54.87% YTD"
            ]
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — L'inflation persistante et les tensions géopolitiques continuent d'influencer les décisions des banques centrales, avec une anticipation de taux élevés jusqu'à fin 2025. 📈 **Marchés** — Les marchés européens montrent une stabilité relative, tandis que les marchés asiatiques restent sous pression. 🏭 **Secteurs** — Les secteurs des services publics et de la consommation de base offrent une stabilité, tandis que le secteur technologique subit une correction. 📊 **Choix des actifs** — Le portefeuille stable inclut des actions comme Coca-Cola HBC et Lindt & Sprüngli, alignées avec la stabilité du secteur de l'alimentation. Les ETF comme STOXX Europe 600 Utilities reflètent la résilience des services publics. Les obligations choisies apportent une stabilité supplémentaire.",
            "Actions": {
                "Coca-Cola HBC": "7%",
                "Lindt & Sprüngli": "6%",
                "AB INBEV": "6%",
                "FRESENIUS": "6%",
                "CARL ZEISS MEDITE": "6%"
            },
            "Crypto": {},
            "ETF": {
                "STOXX Europe 600 Utilities": "10%"
            },
            "Obligations": {
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "8%",
                "JP Morgan ESG EMBI Global Diversified (EUR Hedged)": "8%"
            },
            "ActifsExclus": [
                "LIVE VENTURES: Potentielle surévaluation avec +112.75% YTD",
                "SIEMENS ENERGY: Potentielle surévaluation avec +74.99% YTD"
            ]
        }
    }
}