{
    "timestamp": "20250403_140806",
    "date": "2025-04-03T14:08:06.145390",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les tensions autour des politiques tarifaires de Trump créent de l'incertitude sur les marchés, tandis que les cryptomonnaies continuent de chuter. 📈 **Marchés** — Les indices européens comme le CAC 40 et le DAX ont subi des baisses marquées, tandis que la volatilité reste élevée aux États-Unis avec le CBOE VIX INDEX en hausse. 📊 **Choix des actifs** — Le portefeuille agressif inclut des actions avec une forte performance YTD, telles que RHEINMETALL et THALES, justifiées par leur résilience dans un contexte d'incertitude. Les cryptomonnaies comme Compound et Zcash, qui montrent des signes positifs sur 7 jours, sont incluses pour leur potentiel de rebond. L'ETF 'Rhodium' est sélectionné pour son rendement élevé en 2025.",
            "Actions": {
                "RHEINMETALL": "10%",
                "THALES": "10%",
                "LEONARDO": "8%",
                "DASSAULT AVIATION": "8%",
                "ELBIT SYSTEMS LT": "6%"
            },
            "Crypto": {
                "Compound (COMP)": "12%",
                "Zcash (ZEC)": "10%",
                "EOS (EOS)": "5%",
                "PAX Gold (PAXG)": "5%"
            },
            "ETF": {
                "Rhodium": "8%",
                "DAXglobal® Gold Miners": "8%",
                "Solactive Global Pure Gold Miners": "10%"
            },
            "Obligations": {}
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les inquiétudes liées à l'inflation et aux tensions commerciales influencent les décisions d'investissement. 📈 **Marchés** — Les indices américains comme le S&P 500 montrent une stabilité relative, tandis que les indices asiatiques affichent une légère reprise. 🏭 **Secteurs** — Le secteur des matériaux et de la technologie montre des signes positifs malgré les incertitudes. 📊 **Choix des actifs** — Ce portefeuille inclut des actions stables comme H&E EQUIPMENT SV et SES, avec des ETF comme 'EURO STOXX® Banks 30-15' pour la diversification. Les obligations telles que 'Bloomberg US Treasury' apportent une stabilité supplémentaire.",
            "Actions": {
                "H&E EQUIPMENT SV": "8%",
                "SES": "8%",
                "CORCEPT THERAPEU": "6%",
                "SIFY SP ADR": "6%",
                "WILLAMETTE VY VI": "6%"
            },
            "Crypto": {
                "Litecoin (LTC)": "5%"
            },
            "ETF": {
                "EURO STOXX® Banks 30-15": "10%",
                "NYSE Arca Gold Miners": "10%"
            },
            "Obligations": {
                "Bloomberg US Treasury (EUR Hedged)": "10%",
                "iBoxx® MSCI ESG USD Asia ex-Japan High Yield Capped (EUR Hedged)": "10%",
                "ICE US Treasury 7-10 Year (EUR Hedged)": "5%"
            }
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — Les politiques monétaires et l'inflation continuent de dominer les discussions économiques. 📈 **Marchés** — Les marchés latino-américains, comme le NASDAQ Brazil, montrent une forte performance YTD. 🏭 **Secteurs** — Les secteurs de la finance et de l'énergie affichent une résilience face aux incertitudes. 📊 **Choix des actifs** — Le portefeuille stable se concentre sur des ETF comme 'MSCI Emerging Markets Eastern Europe ex Russia' pour la stabilité régionale, tandis que les obligations comme 'ICE US Treasury 7-10 Year' assurent une base sécurisée.",
            "Actions": {
                "CLEARDAY": "5%",
                "GADSDENPROP REIT": "5%",
                "RADIUS-A": "5%"
            },
            "Crypto": {},
            "ETF": {
                "MSCI Emerging Markets Eastern Europe ex Russia": "10%",
                "EURO STOXX® Select Dividend 30": "10%"
            },
            "Obligations": {
                "ICE US Treasury 7-10 Year (EUR Hedged)": "10%",
                "Bloomberg US Long Treasury (EUR Hedged)": "10%",
                "JP Morgan USD Emerging Markets IG ESG Diversified Bond (EUR Hedged)": "10%",
                "Bloomberg US Aggregate Bond (EUR Hedged)": "10%",
                "Refinitiv Qualified Global Convertible (EUR Hedged)": "10%"
            }
        }
    }
}