{
    "timestamp": "20250326_122414",
    "date": "2025-03-26T12:24:14.512945",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 Actualités — Les perspectives économiques mondiales restent incertaines avec des pressions inflationnistes persistantes, notamment aux États-Unis, où l'inflation continue d'affecter les marchés financiers. 📈 Marchés — Les indices américains, bien que stables, montrent une légère baisse au cours de l'année, tandis que l'Amérique latine, avec des indices comme le NASDAQ Brazil et Mexico, présente une forte performance YTD. 🏭 Secteurs — Les secteurs les plus performants incluent les matériaux de base et le secteur automobile, avec des hausses notables. 📊 Choix des actifs — Le portefeuille agressif inclut des actions à haute croissance comme DOMINARI HLDGS et CHINA AUTO SYS, et un ETF performant tel que le EURO STOXX® Banks pour capturer la volatilité du marché.",
            "Actions": {
                "DOMINARI HLDGS": "24.0%",
                "CHINA AUTO SYS": "12%",
                "HALLMARK FINL": "10%",
                "QVC GROUP RG-B": "9%",
                "THYSSENKRUPP": "8%",
                "RHEINMETALL": "8%",
                "CLEARDAY": "8%",
                "H&E EQUIPMENT SV": "7%",
                "RADIUS-A": "7%",
                "WILLAMETTE VY VI": "7%"
            },
            "ETF": {}
        },
        "Modéré": {
            "Commentaire": "📰 Actualités — En Europe, les marchés restent sous pression mais montrent des signes de résilience dans certains secteurs comme les services financiers. 📈 Marchés — Les indices européens, tels que le CAC 40 et le DAX, affichent des performances solides YTD malgré des baisses récentes. 📊 Choix des actifs — Le portefeuille modéré incorpore un mélange équilibré d'actions stables comme THYSSENKRUPP et RHEINMETALL, et un ETF de banque pour stabiliser la volatilité. Un ETF performant comme le DAXglobal® Gold Miners est inclus pour diversifier le portefeuille.",
            "Actions": {
                "THYSSENKRUPP": "64.0%",
                "RHEINMETALL": "8%",
                "CLEARDAY": "7%",
                "H&E EQUIPMENT SV": "7%",
                "RADIUS-A": "7%",
                "WILLAMETTE VY VI": "7%"
            },
            "ETF": {},
            "Obligations": {}
        },
        "Stable": {
            "Commentaire": "📰 Actualités — Les prévisions économiques mondiales restent stables malgré les incertitudes sur l'inflation. 📈 Marchés — L'Amérique latine et certaines parties de l'Asie affichent une croissance notable YTD, offrant des opportunités d'investissement. 📊 Choix des actifs — Le portefeuille stable privilégie les actifs avec un historique de performance solide, comme le NASDAQ Brazil Large Mid Cap Index et les ETF dans le secteur des banques, pour une stabilité accrue.",
            "Actions": {
                "HALLMARK FINL": "58.0%",
                "QVC GROUP RG-B": "6%",
                "THYSSENKRUPP": "6%",
                "RHEINMETALL": "6%",
                "CLEARDAY": "6%",
                "H&E EQUIPMENT SV": "6%",
                "RADIUS-A": "6%",
                "WILLAMETTE VY VI": "6%"
            },
            "ETF": {},
            "Obligations": {}
        }
    }
}