{
    "timestamp": "20250401_142723",
    "date": "2025-04-01T14:27:23.475875",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les tensions liées aux tarifs et la volatilité des marchés aux États-Unis et en Europe influencent fortement les décisions d'investissement. Les inquiétudes sur les crypto-actifs et le ralentissement économique global ajoutent à l'incertitude. 📈 **Marchés** — Les marchés européens affichent des gains notables, notamment le DAX avec +12,77% YTD, tandis que les indices américains comme le NASDAQ sont en baisse. En Asie, la performance est mitigée, avec des indices comme le NASDAQ Korea en hausse. 🏭 **Secteurs** — Les matériaux et la technologie montrent une bonne dynamique, tandis que les services financiers sont en retrait. 📊 **Choix des actifs** — Ce portefeuille privilégie les actifs à fort potentiel de croissance, avec une exposition notable aux crypto-monnaies performantes et aux ETFs dynamiques. Les choix incluent des crypto-monnaies comme EOS et MKR, ainsi que des ETFs axés sur la technologie et l'or pour capter l'optimisme du marché.",
            "Actions": {
                "RHEINMETALL": "7%",
                "H&E EQUIPMENT SV": "7%",
                "THALES": "6%",
                "LEONARDO": "6%",
                "DASSAULT AVIATION": "6%"
            },
            "Crypto": {
                "Maker (MKR)": "8%",
                "EOS (EOS)": "8%",
                "Curve DAO Token (CRV)": "7%",
                "Toncoin (TON)": "7%"
            },
            "ETF": {
                "Solactive Global Pure Gold Miners": "8%",
                "Solactive China Technology": "7%",
                "EURO STOXX® Banks": "7%",
                "MSCI Emerging Markets Eastern Europe ex Russia": "7%"
            },
            "Obligations": {
                "Bloomberg MSCI USD Liquid Investment Grade Corporate SRI PAB (EUR Hedged)": "7%",
                "JP Morgan USD Emerging Markets Diversified 3% capped 1-5 (EUR Hedged)": "7%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les perspectives économiques mixtes aux États-Unis et en Europe influencent les décisions d'allocation d'actifs. La prudence est de mise face aux incertitudes tarifaires et aux résultats financiers mitigés. 📈 **Marchés** — Malgré une performance négative des indices américains, des opportunités d'investissement apparaissent en Europe, notamment dans le secteur technologique. 🏭 **Secteurs** — Les secteurs des matériaux de base et de la technologie bénéficient d'une bonne dynamique. 📊 **Choix des actifs** — Le portefeuille modéré intègre des actifs stables avec un potentiel de croissance, notamment des obligations sélectionnées pour leur faible risque et des ETFs diversifiés pour une exposition équilibrée aux secteurs porteurs.",
            "Actions": {
                "THALES": "5%",
                "SES": "5%",
                "WILLAMETTE VY VI": "5%",
                "LEONARDO": "5%"
            },
            "Crypto": {
                "Toncoin (TON)": "6%",
                "Curve DAO Token (CRV)": "6%"
            },
            "ETF": {
                "MSCI Europe Financials 20/35 Capped": "7%",
                "Solactive China Technology": "7%",
                "FTSE Developed Europe ex UK All Cap ex CW ex TC ex REITS Dividend Growth with Quality": "6%"
            },
            "Obligations": {
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "7%",
                "JP Morgan Emerging Markets Risk-Aware Bond (EUR Hedged)": "7%",
                "Bloomberg US Government Inflation-Linked Bond (EUR Hedged)": "7%",
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "7%"
            }
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — Les conditions économiques mondiales restent incertaines, mais certains secteurs montrent des signes de stabilité. La prudence est essentielle face aux fluctuations du marché. 📈 **Marchés** — Les indices européens comme le DAX et le CAC 40 affichent des gains annuels, tandis que l'Amérique latine montre une reprise partielle. 🏭 **Secteurs** — Les secteurs des services publics et des biens de consommation de base sont relativement stables. 📊 **Choix des actifs** — Le portefeuille stable se concentre sur des actifs à faible risque, incluant des obligations de haute qualité et des ETFs stables pour garantir un rendement prévisible, tout en intégrant des actions avec un potentiel de croissance modérée.",
            "Actions": {
                "THALES": "6%",
                "SOCIETE GENERALE": "6%",
                "DASSAULT AVIATION": "6%",
                "ELBIT SYSTEMS LT": "6%"
            },
            "ETF": {
                "MSCI Europe Financials Screened 20-35": "7%",
                "Solactive Global Pure Gold Miners": "7%",
                "STOXX® Europe 600 Optimised Banks": "6%"
            },
            "Obligations": {
                "Bloomberg US Aggregate Bond (EUR Hedged)": "7%",
                "ICE US Treasury 20+ Year (EUR Hedged)": "7%",
                "iBoxx® MSCI ESG USD Emerging Markets Sovereigns Quality Weighted (EUR Hedged)": "7%",
                "Bloomberg US Government 1-10 Year Inflation-Linked Bond (GBP Hedged)": "7%",
                "FTSE Emerging Markets USD Government and Government-Related Bond Select (EUR Hedged)": "7%"
            }
        }
    }
}