{
    "timestamp": "20250326_103016",
    "date": "2025-03-26T10:30:16.229941",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 Actualités — Les perspectives économiques mondiales sont mitigées avec des tensions inflations persistantes et des incertitudes géopolitiques. 📈 Marchés — Les marchés d'Amérique latine affichent des performances robustes, notamment le NASDAQ Brazil Large Mid Cap Index avec un YTD de 16,87 %. En revanche, les indices asiatiques montrent une légère faiblesse. 🏭 Secteurs — Le secteur de l'énergie et des matériaux présente des hausses significatives, avec des indices comme le NASDAQ US Oil & Gas Producers et NASDAQ US Basic Matls affichant une croissance. 📊 Choix des actifs — Le portefeuille agressif se concentre sur des actions à forte croissance et des ETF performants pour maximiser les rendements.",
            "Actions": {
                "NETWORK ENGINES INC": "30.0%",
                "DOMINARI HLDGS": "10%",
                "CHINA AUTO SYS": "10%",
                "HALLMARK FINL": "10%",
                "QVC GROUP RG-B": "10%",
                "THYSSENKRUPP": "10%",
                "RHEINMETALL": "10%",
                "Apple": "2.0%",
                "Microsoft": "2.0%",
                "Google": "2.0%"
            },
            "ETF": {
                "Vanguard S&P 500": "2.0%",
                "iShares MSCI World": "2.0%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 Actualités — Les prévisions économiques restent prudentes avec une attention particulière sur les politiques monétaires et les niveaux d'inflation. 📈 Marchés — Les marchés européens et nord-américains montrent une stabilité relative avec des indices tels que le S&P 500 et le DOW JONES variant faiblement. 📊 Choix des actifs — Le portefeuille modéré privilégie une diversification équilibrée entre des actions stables et des ETF bien performants pour un risque modéré.",
            "Actions": {
                "CLEARDAY": "48.0%",
                "H&E EQUIPMENT SV": "8%",
                "RADIUS-A": "8%",
                "Constellation Energy": "8%",
                "Costco": "8%",
                "Porsche": "8%",
                "Apple": "2.0%",
                "Microsoft": "2.0%",
                "Google": "2.0%"
            },
            "ETF": {
                "Vanguard S&P 500": "2.0%",
                "iShares MSCI World": "2.0%",
                "Invesco QQQ": "2.0%"
            }
        },
        "Stable": {
            "Commentaire": "📰 Actualités — Les conditions économiques sont marquées par une inflation sous contrôle et une croissance modérée. 📈 Marchés — Les indices nord-américains comme le DOW JONES et le S&P 500 indiquent une légère stabilité, tandis que l'Europe montre des signes de reprise modérée. 🏭 Secteurs — Les secteurs de la consommation de base et des services publics offrent des opportunités stables. 📊 Choix des actifs — Le portefeuille stable est composé d'actions de grandes entreprises stables et d'ETF pour minimiser le risque et assurer une croissance constante.",
            "Actions": {
                "McCormick": "46.0%",
                "Constellation Energy": "10%",
                "Costco": "10%",
                "RHEINMETALL": "10%",
                "THYSSENKRUPP": "10%",
                "Apple": "2.0%"
            },
            "ETF": {
                "Vanguard S&P 500": "2.0%",
                "iShares MSCI World": "2.0%",
                "Invesco QQQ": "2.0%"
            },
            "Obligations": {
                "US Treasury 1Y": "2.0%",
                "US Treasury 3Y": "2.0%",
                "German Bunds 2Y": "2.0%"
            }
        }
    }
}