{
    "timestamp": "20250403_152740",
    "date": "2025-04-03T15:27:40.762465",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 Actualités — La volatilité des cryptomonnaies, exacerbée par des événements géopolitiques et des annonces tarifaires aux États-Unis, a entraîné une dynamique de marché incertaine. 📈 Marchés — Les marchés nord-américains ont subi des pertes notables avec le NASDAQ Composite en baisse de -5,60%, tandis que l'Amérique latine montre une certaine résilience, notamment le NASDAQ Brazil Large Mid Cap Index avec une hausse de 16,79% YTD. 🏭 Secteurs — Le secteur technologique en Europe, malgré sa récente baisse, offre des opportunités de reprise à long terme. 📊 Choix des actifs — Ce portefeuille est conçu pour capturer le potentiel de rebond des cryptomonnaies performantes sur 7 jours et exploiter les secteurs en croissance en Amérique latine et en Europe, tout en intégrant des ETF pour diversifier les risques.",
            "Actions": {
                "CLEARDAY": "7%",
                "GADSDENPROP REIT": "7%",
                "H&E EQUIPMENT SV": "7%",
                "RADIUS-A": "7%",
                "THALES": "7%"
            },
            "Crypto": {
                "EOS": "7%",
                "PAX Gold (PAXG)": "7%",
                "Compound (COMP)": "7%",
                "Zcash (ZEC)": "7%",
                "Solayer (LAYER)": "7%"
            },
            "ETF": {
                "DAXglobal® Gold Miners": "7%",
                "Solactive Global Pure Gold Miners": "7%",
                "NASDAQ Brazil Large Mid Cap Index": "7%",
                "Amundi MSCI China Tech ETF EUR": "7%",
                "Lyxor MSCI EMU Growth ETF DR Dist": "7%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 Actualités — Les tensions commerciales et les incertitudes économiques continuent d’influencer les décisions d’investissement, avec un impact notable sur les indices européens. 📈 Marchés — Les indices européens, tels que le DAX et le CAC 40, montrent une performance négative, mais la région affiche un potentiel de stabilisation. 🏭 Secteurs — Les secteurs de l'énergie et des matériaux en Europe présentent des opportunités de croissance modérée. 📊 Choix des actifs — Ce portefeuille modéré combine des actions européennes stables, des ETF diversifiés et des obligations pour équilibrer le risque et capturer un potentiel de croissance moyen.",
            "Actions": {
                "LEONARDO": "6%",
                "DASSAULT AVIATION": "6%",
                "ELBIT SYSTEMS LT": "6%",
                "SES": "6%",
                "WILLAMETTE VY VI": "6%"
            },
            "Crypto": {
                "Compound (COMP)": "6%",
                "PAX Gold (PAXG)": "6%"
            },
            "ETF": {
                "EURO STOXX® Optimised Banks": "6%",
                "NYSE Arca Gold Miners": "6%",
                "Amundi MSCI China ESG Ldrs ETF Acc": "6%",
                "Amundi FTSE 100 ETF Acc": "6%"
            },
            "Obligations": {
                "iBoxx® GBP Liquid Corporates Large Cap (EUR Hedged)": "6%",
                "ICE US Treasury 7-10 Year (EUR Hedged)": "6%"
            }
        },
        "Stable": {
            "Commentaire": "📰 Actualités — L'inflation demeure une préoccupation centrale, influençant les politiques monétaires à travers le monde. 📈 Marchés — Les marchés asiatiques présentent une stabilité relative, avec une faible volatilité, tandis que les indices nord-américains sont sous pression. 🏭 Secteurs — Les secteurs des services financiers et des biens de consommation en Europe montrent une certaine résilience. 📊 Choix des actifs — Le portefeuille stable se concentre sur des ETF et des obligations solides, complétés par des actions de secteurs défensifs pour minimiser le risque tout en assurant un rendement constant.",
            "Actions": {
                "CORCEPT THERAPEU": "5%",
                "ENERGY FOCUS": "5%",
                "U.S. GOLD": "5%"
            },
            "ETF": {
                "FTSE Time-Weighted US Fallen Angel Bond Select": "5%",
                "MSCI Europe Financials 20/35 Capped": "5%",
                "Bloomberg Global Aggregate US Treasury Float Adjusted (EUR Hedged)": "5%",
                "Amundi IS Global Infrastructure ETF": "5%"
            },
            "Obligations": {
                "ICE US Treasury Inflation-Linked Bond 0-5 Years (EUR Hedged)": "5%",
                "JP Morgan USD Emerging Markets IG ESG Diversified Bond (EUR Hedged)": "5%",
                "Bloomberg US Treasury (EUR Hedged)": "5%",
                "Bloomberg Emerging Markets Local Currency Liquid Government Bond (EUR Hedged)": "5%",
                "Bloomberg MSCI USD Corporate Float-Adjusted Liquid Bond Screened (EUR Hedged)": "5%"
            }
        }
    }
}