{
    "timestamp": "20250407_144125",
    "date": "2025-04-07T14:41:25.020366",
    "portfolios": {
        "Agressif": {
            "Commentaire": "📰 **Actualités** — Les préoccupations concernant une récession aux États-Unis continuent de croître, alimentées par des signaux économiques négatifs. Cependant, certains secteurs technologiques montrent des signes de résilience, notamment avec la récente performance positive de NVDA et TSLA. 📈 **Marchés** — Les indices nord-américains, en particulier le NASDAQ, ont connu une légère baisse, tandis que l'Amérique latine a montré une certaine résilience avec des indices comme le Santiago IGPA affichant des gains annuels. 🏭 **Secteurs** — Le secteur technologique est dynamique, tout comme les services financiers en Europe, malgré des pertes récentes. 📊 **Choix des actifs** — Le portefeuille agressif inclut des actions et crypto-monnaies avec un potentiel de croissance future, comme THYSSENKRUPP et MANTRA, soutenus par des tendances sectorielles et géographiques positives. Les ETF tels que Solactive China Technology sont inclus pour exploiter les tendances technologiques en Asie.",
            "Actions": {
                "THYSSENKRUPP": "8%",
                "RHEINMETALL": "8%",
                "ALAUNOS": "7%",
                "THALES": "7%",
                "LEONARDO": "7%"
            },
            "Crypto": {
                "MANTRA (OM)": "5%",
                "EOS (EOS)": "5%",
                "Compound (COMP)": "5%",
                "Grass (GRASS)": "5%"
            },
            "ETF": {
                "Solactive China Technology (EUR Hedged)": "10%",
                "DAXglobal® Gold Miners": "10%"
            },
            "Obligations": {
                "Bloomberg US Long Treasury (EUR Hedged)": "10%",
                "ICE US Treasury 20+ Year (EUR Hedged)": "10%",
                "JP Morgan USD Emerging Markets IG ESG Diversified Bond (EUR Hedged)": "10%"
            }
        },
        "Modéré": {
            "Commentaire": "📰 **Actualités** — Les tensions inflationnistes persistent en Europe, mais certains analystes prévoient une détente à moyen terme. 📈 **Marchés** — Les marchés européens, bien que confrontés à des baisses récentes, montrent des signes de stabilité à long terme. 🏭 **Secteurs** — Les secteurs des ressources de base et de la technologie en Europe restent attractifs malgré les conditions macroéconomiques difficiles. 📊 **Choix des actifs** — Le portefeuille modéré inclut une combinaison d'ETF de secteurs stables comme l'énergie et des obligations pour équilibrer le risque. Les actions telles que RADIUS-A sont choisies pour leur potentiel de croissance dans un contexte européen stabilisé.",
            "Actions": {
                "RADIUS-A": "8%",
                "WILLAMETTE VY VI": "8%",
                "CORCEPT THERAPEU": "8%",
                "SES": "8%"
            },
            "Crypto": {
                "Pendle (PENDLE)": "5%"
            },
            "ETF": {
                "Bloomberg Natural Gas (EUR Hedged)": "10%",
                "STOXX® Europe 600 Banks": "10%",
                "MSCI Emerging Markets Eastern Europe ex Russia": "10%"
            },
            "Obligations": {
                "Bloomberg US 7-10 Year Treasury Bond (EUR Hedged)": "10%",
                "Solactive Global Multilateral Development Bank Bond USD 25% Issuer Capped (EUR Hedged)": "10%",
                "Bloomberg MSCI USD Liquid Investment Grade Corporate SRI PAB (EUR Hedged)": "10%",
                "Bloomberg US Government Inflation-Linked Bond (EUR Hedged)": "8%"
            }
        },
        "Stable": {
            "Commentaire": "📰 **Actualités** — Les corrections économiques aux États-Unis et en Europe sont perçues comme une normalisation attendue après des périodes de volatilité. 📈 **Marchés** — Les marchés européens et nord-américains montrent des signes de consolidation, avec des indices stables comme le S&P 500 et le CAC 40. 🏭 **Secteurs** — Le secteur des services publics et des télécommunications montre une stabilité relative, offrant un refuge en période d'incertitude. 📊 **Choix des actifs** — Le portefeuille stable privilégie les ETF et obligations avec des profils de risque faible. Les actifs tels que les obligations gouvernementales et les ETF sectoriels sur les services publics assurent une protection contre la volatilité.",
            "Actions": {
                "H&E EQUIPMENT SV": "5%",
                "TEAM": "5%",
                "COMPASS HLDGS-SBI": "5%"
            },
            "Crypto": {},
            "ETF": {
                "STOXX® Europe 600 Utilities": "10%",
                "MSCI Europe Utilities 20/35 Capped": "10%",
                "Amundi Euro Stoxx Banks ETF Acc": "5%",
                "Lyxor STOXX Europe 600 Real Est ETF Dist": "5%"
            },
            "Obligations": {
                "Bloomberg US Long Treasury (GBP Hedged)": "10%",
                "Bloomberg US Aggregate Bond (EUR Hedged)": "10%",
                "JP Morgan Government Bond Global (EUR Hedged)": "10%",
                "Bloomberg US 3-7 Year Treasury Bond (EUR Hedged)": "10%",
                "iBoxx® USD Treasuries (EUR Hedged)": "10%"
            }
        }
    }
}