{
    "timestamp": "20250325_161625",
    "date": "2025-03-25T16:16:25.332900",
    "portfolios": {
        "Agressif": {
            "Commentaire": "Ce portefeuille se concentre sur des actifs très volatils avec un potentiel de rendement élevé. Les actions dominent, incluant des entreprises avec une forte performance YTD, comme Dominari Holdings et China Auto Sys. En raison de l'incertitude macroéconomique, notamment aux États-Unis, les crypto-monnaies et ETF spéculatifs sont également inclus pour capter les gains potentiels dans des marchés volatils.",
            "Actions": {
                "DOMINARI HLDGS": "15%",
                "CHINA AUTO SYS": "15%",
                "HALLMARK FINL": "10%",
                "QVC GROUP RG-B": "10%",
                "THYSSENKRUPP": "10%",
                "EXTREME NETWORKS": "10%",
                "RHEINMETALL": "8%",
                "CLEARDAY": "7%"
            },
            "Crypto": {
                "Bitcoin": "10%"
            },
            "ETF": {
                "EURO STOXX® Banks 30-15": "5%"
            }
        },
        "Modéré": {
            "Commentaire": "Ce portefeuille vise un équilibre entre la croissance et la stabilité. Il inclut des blue chips et ETF diversifiés, en se concentrant sur les secteurs en croissance comme l'énergie et les services financiers. Le DAX et le NASDAQ Brazil Large Mid Cap Index sont inclus pour bénéficier de la croissance européenne et latino-américaine.",
            "Actions": {
                "H&E EQUIPMENT SV": "10%",
                "RADIUS-A": "10%",
                "LULULEMON": "8%",
                "RHEINMETALL": "8%"
            },
            "ETF": {
                "EURO STOXX® Banks": "10%",
                "NASDAQ Brazil Large Mid Cap Index": "10%",
                "DAXglobal® Gold Miners": "10%"
            },
            "Obligations": {
                "Corporate Bonds": "24%"
            }
        },
        "Stable": {
            "Commentaire": "Ce portefeuille est orienté vers des actifs défensifs pour minimiser les risques dans un contexte économique incertain, notamment aux États-Unis. Les obligations souveraines et les valeurs refuges constituent la majorité du portefeuille, avec une exposition minimale aux actions et ETF stables.",
            "Actions": {
                "RHEINMETALL": "5%",
                "CLEARDAY": "5%"
            },
            "Obligations": {
                "US Treasury Bonds": "30%",
                "German Bunds": "30%"
            },
            "ETF": {
                "Rhodium": "10%",
                "NASDAQ US Telecom Large Mid Cap Index": "10%",
                "NASDAQ Israel Large Mid Cap Index": "10%"
            }
        }
    }
}